#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьФормуПоПараметрам(Параметры);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Сформировать(Команда)
	СтруктураЗакрытия = Новый Структура("НачалоПериода,КонецПериода,Организация,Владелец,ДоговорКонтрагента,Номенклатура,Склад,Урожай,ВидХранения,
	|ВыводитьТолькоОбороты,ПоказыватьПереоформление,ПоказыватьУсушку,ИтогиЗаМесяц,ИтогиЗаДень,ТолькоОборотЗаДень,РасшифроватьИтоги,
	|ВыводитьПоказателиКачестваСТочностьюДоОдногоЗнака,НумерацияСтраниц,НачальнаяСтраницаДляНумерации");
	
	СтруктураНастроек = ЗаполнитьСтруктуру(СтруктураЗакрытия);
	Закрыть(СтруктураНастроек);

КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции
	
&НаСервере
Функция ЗаполнитьСтруктуру(СтруктураФормы)
	
	 СтруктураВозврата = Новый Структура;
	 Для каждого Свойство Из СтруктураФормы Цикл
		ЗначениеФормы = ЭтотОбъект[Свойство.Ключ];
	 	СтруктураВозврата.Вставить(Свойство.Ключ,ЗначениеФормы);
	 КонецЦикла; 
	 
	 Возврат СтруктураВозврата;	
		
КонецФункции

Процедура ЗаполнитьФормуПоПараметрам(СтруктураНастроек)
	
	СтруктураЗаполнения = Новый Структура("НачалоПериода,КонецПериода,Организация,Владелец,ДоговорКонтрагента,Номенклатура,Склад,Урожай,ВидХранения,
	|ВыводитьТолькоОбороты,ПоказыватьПереоформление,ПоказыватьУсушку,ИтогиЗаМесяц,ИтогиЗаДень,ТолькоОборотЗаДень,РасшифроватьИтоги,
	|ВыводитьПоказателиКачестваСТочностьюДоОдногоЗнака,НумерацияСтраниц,НачальнаяСтраницаДляНумерации,Общая");
	
	Для каждого Свойство Из СтруктураЗаполнения Цикл
		Если СтруктураНастроек.Свойство(Свойство.Ключ) Тогда
			ЭтотОбъект[Свойство.Ключ] = СтруктураНастроек[Свойство.Ключ];
		КонецЕсли; 
	КонецЦикла;   	
		
КонецПроцедуры

&НаКлиенте
Процедура ИтогиЗаДеньПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность() 
	Элементы.ТолькоОборотЗаДень.Доступность = ИтогиЗаДень;
	Элементы.Владелец.Доступность = Не Общая;
	Элементы.ДоговорКонтрагента.Доступность = Не Общая;
	Элементы.ПоказыватьПереоформление.Доступность = Не Общая;
КонецПроцедуры

#КонецОбласти 

 
