#Область ПрограммныйИнтерфейс

// Устанавливает список счетов учета
//
Процедура УстановитьСписокСчетовУчетаНоменклатурыБА(СтруктураДопПараметров) Экспорт
	
	ИНАГРО_КорректировкаСтоимостиСервер.УстановитьСписокСчетовУчетаНоменклатурыБА(СтруктураДопПараметров);
		 
КонецПроцедуры

// Производит расчет.
//
Процедура РассчитатьСписаниеПоСреднейБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	
	ИНАГРО_КорректировкаСтоимостиСервер.РассчитатьСписаниеПоСреднейБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров);
	
КонецПроцедуры 

// Получает таблицу операций
//
Функция ПолучитьТаблицуОперацийСписанияБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	
	ИНАГРО_КорректировкаСтоимостиСервер.ПолучитьТаблицуОперацийСписанияБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров);
		
КонецФункции

// Получает таблицу операций
//
Функция ПолучитьТаблицуОперацийСписанияКомплектов(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	
	ИНАГРО_КорректировкаСтоимостиСервер.ПолучитьТаблицуОперацийСписанияКомплектов(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров)	
		
КонецФункции

#КонецОбласти