#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "СотрудникСсылка");
	
	ОформленПриемНаРаботу = Ложь;
	
	КадровыеДанные = КадровыйУчет.КадровыеДанныеСотрудников(Истина, СотрудникСсылка, "ОформленПриемНаРаботу", ТекущаяДатаСеанса());
	Если КадровыеДанные.Количество() > 0 Тогда
		ОформленПриемНаРаботу = КадровыеДанные[0].ОформленПриемНаРаботу;
	КонецЕсли; 
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"КнопкаОформитьПриемНаРаботу",
		"Видимость",
		НЕ ОформленПриемНаРаботу);
		
	КадровыеДокументы.Параметры.УстановитьЗначениеПараметра("Сотрудник", Параметры.СотрудникСсылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	СотрудникиКлиент.ЗарегистрироватьОткрытиеФормы(ЭтаФорма, "КадровыеДокументы");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	СотрудникиКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОформитьПриемНаРаботу(Команда)

	ИНАГРО_ЗарплатаКадрыРасширенныйКлиент.ОформитьНаОсновании(ЭтаФорма, СотрудникСсылка, "Документы.ИНАГРО_ПриемНаРаботуВОрганизацию");

КонецПроцедуры

&НаКлиенте
Процедура ОформитьКадровыйПеревод(Команда)

	ИНАГРО_ЗарплатаКадрыРасширенныйКлиент.ОформитьНаОсновании(ЭтаФорма, СотрудникСсылка, "Документы.ИНАГРО_КадровоеПеремещениеОрганизаций");

КонецПроцедуры

&НаКлиенте
Процедура ОформитьУвольнение(Команда)

	ИНАГРО_ЗарплатаКадрыРасширенныйКлиент.ОформитьНаОсновании(ЭтаФорма, СотрудникСсылка, "Документы.ИНАГРО_УвольнениеИзОрганизаций");

КонецПроцедуры

&НаКлиенте
Процедура ОформитьДоговорГПХ(Команда)

	ИНАГРО_ЗарплатаКадрыРасширенныйКлиент.ОформитьНаОсновании(ЭтаФорма, СотрудникСсылка, "Документы.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом");

КонецПроцедуры

#КонецОбласти