#Область ОбработчикиСобытий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Ложь;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.ПереключательКачества = 1;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийРеквизитов

&НаКлиенте
Процедура ВлажностьВышеПриИзменении(Элемент)
	Если Отчет.ВлажностьВыше Тогда
		Отчет.ВлажностьНеВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаКлиенте
Процедура СорнаяПримесьНеВышеПриИзменении(Элемент)
	Если Отчет.СорнаяПримесьНеВыше Тогда
		Отчет.СорнаяПримесьВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаКлиенте
Процедура СорнаяПримесьВышеПриИзменении(Элемент)
	Если Отчет.СорнаяПримесьВыше Тогда
		Отчет.СорнаяПримесьНеВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

&НаКлиенте
Процедура ВлажностьНеВышеПриИзменении(Элемент)
	Если Отчет.ВлажностьНеВыше Тогда
		Отчет.ВлажностьВыше = Ложь;	
	КонецЕсли;
	УстановитьДоступностьЗначенийОтборов();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура Отбор(Команда)
	Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость = Не Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость; 
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УстановитьДоступностьЗначенийОтборов()
	Элементы.ЗначениеОтбораПоВлажностиВыше.Доступность = Отчет.ВлажностьВыше;
	Элементы.ЗначениеОтбораПоВлажностиНеВыше.Доступность = Отчет.ВлажностьНеВыше;
	
	Элементы.ЗначениеОтбораПоСорнойПримесиВыше.Доступность = Отчет.СорнаяПримесьВыше;
	Элементы.ЗначениеОтбораПоСорнойПримесиНеВыше.Доступность = Отчет.СорнаяПримесьНеВыше;
КонецПроцедуры

#КонецОбласти