#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)
	 	
	// ИНАГРО ++
	Если (ИменаПараметровСеанса <> Неопределено) И (ИменаПараметровСеанса.Найти("ИНАГРО_ДанныеПодсистем") <> Неопределено) Тогда
		ИНАГРО_СЛК.ИнициализироватьПараметрыСеансаСЛК();
	КонецЕсли;
	// ИНАГРО --
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	// ТехнологияСервиса
	ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец ТехнологияСервиса
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли