#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Очистить  = Истина;
	Заполнить = Истина;
	Параметры.Свойство("НеОткрыватьФормуНастройкиФормированияРеестров", НеОткрыватьФормуНастройкиФормированияРеестров);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьОперации(Команда)
	
	ВыполнитьОперацииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьОперацииНаСервере()
	
	Если Очистить Тогда
		НовыеНастройки = РегистрыСведений.ИНАГРО_НастройкиФормированияРеестровТТН.СоздатьНаборЗаписей();
		НовыеНастройки.Записать();	
	КонецЕсли;
	
	Если Заполнить Тогда
	    Обработки.ИНАГРО_ОбновлениеИнформационнойБазы.ЗаполнитьНастройкиФормированияРеестров();	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти