#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("ВедущийОбъект", ОбъектВладелец);
	УстановитьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = Запись.Физлицо;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ИНАГРО_ЗарплатаКадрыРасширенныйКлиент.ОповеститьОЗавершении(ЭтаФорма, "ИНАГРО_ВоинскийУчет", ОбъектВладелец);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФизлицоПриИзменении(Элемент)
	
	Заголовок = Запись.Физлицо;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтношениеКВоинскойОбязанностиПриИзменении(Элемент)
	
	УстановитьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ОтношениеКВоинскомуУчетуПриИзменении(Элемент)
	
	УстановитьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ЗваниеПриИзменении(Элемент)
	
	УстановитьДоступность();

КонецПроцедуры

&НаКлиенте
Процедура ГодностьПриИзменении(Элемент)
	
	УстановитьДоступность();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьДоступность()
	
	Состав = Запись.Звание.Состав; 
	
	Офицер	  = (Состав = ПредопределенноеЗначение("Перечисление.ИНАГРО_СоставыВоеннослужащих.МладшиеОфицеры")
	         ИЛИ Состав = ПредопределенноеЗначение("Перечисление.ИНАГРО_СоставыВоеннослужащих.СтаршиеОфицеры")
	         ИЛИ Состав = ПредопределенноеЗначение("Перечисление.ИНАГРО_СоставыВоеннослужащих.ВысшиеОфицеры"));
	
	Призывник = (Запись.ОтношениеКВоинскойОбязанности = ПредопределенноеЗначение("Перечисление.ИНАГРО_ОтношениеКВоинскойОбязанности.Призывник"));
	
	Состоит   = НЕ (Запись.ОтношениеКВоинскойОбязанности = ПредопределенноеЗначение("Перечисление.ИНАГРО_ОтношениеКВоинскойОбязанности.НеВоеннообязанный")
	            ИЛИ Запись.ОтношениеКВоинскомуУчету = ПредопределенноеЗначение("Перечисление.ИНАГРО_ОтношениеКВоинскомуУчету.НеСостоит"));
	
	Снят	  = (Запись.ОтношениеКВоинскомуУчету = ПредопределенноеЗначение("Перечисление.ИНАГРО_ОтношениеКВоинскомуУчету.СнятПоВозрасту"))
	        ИЛИ (Запись.ОтношениеКВоинскомуУчету = ПредопределенноеЗначение("Перечисление.ИНАГРО_ОтношениеКВоинскомуУчету.СнятПоСостояниюЗдоровья"));
	
	Годен	  = Запись.Годность = ПредопределенноеЗначение("Перечисление.ИНАГРО_ГодностьКВоеннойСлужбе.Годен");
	
	Элементы.Годность.Доступность                  = Состоит И (НЕ Офицер) И (НЕ Призывник);
	Элементы.Звание.Доступность	                   = Состоит И (НЕ Призывник);
	Элементы.ЗабронированОрганизацией.Доступность  = Состоит И (НЕ Призывник);
	Элементы.НаличиеМобпредписания.Доступность     = Состоит И (НЕ Призывник);
	Элементы.Военкомат.Доступность                 = Состоит;
	Элементы.ОснованиеНегодности.Доступность       = Состоит И (((НЕ Офицер) И (НЕ Годен)) ИЛИ (Офицер И Снят))  И (НЕ Призывник);
	Элементы.ВУС.Доступность                       = Состоит И (НЕ Призывник);
	Элементы.СпецУчет.Доступность                  = Состоит;
	Элементы.Группа.Доступность                    = Состоит И (НЕ Офицер) И (НЕ Призывник);
	Элементы.Категория.Доступность                 = Состоит И (НЕ Призывник);
	Элементы.Профиль.Доступность                   = Состоит И Офицер И (НЕ Призывник);
	Элементы.ДатаИНомерПриказаОПризыве.Доступность = (Запись.ОтношениеКВоинскомуУчету = ПредопределенноеЗначение("Перечисление.ИНАГРО_ОтношениеКВоинскомуУчету.ПризванНаВоинскуюСлужбу"));
	
	Очистка();
	
КонецПроцедуры 

&НаСервере
Процедура Очистка()
	
	Для каждого Ресурс Из Метаданные.РегистрыСведений.ИНАГРО_ВоинскийУчет.Ресурсы Цикл
		
		ИмяРесурса = Ресурс.Имя;
		
		// очистим неиспользуемые значения
		Если (НЕ Элементы[ИмяРесурса].Доступность) Тогда
			
			Если ТипЗнч(Запись[ИмяРесурса]) = Тип("Булево") Тогда
				Если Запись[ИмяРесурса] Тогда					
					Запись[ИмяРесурса] = Ложь;					
				КонецЕсли;
			ИначеЕсли ЗначениеЗаполнено(Запись[ИмяРесурса]) Тогда				
				Запись[ИмяРесурса] = NULL; 				
			КонецЕсли; 
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти