#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
	// Акт расчет
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_АктРасчет";
	КомандаПечати.Представление = НСтр("ru='Акт расчет';uk='Акт розрахунку'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокументаОбщая,ФормаСписка,ФормаДокумента";
		
	// Акт расчет 310
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "ПФ_MXL_АктРасчет310";
	//КомандаПечати.Представление = НСтр("ru='Акт расчет 310';uk='Акт розрахунку 310'");
	//КомандаПечати.ЗаголовокФормы= НСтр("ru='Акт расчет 310';uk='Акт розрахунку 310'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента,ФормаДокументаОбщая";
	//КомандаПечати.Порядок       = 100;
		
	// Акт расчет 661
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_АктРасчет661";
	КомандаПечати.Представление = НСтр("ru='Акт расчет 661';uk='Акт розрахунку 661'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Акт расчет 661';uk='Акт розрахунку 661'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента,ФормаДокументаОбщая";
	КомандаПечати.Порядок       = 100;
	
	// Акт расчет 661
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_АктРасчет661_2021";
	КомандаПечати.Представление = НСтр("ru='Акт расчет 661 (2021)';uk='Акт розрахунку 661 (2021)'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Акт расчет 661 (2021)';uk='Акт розрахунку 661 (2021)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаДокумента,ФормаДокументаОбщая";
	КомандаПечати.Порядок       = 100;
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Акт расчета (и-№310)""';uk='Реєстр документів ""Акт розрахунку (і-№310)""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
			
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктРасчет") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АктРасчет", НСтр("ru=Акт расчет';uk='Акт розрахунку'"), 
		ПечатьАктРасчет(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,"Документ.ИНАГРО_АктРасчет310.ПФ_MXL_АктРасчет", , Истина);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктРасчет310") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ПФ_MXL_АктРасчет310", НСтр("ru='Акт расчет 310';uk='Акт розрахунку 310'"),
		ПечатьАктРасчет310(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,"Документ.ИНАГРО_АктРасчет310.ПФ_MXL_АктРасчет310", , Истина);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктРасчет661") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ПФ_MXL_АктРасчет661", НСтр("ru='Акт расчет 661';uk='Акт розрахунку 661'"),
		ПечатьАктРасчет661(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,"Документ.ИНАГРО_АктРасчет310.ПФ_MXL_АктРасчет661", , Истина);
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктРасчет661_2021") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"ПФ_MXL_АктРасчет661_2021", НСтр("ru='Акт расчет 661 (2021)';uk='Акт розрахунку 661 (2021)'"),
		ПечатьАктРасчет661_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,"Документ.ИНАГРО_АктРасчет310.ПФ_MXL_АктРасчет661_2021", , Истина);
	КонецЕсли;
	
КонецПроцедуры 

Функция ПечатьАктРасчет(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_MXL_АктРасчет");
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИНАГРО_АктРасчет310.Номер,
	|	ИНАГРО_АктРасчет310.ФизическийВес3,
	|	ИНАГРО_АктРасчет310.Урожай,
	|	ИНАГРО_АктРасчет310.Влажность3,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь3,
	|	ИНАГРО_АктРасчет310.ФизическийВес4,
	|	ИНАГРО_АктРасчет310.Влажность4,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь4,
	|	ИНАГРО_АктРасчет310.Влажность8,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь8,
	|	ИНАГРО_АктРасчет310.УбыльВлажности,
	|	ИНАГРО_АктРасчет310.УбыльПоВлажности,
	|	ИНАГРО_АктРасчет310.УбыльСорнойПримеси,
	|	ИНАГРО_АктРасчет310.УбыльПоСорнойПримеси,
	|	ИНАГРО_АктРасчет310.УбыльЕстественная,
	|	ИНАГРО_АктРасчет310.УбыльПоЕстественной,
	|	ИНАГРО_АктРасчет310.ФизическийВес8,
	|	ИНАГРО_АктРасчет310.ФизическийВес11,
	|	ИНАГРО_АктРасчет310.ФизическийВесПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.ФизическийВес41,
	|	ИНАГРО_АктРасчет310.ФизическийВес5,
	|	ИНАГРО_АктРасчет310.ФизическийВес6,
	|	ИНАГРО_АктРасчет310.ФизическийВес7,
	|	ИНАГРО_АктРасчет310.Ссылка КАК Ссылка,
	|	ИНАГРО_АктРасчет310.Дата КАК Дата,
	|	Ном.НаименованиеПолное КАК НаименованиеПолноеНом,
	|	Организации.НаименованиеПолное КАК НаименованиеПолноеОрганизации,
	|	Ном.БазоваяЕдиницаИзмерения КАК БазоваяЕдиницаИзмеренияНом,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолноеКонтрагенты,
	|	Организации.Наименование КАК НаименованиеОрганизации
	|ИЗ
	|	Документ.ИНАГРО_АктРасчет310 КАК ИНАГРО_АктРасчет310
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ИНАГРО_АктРасчет310.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ИНАГРО_АктРасчет310.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ИНАГРО_АктРасчет310.Владелец = Контрагенты.Ссылка
	|ГДЕ
	|	ИНАГРО_АктРасчет310.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока Выборка.Следующий() Цикл
		ВыборкаДетальныеЗаписи = Выборка.Выбрать();
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		
		Шапка.Параметры.НомерДок = Выборка.Номер;
		Шапка.Параметры.ДатаДок = Формат(Выборка.Дата, "ДЛФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		Шапка.Параметры.ФизическийВес3 =Выборка.ФизическийВес3;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Шапка.Параметры.Фирма = ВыборкаДетальныеЗаписи.НаименованиеПолноеОрганизации;
			//Шапка.Параметры.ФирмаКр = ВыборкаДетальныеЗаписи.НаименованиеОрганизации;
			Шапка.Параметры.Владелец =ВыборкаДетальныеЗаписи.НаименованиеПолноеКонтрагенты;
			Шапка.Параметры.БазЕдиница = ВыборкаДетальныеЗаписи.БазоваяЕдиницаИзмеренияНом;
			Шапка.Параметры.ТМЦ = ВыборкаДетальныеЗаписи.НаименованиеПолноеНом;
			
		КонецЦикла;
		
		Шапка.Параметры.Урожай = Выборка.Урожай;
		Шапка.Параметры.Влажность3 = Выборка.Влажность3;
		Шапка.Параметры.СорнаяПримесь3 = Выборка.СорнаяПримесь3;
		
		Шапка.Параметры.ФизическийВес4 = Выборка.ФизическийВес4;
		Шапка.Параметры.Влажность4 = Выборка.Влажность4;
		Шапка.Параметры.СорнаяПримесь4 = Выборка.СорнаяПримесь4;
		
		Шапка.Параметры.Влажность8 = Выборка.Влажность8;
		Шапка.Параметры.СорнаяПримесь8 = Выборка.СорнаяПримесь8;
		Шапка.Параметры.УбыльВлажности = Выборка.УбыльВлажности;
		Шапка.Параметры.УбыльПоВлажности = Выборка.УбыльПоВлажности;
		Шапка.Параметры.УбыльСорнойПримеси = Выборка.УбыльСорнойПримеси;
		Шапка.Параметры.УбыльПоСорнойПримеси = Выборка.УбыльПоСорнойПримеси;
		Шапка.Параметры.УбыльЕстественная = Выборка.УбыльЕстественная;
		Шапка.Параметры.УбыльПоЕстественной = Выборка.УбыльПоЕстественной;
		Шапка.Параметры.УбыльОб = Выборка.УбыльПоВлажности + Выборка.УбыльПоСорнойПримеси + Выборка.УбыльПоЕстественной;
		Шапка.Параметры.ФизическийВес8 = Выборка.ФизическийВес8;
		Шапка.Параметры.ФизическийВесВыдано = Выборка.ФизическийВес11 + Выборка.ФизическийВесПереоформленияРасход;
		Шапка.Параметры.ФизическийВес41= Выборка.ФизическийВес41;
		Шапка.Параметры.ФизическийВес5 = Выборка.ФизическийВес5;
		Шапка.Параметры.ФизическийВес6 = Выборка.ФизическийВес6;
		Шапка.Параметры.ФизическийВес7 = Выборка.ФизическийВес7;
		Шапка.Параметры.ФизическийВес41_5_6_7 = Выборка.ФизическийВес41 + Выборка.ФизическийВес5 + Выборка.ФизическийВес6 + Выборка.ФизическийВес7;
		//
		ТабДокумент.Вывести(Шапка);
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции 

Функция ПечатьАктРасчет310(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_MXL_АктРасчет310");
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.НаименованиеПолное КАК НаименованиеПолноеОрганизация,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолноеВладелец,
	|	Контрагенты.КодПоЕДРПОУ КАК КодПоЕДРПОУВладелец,
	|	ИНАГРО_АктРасчет310.Ссылка КАК Ссылка,
	|	Ном.НаименованиеПолное КАК НаименованиеПолноеНом,
	|	ИНАГРО_АктРасчет310.ФизическийВес41,
	|	ИНАГРО_АктРасчет310.ФизическийВес5,
	|	ИНАГРО_АктРасчет310.ФизическийВес6,
	|	ИНАГРО_АктРасчет310.ФизическийВес7,
	|	ИНАГРО_АктРасчет310.ФизическийВес3,
	|	ИНАГРО_АктРасчет310.УбыльПоВлажности,
	|	ИНАГРО_АктРасчет310.УбыльПоСорнойПримеси,
	|	ИНАГРО_АктРасчет310.ФизическийВес8,
	|	ИНАГРО_АктРасчет310.ФизическийВес11,
	|	ИНАГРО_АктРасчет310.ФизическийВесПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.Дата,
	|	ИНАГРО_АктРасчет310.Организация,
	|	ИНАГРО_АктРасчет310.Владелец,
	|	ИНАГРО_АктРасчет310.ДоговорКонтрагента,
	|	ИНАГРО_АктРасчет310.Склад,
	|	ИНАГРО_АктРасчет310.Номенклатура,
	|	ИНАГРО_АктРасчет310ДвиженияДокумента.Документ,
	|	ИНАГРО_АктРасчет310ДвиженияДокумента.ВесРасход,
	|	ИНАГРО_АктРасчет310ДвиженияДокумента.УбыльВесаПриСушке,
	|	ИНАГРО_ДополнительныеРеквизитыНоменклатуры.Номенклатура КАК Номенклатура1,
	|	ИНАГРО_ДополнительныеРеквизитыНоменклатуры.ВидКультуры
	|ИЗ
	|	Документ.ИНАГРО_АктРасчет310 КАК ИНАГРО_АктРасчет310
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ИНАГРО_АктРасчет310.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ИНАГРО_АктРасчет310.Владелец = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Ном
	|		ПО ИНАГРО_АктРасчет310.Номенклатура = Ном.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_АктРасчет310.ДвиженияДокумента КАК ИНАГРО_АктРасчет310ДвиженияДокумента
	|		ПО ИНАГРО_АктРасчет310.Ссылка = ИНАГРО_АктРасчет310ДвиженияДокумента.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИНАГРО_ДополнительныеРеквизитыНоменклатуры КАК ИНАГРО_ДополнительныеРеквизитыНоменклатуры
	|		ПО ИНАГРО_АктРасчет310.Номенклатура = ИНАГРО_ДополнительныеРеквизитыНоменклатуры.Номенклатура
	|ГДЕ
	|	ИНАГРО_АктРасчет310.Ссылка В(&МассивОбъектов)
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
		
		ЗначенияБазисов = ИНАГРО_Элеватор.ПолучитьБазисныеЗначения(ВыборкаДетальныеЗаписи.ВидКультуры, ВыборкаСсылка.Дата, ВыборкаСсылка.Организация, ВыборкаСсылка.Владелец, ВыборкаСсылка.ДоговорКонтрагента, ВыборкаСсылка.Склад);
		
		Страница1 = Макет.ПолучитьОбласть("Страница1");

		Страница1.Параметры.БазисВлажности = ЗначенияБазисов.Влажность;
		Страница1.Параметры.БазисСорнаяПримесь = ЗначенияБазисов.СорнаяПримесь;
		Страница1.Параметры.БазисЗерноваяПримесь = ЗначенияБазисов.ЗерноваяПримесь;
		
		Страница2 = Макет.ПолучитьОбласть("Страница2");
		УбыльОтСушкиЧистки = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Страница1.Параметры.Фирма = ВыборкаДетальныеЗаписи.НаименованиеПолноеОрганизация;
			Страница1.Параметры.Владелец = ВыборкаДетальныеЗаписи.НаименованиеПолноеВладелец;
			Страница1.Параметры.ТМЦ = ВыборкаДетальныеЗаписи.НаименованиеПолноеНом;
			Страница1.Параметры.ЕДРПОУ = ВыборкаДетальныеЗаписи.КодПоЕДРПОУВладелец;
			
			Если ТипЗнч(ВыборкаДетальныеЗаписи.Документ)=Тип("ДокументСсылка.ИНАГРО_Форма34Сводная") Тогда
				УбыльОтСушкиЧистки = УбыльОтСушкиЧистки + ВыборкаДетальныеЗаписи.ВесРасход + ВыборкаДетальныеЗаписи.УбыльВесаПриСушке;
			КонецЕсли;
		КонецЦикла;
		ТабДокумент.Вывести(Страница1);
		УбыльОтОчистки = ВыборкаСсылка.ФизическийВес41 + ВыборкаСсылка.ФизическийВес5 +  ВыборкаСсылка.ФизическийВес6 +  ВыборкаСсылка.ФизическийВес7;
		
		Страница2.Параметры.Яч_2_2 = ВыборкаСсылка.ФизическийВес3-УбыльОтСушкиЧистки;
		Страница2.Параметры.Яч_2_3 = ВыборкаСсылка.ФизическийВес3 - ВыборкаСсылка.УбыльПоВлажности - ВыборкаСсылка.УбыльПоСорнойПримеси - УбыльОтОчистки;
		Страница2.Параметры.Яч_2_7 = ВыборкаСсылка.ФизическийВес8 + ВыборкаСсылка.ФизическийВес11 + ВыборкаСсылка.ФизическийВесПереоформленияРасход;
		Страница2.Параметры.ДатаДок = Формат(ВыборкаСсылка.Дата, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		Страница2.Параметры.УбыльОтОчистки = УбыльОтОчистки;
		ТабДокумент.Вывести(Страница2);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // ПечатьДокумента()

Функция ПечатьАктРасчет661(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_MXL_АктРасчет661");
	
	// регламентированная печ. форма
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИНАГРО_АктРасчет310.ВлажностьВнутрРасход КАК ВлажностьВнутрРасход,
	|	ИНАГРО_АктРасчет310.Ссылка КАК Ссылка,
	|	ИНАГРО_АктРасчет310.ВерсияДанных КАК ВерсияДанных,
	|	ИНАГРО_АктРасчет310.ПометкаУдаления КАК ПометкаУдаления,
	|	ИНАГРО_АктРасчет310.Номер КАК Номер,
	|	ИНАГРО_АктРасчет310.Дата КАК Дата,
	|	ИНАГРО_АктРасчет310.Проведен КАК Проведен,
	|	ИНАГРО_АктРасчет310.БалансСора КАК БалансСора,
	|	ИНАГРО_АктРасчет310.ВесПоВлажностиРасход КАК ВесПоВлажностиРасход,
	|	ИНАГРО_АктРасчет310.ВесПовышениеВсего КАК ВесПовышениеВсего,
	|	ИНАГРО_АктРасчет310.ВесПоСорнойПримесиРасход КАК ВесПоСорнойПримесиРасход,
	|	ИНАГРО_АктРасчет310.ВесУбыльВсего КАК ВесУбыльВсего,
	|	ИНАГРО_АктРасчет310.ВидОперации КАК ВидОперации,
	|	ИНАГРО_АктРасчет310.ВидХранения КАК ВидХранения,
	|	ИНАГРО_АктРасчет310.Владелец КАК Владелец,
	|	ИНАГРО_АктРасчет310.Влажность11 КАК Влажность11,
	|	ИНАГРО_АктРасчет310.Влажность3 КАК Влажность3,
	|	ИНАГРО_АктРасчет310.Влажность4 КАК Влажность4,
	|	ИНАГРО_АктРасчет310.Влажность41 КАК Влажность41,
	|	ИНАГРО_АктРасчет310.Влажность5 КАК Влажность5,
	|	ИНАГРО_АктРасчет310.Влажность6 КАК Влажность6,
	|	ИНАГРО_АктРасчет310.Влажность7 КАК Влажность7,
	|	ИНАГРО_АктРасчет310.Влажность8 КАК Влажность8,
	|	ИНАГРО_АктРасчет310.ВлажностьВнутрПриход КАК ВлажностьВнутрПриход,
	|	ИНАГРО_АктРасчет310.ВлажностьОстаткаНаНачало КАК ВлажностьОстаткаНаНачало,
	|	ИНАГРО_АктРасчет310.ВлажностьОстатокПоПеревзвешиванию КАК ВлажностьОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.ВлажностьПереоформленияПриход КАК ВлажностьПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ВлажностьПереоформленияРасход КАК ВлажностьПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.ВлажностьФизическийВесПриход КАК ВлажностьФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.ВыставитьУслугиОчисткиСушки КАК ВыставитьУслугиОчисткиСушки,
	|	ИНАГРО_АктРасчет310.ДатаНачала КАК ДатаНачала,
	|	ИНАГРО_АктРасчет310.ДатаОкончания КАК ДатаОкончания,
	|	ИНАГРО_АктРасчет310.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесь3 КАК ЗерноваяПримесь3,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесь4 КАК ЗерноваяПримесь4,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесь8 КАК ЗерноваяПримесь8,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьВнутрПриход КАК ЗерноваяПримесьВнутрПриход,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьОстаткаНаНачало КАК ЗерноваяПримесьОстаткаНаНачало,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьОстатокПоПеревзвешиванию КАК ЗерноваяПримесьОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьПереоформленияПриход КАК ЗерноваяПримесьПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьФизическийВесПриход КАК ЗерноваяПримесьФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.Комментарий КАК Комментарий,
	|	ИНАГРО_АктРасчет310.КорректироватьЗачетныйВес КАК КорректироватьЗачетныйВес,
	|	ИНАГРО_АктРасчет310.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
	|	ИНАГРО_АктРасчет310.НачалоВнутрПриход КАК НачалоВнутрПриход,
	|	ИНАГРО_АктРасчет310.НачалоВнутрРасход КАК НачалоВнутрРасход,
	|	ИНАГРО_АктРасчет310.НачалоПереоформленияПриход КАК НачалоПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.НачалоПереоформленияРасход КАК НачалоПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.НачалоПриход КАК НачалоПриход,
	|	ИНАГРО_АктРасчет310.НачалоРасход КАК НачалоРасход,
	|	ИНАГРО_АктРасчет310.НеРассчитыватьУбыльПриХранении КАК НеРассчитыватьУбыльПриХранении,
	|	ИНАГРО_АктРасчет310.НеСписыватьНеиспользованноеПраво КАК НеСписыватьНеиспользованноеПраво,
	|	ИНАГРО_АктРасчет310.Номенклатура КАК Номенклатура,
	|	ИНАГРО_АктРасчет310.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ИНАГРО_АктРасчет310.НомерАнализа КАК НомерАнализа,
	|	ИНАГРО_АктРасчет310.ОкончаниеВнутрПриход КАК ОкончаниеВнутрПриход,
	|	ИНАГРО_АктРасчет310.ОкончаниеВнутрРасход КАК ОкончаниеВнутрРасход,
	|	ИНАГРО_АктРасчет310.ОкончаниеПереоформленияПриход КАК ОкончаниеПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ОкончаниеПереоформленияРасход КАК ОкончаниеПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.ОкончаниеПриход КАК ОкончаниеПриход,
	|	ИНАГРО_АктРасчет310.ОкончаниеРасход КАК ОкончаниеРасход,
	|	ИНАГРО_АктРасчет310.ОписаниеДвиженияФормы36 КАК ОписаниеДвиженияФормы36,
	|	ИНАГРО_АктРасчет310.Организация КАК Организация,
	|	ИНАГРО_АктРасчет310.ОстатокНаНачало КАК ОстатокНаНачало,
	|	ИНАГРО_АктРасчет310.ОстатокПоПеревзвешиванию КАК ОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.Ответственный КАК Ответственный,
	|	ИНАГРО_АктРасчет310.ОтражатьВБухгалтерскомУчете КАК ОтражатьВБухгалтерскомУчете,
	|	ИНАГРО_АктРасчет310.ОтражатьПоЗатратам КАК ОтражатьПоЗатратам,
	|	ИНАГРО_АктРасчет310.ПечататьОкончательныйАкт КАК ПечататьОкончательныйАкт,
	|	ИНАГРО_АктРасчет310.ПовышениеВлажности КАК ПовышениеВлажности,
	|	ИНАГРО_АктРасчет310.ПовышениеПоВлажности КАК ПовышениеПоВлажности,
	|	ИНАГРО_АктРасчет310.ПовышениеПоСорнойПримеси КАК ПовышениеПоСорнойПримеси,
	|	ИНАГРО_АктРасчет310.ПовышениеСорнойПримеси КАК ПовышениеСорнойПримеси,
	|	ИНАГРО_АктРасчет310.ПодразделениеЗатраты КАК ПодразделениеЗатраты,
	|	ИНАГРО_АктРасчет310.ПодразделениеОрганизацииЗатраты КАК ПодразделениеОрганизацииЗатраты,
	|	ИНАГРО_АктРасчет310.ПроводилиОчистку КАК ПроводилиОчистку,
	|	ИНАГРО_АктРасчет310.ПроводилиСушку КАК ПроводилиСушку,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьОтходов1Категории КАК ПрогнозируемаяВлажностьОтходов1Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьОтходов2Категории КАК ПрогнозируемаяВлажностьОтходов2Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьОтходов3Категории КАК ПрогнозируемаяВлажностьОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьПобочныхПродуктов КАК ПрогнозируемаяВлажностьПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьОтходов1Категории КАК ПрогнозируемаяСорнаяПримесьОтходов1Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьОтходов2Категории КАК ПрогнозируемаяСорнаяПримесьОтходов2Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьОтходов3Категории КАК ПрогнозируемаяСорнаяПримесьОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьПобочныхПродуктов КАК ПрогнозируемаяСорнаяПримесьПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесОтходов1Категории КАК ПрогнозируемыйВесОтходов1Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесОтходов2Категории КАК ПрогнозируемыйВесОтходов2Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесОтходов3Категории КАК ПрогнозируемыйВесОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесПобочныхПродуктов КАК ПрогнозируемыйВесПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйПроцентОтходов3Категории КАК ПрогнозируемыйПроцентОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйПроцентПобочныхПродуктов КАК ПрогнозируемыйПроцентПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.Склад КАК Склад,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь11 КАК СорнаяПримесь11,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь3 КАК СорнаяПримесь3,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь4 КАК СорнаяПримесь4,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь41 КАК СорнаяПримесь41,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь5 КАК СорнаяПримесь5,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь6 КАК СорнаяПримесь6,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь7 КАК СорнаяПримесь7,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь8 КАК СорнаяПримесь8,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьВнутрПриход КАК СорнаяПримесьВнутрПриход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьВнутрРасход КАК СорнаяПримесьВнутрРасход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьОстаткаНаНачало КАК СорнаяПримесьОстаткаНаНачало,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьОстатокПоПеревзвешиванию КАК СорнаяПримесьОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьПереоформленияПриход КАК СорнаяПримесьПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьПереоформленияРасход КАК СорнаяПримесьПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьФизическийВесПриход КАК СорнаяПримесьФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.СписатьЗачетныйВес КАК СписатьЗачетныйВес,
	|	ИНАГРО_АктРасчет310.СпособРасчетаОтходов3Категории КАК СпособРасчетаОтходов3Категории,
	|	ИНАГРО_АктРасчет310.СпособРасчетаПобочногоПродукта КАК СпособРасчетаПобочногоПродукта,
	|	ИНАГРО_АктРасчет310.СпособРасчетаПредварительногоАктаРасчета КАК СпособРасчетаПредварительногоАктаРасчета,
	|	ИНАГРО_АктРасчет310.СпособХранения КАК СпособХранения,
	|	ИНАГРО_АктРасчет310.СрокХраненияДней КАК СрокХраненияДней,
	|	ИНАГРО_АктРасчет310.СрокХраненияМесяцев КАК СрокХраненияМесяцев,
	|	ИНАГРО_АктРасчет310.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ИНАГРО_АктРасчет310.Субконто1 КАК Субконто1,
	|	ИНАГРО_АктРасчет310.Субконто2 КАК Субконто2,
	|	ИНАГРО_АктРасчет310.Субконто3 КАК Субконто3,
	|	ИНАГРО_АктРасчет310.СчетЗатрат КАК СчетЗатрат,
	|	ИНАГРО_АктРасчет310.УбыльВлажности КАК УбыльВлажности,
	|	ИНАГРО_АктРасчет310.УбыльЕстественная КАК УбыльЕстественная,
	|	ИНАГРО_АктРасчет310.УбыльПоВлажности КАК УбыльПоВлажности,
	|	ИНАГРО_АктРасчет310.УбыльПоЕстественной КАК УбыльПоЕстественной,
	|	ИНАГРО_АктРасчет310.УбыльПоПрочей КАК УбыльПоПрочей,
	|	ИНАГРО_АктРасчет310.УбыльПоСорнойПримеси КАК УбыльПоСорнойПримеси,
	|	ИНАГРО_АктРасчет310.УбыльПрочая КАК УбыльПрочая,
	|	ИНАГРО_АктРасчет310.УбыльСорнойПримеси КАК УбыльСорнойПримеси,
	|	ИНАГРО_АктРасчет310.УдалитьВидДеятельностиНДС КАК УдалитьВидДеятельностиНДС,
	|	ИНАГРО_АктРасчет310.УдалитьВидНалоговойДеятельности КАК УдалитьВидНалоговойДеятельности,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность1 КАК УдалитьВлажность1,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность10 КАК УдалитьВлажность10,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность2 КАК УдалитьВлажность2,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность9 КАК УдалитьВлажность9,
	|	ИНАГРО_АктРасчет310.УдалитьВлажностьОстаткаНаКонец КАК УдалитьВлажностьОстаткаНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьВсеДвижения КАК УдалитьВсеДвижения,
	|	ИНАГРО_АктРасчет310.УдалитьЗакрытьПартиюПоВладельцу КАК УдалитьЗакрытьПартиюПоВладельцу,
	|	ИНАГРО_АктРасчет310.УдалитьЗерноваяПримесьОстаткаНаКонец КАК УдалитьЗерноваяПримесьОстаткаНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьОстатокНаКонец КАК УдалитьОстатокНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьПоФакту КАК УдалитьПоФакту,
	|	ИНАГРО_АктРасчет310.УдалитьРасчетныйСчет КАК УдалитьРасчетныйСчет,
	|	ИНАГРО_АктРасчет310.УдалитьРодительскийДокумент КАК УдалитьРодительскийДокумент,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь1 КАК УдалитьСорнаяПримесь1,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь10 КАК УдалитьСорнаяПримесь10,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь2 КАК УдалитьСорнаяПримесь2,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь9 КАК УдалитьСорнаяПримесь9,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесьОстаткаНаКонец КАК УдалитьСорнаяПримесьОстаткаНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьСрокОплаты КАК УдалитьСрокОплаты,
	|	ИНАГРО_АктРасчет310.УдалитьСтатьяПриростаУбылиЗапасов КАК УдалитьСтатьяПриростаУбылиЗапасов,
	|	ИНАГРО_АктРасчет310.УдалитьСчетУчетаБУ КАК УдалитьСчетУчетаБУ,
	|	ИНАГРО_АктРасчет310.УдалитьТолькоЗарегистрировать КАК УдалитьТолькоЗарегистрировать,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес1 КАК УдалитьФизическийВес1,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес10 КАК УдалитьФизическийВес10,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес2 КАК УдалитьФизическийВес2,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес9 КАК УдалитьФизическийВес9,
	|	ИНАГРО_АктРасчет310.Урожай КАК Урожай,
	|	ИНАГРО_АктРасчет310.Усушка КАК Усушка,
	|	ИНАГРО_АктРасчет310.ФизическийВес11 КАК ФизическийВес11,
	|	ИНАГРО_АктРасчет310.ФизическийВес3 КАК ФизическийВес3,
	|	ИНАГРО_АктРасчет310.ФизическийВес4 КАК ФизическийВес4,
	|	ИНАГРО_АктРасчет310.ФизическийВес41 КАК ФизическийВес41,
	|	ИНАГРО_АктРасчет310.ФизическийВес5 КАК ФизическийВес5,
	|	ИНАГРО_АктРасчет310.ФизическийВес6 КАК ФизическийВес6,
	|	ИНАГРО_АктРасчет310.ФизическийВес7 КАК ФизическийВес7,
	|	ИНАГРО_АктРасчет310.ФизическийВес8 КАК ФизическийВес8,
	|	ИНАГРО_АктРасчет310.ФизическийВесВнутрПриход КАК ФизическийВесВнутрПриход,
	|	ИНАГРО_АктРасчет310.ФизическийВесВнутрРасход КАК ФизическийВесВнутрРасход,
	|	ИНАГРО_АктРасчет310.ФизическийВесПереоформленияПриход КАК ФизическийВесПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ФизическийВесПереоформленияРасход КАК ФизическийВесПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.ФизическийВесПриход КАК ФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.Представление КАК Представление,
	|	ИНАГРО_АктРасчет310.МоментВремени КАК МоментВремени,
	|	ИНАГРО_АктРасчет310.Владелец.НаименованиеПолное КАК НаименованиеПолноеВладелец,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.Акт, 0) КАК Акт,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.НомерСтроки, 0) КАК НомерСтроки,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВидОчисткиСушки, 0) КАК ВидОчисткиСушки,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесЗернаДо, 0) КАК ВесЗернаДо,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесПобочногоПродукта, 0) КАК ВесПобочногоПродукта,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесОтходов1Категории, 0) КАК ВесОтходов1Категории,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесОтходов2Категории, 0) КАК ВесОтходов2Категории,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесОтходов3Категории, 0) КАК ВесОтходов3Категории,
	|	Организации.НаименованиеПолное КАК НаименованиеПолноеОрганизации,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ИНАГРО_АктРасчет310АктыСушкиИОчистки.Акт.Номер КАК НомерАкт,
	|	ИНАГРО_АктРасчет310АктыСушкиИОчистки.Акт.Дата КАК ДатаАкт
	|ИЗ
	|	Документ.ИНАГРО_АктРасчет310 КАК ИНАГРО_АктРасчет310
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_АктРасчет310.АктыСушкиИОчистки КАК ИНАГРО_АктРасчет310АктыСушкиИОчистки
	|		ПО ИНАГРО_АктРасчет310.Ссылка = ИНАГРО_АктРасчет310АктыСушкиИОчистки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица.СрезПоследних КАК ОтветственныеЛицаСрезПоследних
	|		ПО ИНАГРО_АктРасчет310.Ответственный = ОтветственныеЛицаСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ИНАГРО_АктРасчет310.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ИНАГРО_АктРасчет310.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ИНАГРО_АктРасчет310.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(Урожай),
	|	МАКСИМУМ(НаименованиеПолноеОрганизации),
	|	МАКСИМУМ(ДатаДоговора),
	|	МАКСИМУМ(НомерДоговора),
	|	МАКСИМУМ(ДатаАкт)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	////ШАПКА
	Пока ВыборкаСсылка.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		ОблШапка = Макет.ПолучитьОбласть("Шапка");	
		ПервыйСимвол = КодСимвола(ВыборкаСсылка.Номер,1);
		Если ПервыйСимвол >= 48 и ПервыйСимвол <= 57 Тогда
			ОблШапка.Параметры.Номер = ИНАГРО_Общий.ВернутьКодБезПрефикса(ВыборкаСсылка.Номер);
		Иначе 
			ОблШапка.Параметры.Номер = ВыборкаСсылка.Номер;
		КонецЕсли;
		
		//Руководитель = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",Организация,Перечисления.ОтветственныеЛицаОрганизаций.Руководитель));
		//ГлавБух =  РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Дата, Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",Организация,Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер));
		
		мПечататьОкончательныйАкт = ?(мПечататьОкончательныйАкт = Неопределено, Ложь, мПечататьОкончательныйАкт);
		Если ВыборкаСсылка.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет И НЕ мПечататьОкончательныйАкт Тогда
			ОблШапка.Параметры.НаименованиеДокумента = ?(КодЯзыкаПечать = "uk","Попередній акт-розрахунок","Предварительный акт-расчет");
		Иначе
			ОблШапка.Параметры.НаименованиеДокумента = ?(КодЯзыкаПечать = "uk","Акт-розрахунок","Акт-расчет");
		КонецЕсли;
		
		ОблШапка.Параметры.Дата = Формат(ВыборкаСсылка.Дата, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(ВыборкаСсылка.Организация,ВыборкаСсылка.Дата);
		ОблШапка.Параметры.Организация = ВыборкаСсылка.НаименованиеПолноеОрганизации;
		ОблШапка.Параметры.Директор = Руководители.Руководитель;
		ОблШапка.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;
		ОблШапка.Параметры.ГлавБух = Руководители.ГлавныйБухгалтер; 
		ОблШапка.Параметры.Владелец = ВыборкаСсылка.НаименованиеПолноеВладелец;
		ОблШапка.Параметры.НомерДоговора = ВыборкаСсылка.НомерДоговора;
		ОблШапка.Параметры.ДатаДоговора = Формат(ВыборкаСсылка.ДатаДоговора,"ДЛФ = Д");
		ОблШапка.Параметры.Склад = ВыборкаСсылка.Склад;
		ОблШапка.Параметры.Номенклатура = ВыборкаСсылка.Номенклатура;
		ОблШапка.Параметры.Урожай = ВыборкаСсылка.Урожай; 
		ТабДокумент.Вывести(ОблШапка);
		
		// ТабДвижений                     
		ТабДвижений1 = Макет.ПолучитьОбласть("ТабДвижений1");
		ТабДвижений2 = Макет.ПолучитьОбласть("ТабДвижений2");
		ТабДвижений3 = Макет.ПолучитьОбласть("ТабДвижений3");
		//
		ТабДвижений1.Параметры.Начало = Формат(ВыборкаСсылка.ДатаНачала, "ДЛФ=D");
		ТабДвижений3.Параметры.Конец = Формат(ВыборкаСсылка.ДатаОкончания, "ДЛФ=D");
		ТабДвижений1.Параметры.НачалоПриход = Формат(ВыборкаСсылка.НачалоПриход, "ДЛФ=D");
		ТабДвижений1.Параметры.КонецПриход = Формат(ВыборкаСсылка.ОкончаниеПриход, "ДЛФ=D");
		ТабДвижений1.Параметры.НачалоПереоформленияПриход = Формат(ВыборкаСсылка.НачалоПереоформленияПриход, "ДЛФ=D");
		ТабДвижений1.Параметры.КонецПереоформленияПриход = Формат(ВыборкаСсылка.ОкончаниеПереоформленияПриход, "ДЛФ=D");
		ТабДвижений2.Параметры.НачалоПереоформленияРасход = Формат(ВыборкаСсылка.НачалоПереоформленияРасход, "ДЛФ=D");
		ТабДвижений2.Параметры.КонецПереоформленияРасход = Формат(ВыборкаСсылка.ОкончаниеПереоформленияРасход, "ДЛФ=D");	
		ТабДвижений2.Параметры.НачалоРасход = Формат(ВыборкаСсылка.НачалоРасход, "ДЛФ=D");
		ТабДвижений2.Параметры.КонецРасход = Формат(ВыборкаСсылка.ОкончаниеРасход, "ДЛФ=D");
		
		// ПРИХОД
		ТабДвижений1.Параметры.ОстатокНаНачало = ВыборкаСсылка.ОстатокНаНачало;
		ТабДвижений1.Параметры.ВлажностьОстаткаНаНачало = ВыборкаСсылка.ВлажностьОстаткаНаНачало;
		ТабДвижений1.Параметры.СорнаяПримесьОстаткаНаНачало = ВыборкаСсылка.СорнаяПримесьОстаткаНаНачало;
		
		ТабДвижений1.Параметры.ФизическийВесПриход = ВыборкаСсылка.ФизическийВесПриход;
		ТабДвижений1.Параметры.ВлажностьФизическийВесПриход = ВыборкаСсылка.ВлажностьФизическийВесПриход;
		ТабДвижений1.Параметры.СорнаяПримесьФизическийВесПриход = ВыборкаСсылка.СорнаяПримесьФизическийВесПриход;
		
		ТабДвижений1.Параметры.ФизическийВесПереоформленияПриход = ВыборкаСсылка.ФизическийВесПереоформленияПриход;
		ТабДвижений1.Параметры.ВлажностьПереоформленияПриход = ВыборкаСсылка.ВлажностьПереоформленияПриход;
		ТабДвижений1.Параметры.СорнаяПримесьПереоформленияПриход = ВыборкаСсылка.СорнаяПримесьПереоформленияПриход;
		ТабДокумент.Вывести(ТабДвижений1);
		Если  ВыборкаСсылка.ФизическийВесВнутрПриход>0 тогда
			ВНПеремещениеПриход = Макет.ПолучитьОбласть("ВНПеремещениеПриход");
			ВНПеремещениеПриход.Параметры.НачалоПеремещенияПриход = Формат(ВыборкаСсылка.НачалоВнутрПриход, "ДЛФ=D");
			ВНПеремещениеПриход.Параметры.КонецПеремещенияПриход = Формат(ВыборкаСсылка.ОкончаниеВнутрПриход, "ДЛФ=D");
			ВНПеремещениеПриход.Параметры.ФизическийВесВнутрПриход = ВыборкаСсылка.ФизическийВесВнутрПриход;
			ВНПеремещениеПриход.Параметры.ВлажностьВнутрПриход = ВыборкаСсылка.ВлажностьВнутрПриход;
			ВНПеремещениеПриход.Параметры.СорнаяПримесьВнутрПриход = ВыборкаСсылка.СорнаяПримесьВнутрПриход;
			ТабДокумент.Вывести(ВНПеремещениеПриход);
		КонецЕсли;
		ТабДвижений2.Параметры.ФизическийВес3 = ВыборкаСсылка.ФизическийВес3;
		ТабДвижений2.Параметры.Влажность3 = ВыборкаСсылка.Влажность3;
		ТабДвижений2.Параметры.СорнаяПримесь3 = ВыборкаСсылка.СорнаяПримесь3;
		//
		// РАСХОД
		ФизическийВесРасход = ВыборкаСсылка.ФизическийВес11;
		ВесПоВлажностиФизическийВесРасход = Окр(ВыборкаСсылка.ФизическийВес11 * ВыборкаСсылка.Влажность11 / 100);
		ВесПоСорнойПримесиФизическийВесРасход = Окр(ВыборкаСсылка.ФизическийВес11 * ВыборкаСсылка.СорнаяПримесь11 / 100);
		
		ТабДвижений2.Параметры.ФизическийВесРасход = ФизическийВесРасход;
		ТабДвижений2.Параметры.ВлажностьФизическийВесРасход = ВыборкаСсылка.Влажность11;
		ТабДвижений2.Параметры.СорнаяПримесьФизическийВесРасход = ВыборкаСсылка.СорнаяПримесь11;
		
		// переоформление
		ВесПоВлажностиФизическийВесПереоформленияРасход = Окр(ВыборкаСсылка.ФизическийВесПереоформленияРасход * ВыборкаСсылка.ВлажностьПереоформленияРасход / 100);
		ВесПоСорнойПримесиФизическийВесПереоформленияРасход = Окр(ВыборкаСсылка.ФизическийВесПереоформленияРасход * ВыборкаСсылка.СорнаяПримесьПереоформленияРасход / 100);
		
		ТабДвижений2.Параметры.ФизическийВесПереоформленияРасход = ВыборкаСсылка.ФизическийВесПереоформленияРасход;
		ТабДвижений2.Параметры.ВлажностьПереоформленияРасход = ВыборкаСсылка.ВлажностьПереоформленияРасход;
		ТабДвижений2.Параметры.СорнаяПримесьПереоформленияРасход = ВыборкаСсылка.СорнаяПримесьПереоформленияРасход;
		
		ТабДокумент.Вывести(ТабДвижений2);
		
		ВесПоВлажностиФизическийВесВнутрРасход = Окр(ВыборкаСсылка.ФизическийВесВнутрРасход * ВыборкаСсылка.ВлажностьВнутрРасход / 100);
		ВесПоСорнойПримесиФизическийВесВнутрРасход = Окр(ВыборкаСсылка.ФизическийВесВнутрРасход * ВыборкаСсылка.СорнаяПримесьВнутрРасход / 100);
		
		Если  ВыборкаСсылка.ФизическийВесВнутрРасход>0 тогда
			ВНПеремещениеРасход = Макет.ПолучитьОбласть("ВНПеремещениеРасход");
			ВНПеремещениеРасход.Параметры.НачалоПеремещенияРасход = Формат(ВыборкаСсылка.НачалоВнутрРасход, "ДЛФ=D");
			ВНПеремещениеРасход.Параметры.КонецПеремещенияРасход = Формат(ВыборкаСсылка.ОкончаниеВнутрРасход, "ДЛФ=D");	
			ВНПеремещениеРасход.Параметры.ФизическийВесВнутрРасход = ВыборкаСсылка.ФизическийВесВнутрРасход;
			ВНПеремещениеРасход.Параметры.ВлажностьВнутрРасход = ВыборкаСсылка.ВлажностьВнутрРасход;
			ВНПеремещениеРасход.Параметры.СорнаяПримесьВнутрРасход = ВыборкаСсылка.СорнаяПримесьВнутрРасход;
			ТабДокумент.Вывести(ВНПеремещениеРасход);
		КонецЕсли;
		// поб. продукт 1,2 кат
		ВесПоВлажностиПобПродуктРасход = (ВыборкаСсылка.ФизическийВес41 * ВыборкаСсылка.Влажность41 / 100);
		ВесПоСорнойПримесиПобПродуктРасход = (ВыборкаСсылка.ФизическийВес41 * ВыборкаСсылка.СорнаяПримесь41 / 100);
		ВесПоВлажностиКат1Расход = (ВыборкаСсылка.ФизическийВес5 * ВыборкаСсылка.Влажность5 / 100);
		ВесПоСорнойПримесиКат1Расход = (ВыборкаСсылка.ФизическийВес5 * ВыборкаСсылка.СорнаяПримесь5 / 100);
		ВесПоВлажностиКат2Расход = (ВыборкаСсылка.ФизическийВес6 * ВыборкаСсылка.Влажность6 / 100);
		ВесПоСорнойПримесиКат2Расход = (ВыборкаСсылка.ФизическийВес6 * ВыборкаСсылка.СорнаяПримесь6 / 100);
		ВесПоВлажностиПрогнозируемогоВесаПобочныхПродуктов = (ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов * ВыборкаСсылка.ПрогнозируемаяВлажностьПобочныхПродуктов / 100);
		ВесПоСорнойПримесиПрогнозируемогоВесаПобочныхПродуктов = (ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьПобочныхПродуктов / 100);
		
		ВесПоВлажностиПрогнозируемогоВеса1Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов1Категории * ВыборкаСсылка.ПрогнозируемаяВлажностьОтходов1Категории / 100);
		ВесПоСорнойПримесиПрогнозируемогоВеса1Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов1Категории * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьОтходов1Категории / 100);
		ВесПоВлажностиПрогнозируемогоВеса2Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов2Категории * ВыборкаСсылка.ПрогнозируемаяВлажностьОтходов2Категории / 100);
		ВесПоСорнойПримесиПрогнозируемогоВеса2Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов2Категории * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьОтходов2Категории / 100);
		//
		ФизическийВесКатПП_1_2Расход = ВыборкаСсылка.ФизическийВес41 + ВыборкаСсылка.ФизическийВес5 + ВыборкаСсылка.ФизическийВес6 + ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов + ВыборкаСсылка.ПрогнозируемыйВесОтходов1Категории + ВыборкаСсылка.ПрогнозируемыйВесОтходов2Категории;
		ВесПоВлажностиКатПП_1_2Расход = ВесПоВлажностиПобПродуктРасход + ВесПоВлажностиКат1Расход + ВесПоВлажностиКат2Расход + ВесПоВлажностиПрогнозируемогоВесаПобочныхПродуктов + ВесПоВлажностиПрогнозируемогоВеса1Кат + ВесПоВлажностиПрогнозируемогоВеса2Кат;
		ВесПоСорнойПримесиКатПП_1_2Расход = ВесПоСорнойПримесиПобПродуктРасход + ВесПоСорнойПримесиКат1Расход + ВесПоСорнойПримесиКат2Расход + ВесПоСорнойПримесиПрогнозируемогоВесаПобочныхПродуктов + ВесПоСорнойПримесиПрогнозируемогоВеса1Кат + ВесПоСорнойПримесиПрогнозируемогоВеса2Кат;
		
		ТабДвижений3.Параметры.ФизическийВесКатПП_1_2Расход = ФизическийВесКатПП_1_2Расход;
		ТабДвижений3.Параметры.ВлажностьФизическийВесКатПП_1_2Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКатПП_1_2Расход,ВесПоВлажностиКатПП_1_2Расход,2);
		ТабДвижений3.Параметры.СорнаяПримесьФизическийВесКатПП_1_2Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКатПП_1_2Расход,ВесПоСорнойПримесиКатПП_1_2Расход,2);
		
		// 3 кат.
		ВесПоВлажностиКат3 = (ВыборкаСсылка.ФизическийВес7 * ВыборкаСсылка.Влажность7 / 100);
		ВесПоСорнойПримесиКат3 = (ВыборкаСсылка.ФизическийВес7 * ВыборкаСсылка.СорнаяПримесь7 / 100);
		ВесПоВлажностиПрогнозируемогоВесаКат3 = (ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории * ВыборкаСсылка.ПрогнозируемаяВлажностьОтходов3Категории / 100);
		ВесПоСорнойПримесиПрогнозируемогоВесаКат3 = (ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьОтходов3Категории/ 100);
		
		ВесПоВлажностиКат3Расход = ВесПоВлажностиКат3 + ВесПоВлажностиПрогнозируемогоВесаКат3;
		ВесПоСорнойПримесиКат3Расход = ВесПоСорнойПримесиКат3 + ВесПоСорнойПримесиПрогнозируемогоВесаКат3;
		
		ФизическийВесКат3Расход = ВыборкаСсылка.ФизическийВес7 + ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории;
		ТабДвижений3.Параметры.ФизическийВесКат3Расход = ФизическийВесКат3Расход;
		//ТабДвижений3.Параметры.ВлажностьКа3Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКат3Расход, ВесПоВлажностиКат3Расход,2); // << >> ИН-АГРО 2017-11-20 
		//ТабДвижений3.Параметры.СорнаяПримесьКат3Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКат3Расход,ВесПоСорнойПримесиКат3Расход,2);	
		ТабДвижений3.Параметры.ВлажностьКа3Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКат3Расход, ВесПоВлажностиКат3Расход,2);
		ТабДвижений3.Параметры.СорнаяПримесьКат3Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКат3Расход,ВесПоСорнойПримесиКат3Расход,2);	
		//
		Если ВыборкаСсылка.ВидОперации=Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет Тогда
			ТабДвижений3.Параметры.Пункт8 = ?(КодЯзыкаПечать = "uk","Залишок розрахунковий на ","Остаток расчетный на ");
			ТабДвижений3.Параметры.ФизическийВесПункт8 = ВыборкаСсылка.ФизическийВес8;
			ТабДвижений3.Параметры.ВлажностьПункт8 = ВыборкаСсылка.Влажность8;
			ТабДвижений3.Параметры.СорнаяПримесьПункт8 = ВыборкаСсылка.СорнаяПримесь8;
			//
			ФизическийВесПункт8 = ВыборкаСсылка.ФизическийВес8;
			ВесПоВлажностиФизическийВесПункт8 = Окр(ВыборкаСсылка.ФизическийВес8 * ВыборкаСсылка.Влажность8  / 100);
			ВесПоСорнойПримесиФизическийВесПункт8 = Окр(ВыборкаСсылка.ФизическийВес8 * ВыборкаСсылка.СорнаяПримесь8  / 100);
		Иначе 
			ТабДвижений3.Параметры.Пункт8 = ?(КодЯзыкаПечать = "uk","Залишок по переважуванню на ","Остаток по перевеске на ");
			ТабДвижений3.Параметры.ФизическийВесПункт8 = ВыборкаСсылка.ОстатокПоПеревзвешиванию;
			ТабДвижений3.Параметры.ВлажностьПункт8 = ВыборкаСсылка.ВлажностьОстатокПоПеревзвешиванию;
			ТабДвижений3.Параметры.СорнаяПримесьПункт8 = ВыборкаСсылка.СорнаяПримесьОстатокПоПеревзвешиванию;
			ФизическийВесПункт8 = 0;
			ВесПоВлажностиФизическийВесПункт8 = 0;
			ВесПоСорнойПримесиФизическийВесПункт8 = 0;
		КонецЕсли;
		//
		ВесПоВлажностиВСЕГОРасхода = ВесПоВлажностиФизическийВесРасход + 
		ВесПоВлажностиФизическийВесПереоформленияРасход +
		ВесПоВлажностиФизическийВесВнутрРасход +
		ВесПоВлажностиКатПП_1_2Расход +
		ВесПоВлажностиКат3Расход + 
		ВесПоВлажностиФизическийВесПункт8;
		ВесПоСорнойПримесиВСЕГОРасхода = ВесПоСорнойПримесиФизическийВесРасход +
		ВесПоСорнойПримесиФизическийВесПереоформленияРасход +
		ВесПоСорнойПримесиФизическийВесВнутрРасход +
		ВесПоСорнойПримесиКатПП_1_2Расход +
		ВесПоСорнойПримесиКат3Расход +
		ВесПоСорнойПримесиФизическийВесПункт8;
		
		ВСЕГОРасход = ФизическийВесРасход + 
		ВыборкаСсылка.ФизическийВесПереоформленияРасход +
		ВыборкаСсылка.ФизическийВесВнутрРасход + 
		ФизическийВесКатПП_1_2Расход + 
		ФизическийВесКат3Расход + 
		ФизическийВесПункт8;
		ТабДвижений3.Параметры.ВСЕГОРасход = ВСЕГОРасход;
		ТабДвижений3.Параметры.ВлажностьВСЕГОРасход = ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоВлажностиВСЕГОРасхода,2);
		ТабДвижений3.Параметры.РазницаВлажность = ВыборкаСсылка.Влажность3 - ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоВлажностиВСЕГОРасхода,2); 
		ПримесьДляРазницы = 0;
		Если ВСЕГОРасход <> ВыборкаСсылка.ФизическийВес4 Тогда 
			ТабДвижений3.Параметры.СорнаяПримесьВСЕГОРасход = ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоСорнойПримесиВСЕГОРасхода,2);		
			ПримесьДляРазницы = ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоСорнойПримесиВСЕГОРасхода,2);		
		Иначе
			ТабДвижений3.Параметры.СорнаяПримесьВСЕГОРасход = ВыборкаСсылка.СорнаяПримесь4;
			ПримесьДляРазницы = ВыборкаСсылка.СорнаяПримесь4;
		КонецЕсли;
		
		ТабДвижений3.Параметры.РазницаСорнаяПримесь = ВыборкаСсылка.СорнаяПримесь3 - ПримесьДляРазницы; 
		// РАЗНИЦА
		РазницаМеждуПриходомРасходом = ВыборкаСсылка.ФизическийВес3 - ВСЕГОРасход;
		ТабДвижений3.Параметры.РазницаМеждуПриходомРасходом = РазницаМеждуПриходомРасходом;	
		ТабДвижений3.Параметры.ВесПовышениеВсего = ВыборкаСсылка.ВесПовышениеВсего;
		
		ВесНедостачи = РазницаМеждуПриходомРасходом + ВыборкаСсылка.ВесПовышениеВсего;
		Если ВыборкаСсылка.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.РасчетПоФакту Тогда
			ВесНедостачи = ВесНедостачи - ВыборкаСсылка.ВесУбыльВсего;
		КонецЕсли;
	
		Если ВесНедостачи < 0 Тогда
			ВесНедостачи = "(" + ((-1)*ВесНедостачи) + ")";
		КонецЕсли;
		ТабДвижений3.Параметры.ВесНедостачи = ВесНедостачи;
		ТабДокумент.Вывести(ТабДвижений3);
		
		//ШАПКА2
		Шапка2 = Макет.ПолучитьОбласть("Шапка2");
		ТабДокумент.Вывести(Шапка2);
		
		//ТабСушкиОчистки
		СтрСушкиОчистки = Макет.ПолучитьОбласть("СтрСушкиОчистки");
		ВСЕГОВесЗерна = 0;
		ВСЕГОМасаПП_1_2кат = 0;
		ВСЕГОВесОтходов3кат = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			Ном = 1;
			//ВСЕГОВесЗерна = 0;
			//ВСЕГОМасаПП_1_2кат = 0;
			//ВСЕГОВесОтходов3кат = 0;
			СтрСушкиОчистки.Параметры.Ном = Ном;
			АктНомерДок = ВыборкаДетальныеЗаписи.НомерАкт;
			АктДатаДок = Формат(ВыборкаДетальныеЗаписи.ДатаАкт, "ДЛФ=D");
			СтрСушкиОчистки.Параметры.Акт = "" + ВыборкаДетальныеЗаписи.ВидОчисткиСушки + " от " + АктДатаДок + " №" + АктНомерДок;
			СтрСушкиОчистки.Параметры.МасаЗерна = ВыборкаДетальныеЗаписи.ВесЗернаДо;
			МасаПП_1_2кат = ВыборкаДетальныеЗаписи.ВесПобочногоПродукта + ВыборкаДетальныеЗаписи.ВесОтходов1Категории + ВыборкаДетальныеЗаписи.ВесОтходов2Категории;
			СтрСушкиОчистки.Параметры.МасаПП_1_2кат = МасаПП_1_2кат;
			СтрСушкиОчистки.Параметры.Маса3кат = ВыборкаДетальныеЗаписи.ВесОтходов3Категории;
			ВСЕГОВесЗерна = ВСЕГОВесЗерна + ВыборкаДетальныеЗаписи.ВесЗернаДо;
			ВСЕГОМасаПП_1_2кат = ВСЕГОМасаПП_1_2кат + МасаПП_1_2кат;
			ВСЕГОВесОтходов3кат = ВСЕГОВесОтходов3кат + ВыборкаДетальныеЗаписи.ВесОтходов3Категории;		
			ТабДокумент.Вывести(СтрСушкиОчистки);
			Ном = Ном + 1;
		КонецЦикла;
		
		Если (ВыборкаСсылка.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет) и 
			((ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов + ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории) > 0) Тогда
			
			СтрСушкиОчистки.Параметры.Ном = Ном;
			СтрСушкиОчистки.Параметры.Акт = ?(КодЯзыкаПечать = "uk","Прогнозна вага побічного продукту і відходів","Прогнозный вес побочного продукта и отходов");
			СтрСушкиОчистки.Параметры.МасаЗерна = 0;
			МасаПП_1_2кат = ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов;
			СтрСушкиОчистки.Параметры.МасаПП_1_2кат = МасаПП_1_2кат;
			СтрСушкиОчистки.Параметры.Маса3кат = ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории;
			ВСЕГОВесЗерна = ВСЕГОВесЗерна + 0;
			ВСЕГОМасаПП_1_2кат = ВСЕГОМасаПП_1_2кат + МасаПП_1_2кат;
			ВСЕГОВесОтходов3кат = ВСЕГОВесОтходов3кат + ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории;		
			ТабДокумент.Вывести(СтрСушкиОчистки);
			Ном = Ном + 1;		 
			
		КонецЕсли;
		
		
		//Дно
		Дно = Макет.ПолучитьОбласть("Дно");
		СрокХранения = "";
		СрокХранения = ""+СрокХранения+?(ВыборкаСсылка.СрокХраненияМесяцев=0,"","" + ВыборкаСсылка.СрокХраненияМесяцев + ?(КодЯзыкаПечать = "uk"," місяців"," месяцев"));
		СрокХранения = ""+СрокХранения+?(ВыборкаСсылка.СрокХраненияДней=0,""," " + ВыборкаСсылка.СрокХраненияДней + ?(КодЯзыкаПечать = "uk"," днів"," дней"));
		Дно.Параметры.СрокХранения = СрокХранения;
		
		Дно.Параметры.ВСЕГОВесЗерна = ВСЕГОВесЗерна;
		Дно.Параметры.ВСЕГОМасаПП_1_2кат = ВСЕГОМасаПП_1_2кат;
		Дно.Параметры.ВСЕГОВесОтходов3кат = ВСЕГОВесОтходов3кат;
		
		Дно.Параметры.УбыльВлажности = ВыборкаСсылка.УбыльВлажности;
		Дно.Параметры.УбыльПоВлажности = ВыборкаСсылка.УбыльПоВлажности;
		Дно.Параметры.УбыльСорнойПримеси = ВыборкаСсылка.УбыльСорнойПримеси;
		Дно.Параметры.УбыльПоСорнойПримеси = ВыборкаСсылка.УбыльПоСорнойПримеси;
		Дно.Параметры.УбыльЕстественная = ВыборкаСсылка.УбыльЕстественная;
		Дно.Параметры.УбыльПоЕстественной = ВыборкаСсылка.УбыльПоЕстественной;
		Дно.Параметры.УбыльПрочая = ВыборкаСсылка.УбыльПрочая;
		Дно.Параметры.УбыльПоПрочей = ВыборкаСсылка.УбыльПоПрочей;
		Дно.Параметры.ВесУбыльВсего = ВыборкаСсылка.ВесУбыльВсего;
		
		Дно.Параметры.ПовышениеВлажности = ВыборкаСсылка.ПовышениеВлажности;
		Дно.Параметры.ПовышениеПоВлажности = ВыборкаСсылка.ПовышениеПоВлажности;
		Дно.Параметры.ПовышениеСорнойПримеси = ВыборкаСсылка.ПовышениеСорнойПримеси;
		Дно.Параметры.ПовышениеПоСорнойПримеси = ВыборкаСсылка.ПовышениеПоСорнойПримеси;
		Дно.Параметры.ВесПовышениеВсего = ВыборкаСсылка.ВесПовышениеВсего;
		
		Если ВыборкаСсылка.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет Тогда
			Дно.Параметры.Номенклатура = ВыборкаСсылка.Номенклатура;
			
			Дно.Параметры.ФизическийВес8 = ВыборкаСсылка.ФизическийВес8;
			Дно.Параметры.Влажность8 = ВыборкаСсылка.Влажность8;
			Дно.Параметры.СорнаяПримесь8 = ВыборкаСсылка.СорнаяПримесь8;
			
			ВесПоВлажностиПодлежитВозвратуПП = ВесПоВлажностиПобПродуктРасход + ВесПоВлажностиПрогнозируемогоВесаПобочныхПродуктов;
			ВесПоСорнойПримесиПодлежитВозвратуПП = ВесПоСорнойПримесиПобПродуктРасход + ВесПоСорнойПримесиПрогнозируемогоВесаПобочныхПродуктов;
			
			ПодлежитВозвратуПП = ВыборкаСсылка.ФизическийВес41 + ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов;
			
			Дно.Параметры.ПодлежитВозвратуПП = ПодлежитВозвратуПП;
			Дно.Параметры.ВлажностьПодлежитВозвратуПП = ИНАГРО_Элеватор.Процент(ПодлежитВозвратуПП,ВесПоВлажностиПодлежитВозвратуПП,2);
			Дно.Параметры.СорнаяПримесьПодлежитВозвратуПП = ИНАГРО_Элеватор.Процент(ПодлежитВозвратуПП,ВесПоСорнойПримесиПодлежитВозвратуПП,2);
			
			//
			ВесПоВлажностиПодлежитВозвратуКат1_2 = ВесПоВлажностиКат1Расход + ВесПоВлажностиКат2Расход + ВесПоВлажностиПрогнозируемогоВеса1Кат + ВесПоВлажностиПрогнозируемогоВеса2Кат;
			ВесПоСорнойПримесиПодлежитВозвратуКат1_2 = ВесПоСорнойПримесиКат1Расход + ВесПоСорнойПримесиКат2Расход + ВесПоСорнойПримесиПрогнозируемогоВеса1Кат + ВесПоСорнойПримесиПрогнозируемогоВеса2Кат;
			ПодлежитВозвратуКат1_2 = ВыборкаСсылка.ФизическийВес5 + ВыборкаСсылка.ФизическийВес6 + ВыборкаСсылка.ПрогнозируемыйВесОтходов1Категории + ВыборкаСсылка.ПрогнозируемыйВесОтходов2Категории;
			
			Дно.Параметры.ПодлежитВозвратуКат1_2 = ПодлежитВозвратуКат1_2;
			Дно.Параметры.ВлажностьПодлежитВозвратуКат1_2 = ИНАГРО_Элеватор.Процент(ПодлежитВозвратуКат1_2,ВесПоВлажностиПодлежитВозвратуКат1_2,2);
			Дно.Параметры.СорнаяПримесьПодлежитВозвратуКат1_2 = ИНАГРО_Элеватор.Процент(ПодлежитВозвратуКат1_2,ВесПоСорнойПримесиПодлежитВозвратуКат1_2,2);
		КонецЕсли;
		
		ТабДокумент.Вывести(Дно);
		
		Подписи = Макет.ПолучитьОбласть("Подписи");
		Подписи.Параметры.Директор = Руководители.Руководитель;
		Подписи.Параметры.ГлавБух = Руководители.ГлавныйБухгалтер; 
		Подписи.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ; 
		
		//МОЛ
		
		Подписи.Параметры.МОЛ = ОтветственныеЛицаБП.ОтветственноеЛицоНаСкладе(ВыборкаСсылка.Склад, ВыборкаСсылка.Дата);
		ТабДокумент.Вывести(Подписи);
		
		ПодписиДХИ = Макет.ПолучитьОбласть("ПодписиДХИ");
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции


Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

Функция ПечатьАктРасчет661_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = ПолучитьМакет("ПФ_MXL_АктРасчет661_2021");
	
	// регламентированная печ. форма
	КодЯзыкаПечать = "uk";
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИНАГРО_АктРасчет310.ВлажностьВнутрРасход КАК ВлажностьВнутрРасход,
	|	ИНАГРО_АктРасчет310.Ссылка КАК Ссылка,
	|	ИНАГРО_АктРасчет310.ВерсияДанных КАК ВерсияДанных,
	|	ИНАГРО_АктРасчет310.ПометкаУдаления КАК ПометкаУдаления,
	|	ИНАГРО_АктРасчет310.Номер КАК Номер,
	|	ИНАГРО_АктРасчет310.Дата КАК Дата,
	|	ИНАГРО_АктРасчет310.Проведен КАК Проведен,
	|	ИНАГРО_АктРасчет310.БалансСора КАК БалансСора,
	|	ИНАГРО_АктРасчет310.ВесПоВлажностиРасход КАК ВесПоВлажностиРасход,
	|	ИНАГРО_АктРасчет310.ВесПовышениеВсего КАК ВесПовышениеВсего,
	|	ИНАГРО_АктРасчет310.ВесПоСорнойПримесиРасход КАК ВесПоСорнойПримесиРасход,
	|	ИНАГРО_АктРасчет310.ВесУбыльВсего КАК ВесУбыльВсего,
	|	ИНАГРО_АктРасчет310.ВидОперации КАК ВидОперации,
	|	ИНАГРО_АктРасчет310.ВидХранения КАК ВидХранения,
	|	ИНАГРО_АктРасчет310.Владелец КАК Владелец,
	|	ИНАГРО_АктРасчет310.Влажность11 КАК Влажность11,
	|	ИНАГРО_АктРасчет310.Влажность3 КАК Влажность3,
	|	ИНАГРО_АктРасчет310.Влажность4 КАК Влажность4,
	|	ИНАГРО_АктРасчет310.Влажность41 КАК Влажность41,
	|	ИНАГРО_АктРасчет310.Влажность5 КАК Влажность5,
	|	ИНАГРО_АктРасчет310.Влажность6 КАК Влажность6,
	|	ИНАГРО_АктРасчет310.Влажность7 КАК Влажность7,
	|	ИНАГРО_АктРасчет310.Влажность8 КАК Влажность8,
	|	ИНАГРО_АктРасчет310.ВлажностьВнутрПриход КАК ВлажностьВнутрПриход,
	|	ИНАГРО_АктРасчет310.ВлажностьОстаткаНаНачало КАК ВлажностьОстаткаНаНачало,
	|	ИНАГРО_АктРасчет310.ВлажностьОстатокПоПеревзвешиванию КАК ВлажностьОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.ВлажностьПереоформленияПриход КАК ВлажностьПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ВлажностьПереоформленияРасход КАК ВлажностьПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.ВлажностьФизическийВесПриход КАК ВлажностьФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.ВыставитьУслугиОчисткиСушки КАК ВыставитьУслугиОчисткиСушки,
	|	ИНАГРО_АктРасчет310.ДатаНачала КАК ДатаНачала,
	|	ИНАГРО_АктРасчет310.ДатаОкончания КАК ДатаОкончания,
	|	ИНАГРО_АктРасчет310.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесь3 КАК ЗерноваяПримесь3,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесь4 КАК ЗерноваяПримесь4,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесь8 КАК ЗерноваяПримесь8,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьВнутрПриход КАК ЗерноваяПримесьВнутрПриход,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьОстаткаНаНачало КАК ЗерноваяПримесьОстаткаНаНачало,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьОстатокПоПеревзвешиванию КАК ЗерноваяПримесьОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьПереоформленияПриход КАК ЗерноваяПримесьПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ЗерноваяПримесьФизическийВесПриход КАК ЗерноваяПримесьФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.Комментарий КАК Комментарий,
	|	ИНАГРО_АктРасчет310.КорректироватьЗачетныйВес КАК КорректироватьЗачетныйВес,
	|	ИНАГРО_АктРасчет310.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
	|	ИНАГРО_АктРасчет310.НачалоВнутрПриход КАК НачалоВнутрПриход,
	|	ИНАГРО_АктРасчет310.НачалоВнутрРасход КАК НачалоВнутрРасход,
	|	ИНАГРО_АктРасчет310.НачалоПереоформленияПриход КАК НачалоПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.НачалоПереоформленияРасход КАК НачалоПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.НачалоПриход КАК НачалоПриход,
	|	ИНАГРО_АктРасчет310.НачалоРасход КАК НачалоРасход,
	|	ИНАГРО_АктРасчет310.НеРассчитыватьУбыльПриХранении КАК НеРассчитыватьУбыльПриХранении,
	|	ИНАГРО_АктРасчет310.НеСписыватьНеиспользованноеПраво КАК НеСписыватьНеиспользованноеПраво,
	|	ИНАГРО_АктРасчет310.Номенклатура КАК Номенклатура,
	|	ИНАГРО_АктРасчет310.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	|	ИНАГРО_АктРасчет310.НомерАнализа КАК НомерАнализа,
	|	ИНАГРО_АктРасчет310.ОкончаниеВнутрПриход КАК ОкончаниеВнутрПриход,
	|	ИНАГРО_АктРасчет310.ОкончаниеВнутрРасход КАК ОкончаниеВнутрРасход,
	|	ИНАГРО_АктРасчет310.ОкончаниеПереоформленияПриход КАК ОкончаниеПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ОкончаниеПереоформленияРасход КАК ОкончаниеПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.ОкончаниеПриход КАК ОкончаниеПриход,
	|	ИНАГРО_АктРасчет310.ОкончаниеРасход КАК ОкончаниеРасход,
	|	ИНАГРО_АктРасчет310.ОписаниеДвиженияФормы36 КАК ОписаниеДвиженияФормы36,
	|	ИНАГРО_АктРасчет310.Организация КАК Организация,
	|	ИНАГРО_АктРасчет310.ОстатокНаНачало КАК ОстатокНаНачало,
	|	ИНАГРО_АктРасчет310.ОстатокПоПеревзвешиванию КАК ОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.Ответственный КАК Ответственный,
	|	ИНАГРО_АктРасчет310.ОтражатьВБухгалтерскомУчете КАК ОтражатьВБухгалтерскомУчете,
	|	ИНАГРО_АктРасчет310.ОтражатьПоЗатратам КАК ОтражатьПоЗатратам,
	|	ИНАГРО_АктРасчет310.ПечататьОкончательныйАкт КАК ПечататьОкончательныйАкт,
	|	ИНАГРО_АктРасчет310.ПовышениеВлажности КАК ПовышениеВлажности,
	|	ИНАГРО_АктРасчет310.ПовышениеПоВлажности КАК ПовышениеПоВлажности,
	|	ИНАГРО_АктРасчет310.ПовышениеПоСорнойПримеси КАК ПовышениеПоСорнойПримеси,
	|	ИНАГРО_АктРасчет310.ПовышениеСорнойПримеси КАК ПовышениеСорнойПримеси,
	|	ИНАГРО_АктРасчет310.ПодразделениеЗатраты КАК ПодразделениеЗатраты,
	|	ИНАГРО_АктРасчет310.ПодразделениеОрганизацииЗатраты КАК ПодразделениеОрганизацииЗатраты,
	|	ИНАГРО_АктРасчет310.ПроводилиОчистку КАК ПроводилиОчистку,
	|	ИНАГРО_АктРасчет310.ПроводилиСушку КАК ПроводилиСушку,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьОтходов1Категории КАК ПрогнозируемаяВлажностьОтходов1Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьОтходов2Категории КАК ПрогнозируемаяВлажностьОтходов2Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьОтходов3Категории КАК ПрогнозируемаяВлажностьОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяВлажностьПобочныхПродуктов КАК ПрогнозируемаяВлажностьПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьОтходов1Категории КАК ПрогнозируемаяСорнаяПримесьОтходов1Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьОтходов2Категории КАК ПрогнозируемаяСорнаяПримесьОтходов2Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьОтходов3Категории КАК ПрогнозируемаяСорнаяПримесьОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемаяСорнаяПримесьПобочныхПродуктов КАК ПрогнозируемаяСорнаяПримесьПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесОтходов1Категории КАК ПрогнозируемыйВесОтходов1Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесОтходов2Категории КАК ПрогнозируемыйВесОтходов2Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесОтходов3Категории КАК ПрогнозируемыйВесОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйВесПобочныхПродуктов КАК ПрогнозируемыйВесПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйПроцентОтходов3Категории КАК ПрогнозируемыйПроцентОтходов3Категории,
	|	ИНАГРО_АктРасчет310.ПрогнозируемыйПроцентПобочныхПродуктов КАК ПрогнозируемыйПроцентПобочныхПродуктов,
	|	ИНАГРО_АктРасчет310.Склад КАК Склад,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь11 КАК СорнаяПримесь11,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь3 КАК СорнаяПримесь3,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь4 КАК СорнаяПримесь4,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь41 КАК СорнаяПримесь41,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь5 КАК СорнаяПримесь5,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь6 КАК СорнаяПримесь6,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь7 КАК СорнаяПримесь7,
	|	ИНАГРО_АктРасчет310.СорнаяПримесь8 КАК СорнаяПримесь8,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьВнутрПриход КАК СорнаяПримесьВнутрПриход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьВнутрРасход КАК СорнаяПримесьВнутрРасход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьОстаткаНаНачало КАК СорнаяПримесьОстаткаНаНачало,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьОстатокПоПеревзвешиванию КАК СорнаяПримесьОстатокПоПеревзвешиванию,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьПереоформленияПриход КАК СорнаяПримесьПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьПереоформленияРасход КАК СорнаяПримесьПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.СорнаяПримесьФизическийВесПриход КАК СорнаяПримесьФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.СписатьЗачетныйВес КАК СписатьЗачетныйВес,
	|	ИНАГРО_АктРасчет310.СпособРасчетаОтходов3Категории КАК СпособРасчетаОтходов3Категории,
	|	ИНАГРО_АктРасчет310.СпособРасчетаПобочногоПродукта КАК СпособРасчетаПобочногоПродукта,
	|	ИНАГРО_АктРасчет310.СпособРасчетаПредварительногоАктаРасчета КАК СпособРасчетаПредварительногоАктаРасчета,
	|	ИНАГРО_АктРасчет310.СпособХранения КАК СпособХранения,
	|	ИНАГРО_АктРасчет310.СрокХраненияДней КАК СрокХраненияДней,
	|	ИНАГРО_АктРасчет310.СрокХраненияМесяцев КАК СрокХраненияМесяцев,
	|	ИНАГРО_АктРасчет310.СтатьяЗатрат КАК СтатьяЗатрат,
	|	ИНАГРО_АктРасчет310.Субконто1 КАК Субконто1,
	|	ИНАГРО_АктРасчет310.Субконто2 КАК Субконто2,
	|	ИНАГРО_АктРасчет310.Субконто3 КАК Субконто3,
	|	ИНАГРО_АктРасчет310.СчетЗатрат КАК СчетЗатрат,
	|	ИНАГРО_АктРасчет310.УбыльВлажности КАК УбыльВлажности,
	|	ИНАГРО_АктРасчет310.УбыльЕстественная КАК УбыльЕстественная,
	|	ИНАГРО_АктРасчет310.УбыльПоВлажности КАК УбыльПоВлажности,
	|	ИНАГРО_АктРасчет310.УбыльПоЕстественной КАК УбыльПоЕстественной,
	|	ИНАГРО_АктРасчет310.УбыльПоПрочей КАК УбыльПоПрочей,
	|	ИНАГРО_АктРасчет310.УбыльПоСорнойПримеси КАК УбыльПоСорнойПримеси,
	|	ИНАГРО_АктРасчет310.УбыльПрочая КАК УбыльПрочая,
	|	ИНАГРО_АктРасчет310.УбыльСорнойПримеси КАК УбыльСорнойПримеси,
	|	ИНАГРО_АктРасчет310.УдалитьВидДеятельностиНДС КАК УдалитьВидДеятельностиНДС,
	|	ИНАГРО_АктРасчет310.УдалитьВидНалоговойДеятельности КАК УдалитьВидНалоговойДеятельности,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность1 КАК УдалитьВлажность1,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность10 КАК УдалитьВлажность10,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность2 КАК УдалитьВлажность2,
	|	ИНАГРО_АктРасчет310.УдалитьВлажность9 КАК УдалитьВлажность9,
	|	ИНАГРО_АктРасчет310.УдалитьВлажностьОстаткаНаКонец КАК УдалитьВлажностьОстаткаНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьВсеДвижения КАК УдалитьВсеДвижения,
	|	ИНАГРО_АктРасчет310.УдалитьЗакрытьПартиюПоВладельцу КАК УдалитьЗакрытьПартиюПоВладельцу,
	|	ИНАГРО_АктРасчет310.УдалитьЗерноваяПримесьОстаткаНаКонец КАК УдалитьЗерноваяПримесьОстаткаНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьОстатокНаКонец КАК УдалитьОстатокНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьПоФакту КАК УдалитьПоФакту,
	|	ИНАГРО_АктРасчет310.УдалитьРасчетныйСчет КАК УдалитьРасчетныйСчет,
	|	ИНАГРО_АктРасчет310.УдалитьРодительскийДокумент КАК УдалитьРодительскийДокумент,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь1 КАК УдалитьСорнаяПримесь1,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь10 КАК УдалитьСорнаяПримесь10,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь2 КАК УдалитьСорнаяПримесь2,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесь9 КАК УдалитьСорнаяПримесь9,
	|	ИНАГРО_АктРасчет310.УдалитьСорнаяПримесьОстаткаНаКонец КАК УдалитьСорнаяПримесьОстаткаНаКонец,
	|	ИНАГРО_АктРасчет310.УдалитьСрокОплаты КАК УдалитьСрокОплаты,
	|	ИНАГРО_АктРасчет310.УдалитьСтатьяПриростаУбылиЗапасов КАК УдалитьСтатьяПриростаУбылиЗапасов,
	|	ИНАГРО_АктРасчет310.УдалитьСчетУчетаБУ КАК УдалитьСчетУчетаБУ,
	|	ИНАГРО_АктРасчет310.УдалитьТолькоЗарегистрировать КАК УдалитьТолькоЗарегистрировать,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес1 КАК УдалитьФизическийВес1,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес10 КАК УдалитьФизическийВес10,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес2 КАК УдалитьФизическийВес2,
	|	ИНАГРО_АктРасчет310.УдалитьФизическийВес9 КАК УдалитьФизическийВес9,
	|	ИНАГРО_АктРасчет310.Урожай КАК Урожай,
	|	ИНАГРО_АктРасчет310.Усушка КАК Усушка,
	|	ИНАГРО_АктРасчет310.ФизическийВес11 КАК ФизическийВес11,
	|	ИНАГРО_АктРасчет310.ФизическийВес3 КАК ФизическийВес3,
	|	ИНАГРО_АктРасчет310.ФизическийВес4 КАК ФизическийВес4,
	|	ИНАГРО_АктРасчет310.ФизическийВес41 КАК ФизическийВес41,
	|	ИНАГРО_АктРасчет310.ФизическийВес5 КАК ФизическийВес5,
	|	ИНАГРО_АктРасчет310.ФизическийВес6 КАК ФизическийВес6,
	|	ИНАГРО_АктРасчет310.ФизическийВес7 КАК ФизическийВес7,
	|	ИНАГРО_АктРасчет310.ФизическийВес8 КАК ФизическийВес8,
	|	ИНАГРО_АктРасчет310.ФизическийВесВнутрПриход КАК ФизическийВесВнутрПриход,
	|	ИНАГРО_АктРасчет310.ФизическийВесВнутрРасход КАК ФизическийВесВнутрРасход,
	|	ИНАГРО_АктРасчет310.ФизическийВесПереоформленияПриход КАК ФизическийВесПереоформленияПриход,
	|	ИНАГРО_АктРасчет310.ФизическийВесПереоформленияРасход КАК ФизическийВесПереоформленияРасход,
	|	ИНАГРО_АктРасчет310.ФизическийВесПриход КАК ФизическийВесПриход,
	|	ИНАГРО_АктРасчет310.Представление КАК Представление,
	|	ИНАГРО_АктРасчет310.МоментВремени КАК МоментВремени,
	|	ИНАГРО_АктРасчет310.Владелец.НаименованиеПолное КАК НаименованиеПолноеВладелец,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.Акт, 0) КАК Акт,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.НомерСтроки, 0) КАК НомерСтроки,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВидОчисткиСушки, 0) КАК ВидОчисткиСушки,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесЗернаДо, 0) КАК ВесЗернаДо,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесПобочногоПродукта, 0) КАК ВесПобочногоПродукта,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесОтходов1Категории, 0) КАК ВесОтходов1Категории,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесОтходов2Категории, 0) КАК ВесОтходов2Категории,
	|	ЕСТЬNULL(ИНАГРО_АктРасчет310АктыСушкиИОчистки.ВесОтходов3Категории, 0) КАК ВесОтходов3Категории,
	|	Организации.НаименованиеПолное КАК НаименованиеПолноеОрганизации,
	|	ДоговорыКонтрагентов.Дата КАК ДатаДоговора,
	|	ДоговорыКонтрагентов.Номер КАК НомерДоговора,
	|	ИНАГРО_АктРасчет310АктыСушкиИОчистки.Акт.Номер КАК НомерАкт,
	|	ИНАГРО_АктРасчет310АктыСушкиИОчистки.Акт.Дата КАК ДатаАкт
	|ИЗ
	|	Документ.ИНАГРО_АктРасчет310 КАК ИНАГРО_АктРасчет310
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_АктРасчет310.АктыСушкиИОчистки КАК ИНАГРО_АктРасчет310АктыСушкиИОчистки
	|		ПО ИНАГРО_АктРасчет310.Ссылка = ИНАГРО_АктРасчет310АктыСушкиИОчистки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветственныеЛица.СрезПоследних КАК ОтветственныеЛицаСрезПоследних
	|		ПО ИНАГРО_АктРасчет310.Ответственный = ОтветственныеЛицаСрезПоследних.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ИНАГРО_АктРасчет310.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ИНАГРО_АктРасчет310.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ИНАГРО_АктРасчет310.Ссылка В(&МассивОбъектов)
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(Урожай),
	|	МАКСИМУМ(НаименованиеПолноеОрганизации),
	|	МАКСИМУМ(ДатаДоговора),
	|	МАКСИМУМ(НомерДоговора),
	|	МАКСИМУМ(ДатаАкт)
	|ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	////ШАПКА
	Пока ВыборкаСсылка.Следующий() Цикл
		ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
	
		ОблШапка = Макет.ПолучитьОбласть("Шапка");	
		ПервыйСимвол = КодСимвола(ВыборкаСсылка.Номер,1);
		Если ПервыйСимвол >= 48 и ПервыйСимвол <= 57 Тогда
			ОблШапка.Параметры.Номер = ИНАГРО_Общий.ВернутьКодБезПрефикса(ВыборкаСсылка.Номер);
		Иначе 
			ОблШапка.Параметры.Номер = ВыборкаСсылка.Номер;
		КонецЕсли;
		
		мПечататьОкончательныйАкт = ?(мПечататьОкончательныйАкт = Неопределено, Ложь, мПечататьОкончательныйАкт);
		Если ВыборкаСсылка.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет И НЕ мПечататьОкончательныйАкт Тогда
			ОблШапка.Параметры.НаименованиеДокумента = ?(КодЯзыкаПечать = "uk","Попередній акт-розрахунок","Предварительный акт-расчет");
		Иначе
			ОблШапка.Параметры.НаименованиеДокумента = ?(КодЯзыкаПечать = "uk","Акт-розрахунок","Акт-расчет");
		КонецЕсли;
		
		ОблШапка.Параметры.Дата = Формат(ВыборкаСсылка.Дата, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(ВыборкаСсылка.Организация,ВыборкаСсылка.Дата);
		//ОблШапка.Параметры.Организация = ВыборкаСсылка.НаименованиеПолноеОрганизации;
		ОблШапка.Параметры.Директор = Руководители.Руководитель;
		ОблШапка.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;
		ОблШапка.Параметры.ГлавБух = Руководители.ГлавныйБухгалтер; 
		ОблШапка.Параметры.Владелец = ВыборкаСсылка.НаименованиеПолноеВладелец;
		ОблШапка.Параметры.НомерДоговора = ВыборкаСсылка.НомерДоговора;
		ОблШапка.Параметры.ДатаДоговора = Формат(ВыборкаСсылка.ДатаДоговора,"ДЛФ = Д");
		ОблШапка.Параметры.Склад = ВыборкаСсылка.Склад;
		ОблШапка.Параметры.Номенклатура = ВыборкаСсылка.Номенклатура;
		ОблШапка.Параметры.Урожай = ВыборкаСсылка.Урожай; 
		ТабДокумент.Вывести(ОблШапка);
		
		// ТабДвижений                     
		ТабДвижений1 = Макет.ПолучитьОбласть("ТабДвижений1");
		ТабДвижений2 = Макет.ПолучитьОбласть("ТабДвижений2");
		ТабДвижений3 = Макет.ПолучитьОбласть("ТабДвижений3");
		//
		ТабДвижений1.Параметры.Начало = Формат(ВыборкаСсылка.ДатаНачала, "ДЛФ=D");
		ТабДвижений3.Параметры.Конец = Формат(ВыборкаСсылка.ДатаОкончания, "ДЛФ=D");
		ТабДвижений1.Параметры.НачалоПриход = Формат(ВыборкаСсылка.НачалоПриход, "ДЛФ=D");
		ТабДвижений1.Параметры.КонецПриход = Формат(ВыборкаСсылка.ОкончаниеПриход, "ДЛФ=D");
		ТабДвижений1.Параметры.НачалоПереоформленияПриход = Формат(ВыборкаСсылка.НачалоПереоформленияПриход, "ДЛФ=D");
		ТабДвижений1.Параметры.КонецПереоформленияПриход = Формат(ВыборкаСсылка.ОкончаниеПереоформленияПриход, "ДЛФ=D");
		ТабДвижений2.Параметры.НачалоПереоформленияРасход = Формат(ВыборкаСсылка.НачалоПереоформленияРасход, "ДЛФ=D");
		ТабДвижений2.Параметры.КонецПереоформленияРасход = Формат(ВыборкаСсылка.ОкончаниеПереоформленияРасход, "ДЛФ=D");	
		ТабДвижений2.Параметры.НачалоРасход = Формат(ВыборкаСсылка.НачалоРасход, "ДЛФ=D");
		ТабДвижений2.Параметры.КонецРасход = Формат(ВыборкаСсылка.ОкончаниеРасход, "ДЛФ=D");
		
		// ПРИХОД
		ТабДвижений1.Параметры.ОстатокНаНачало = ВыборкаСсылка.ОстатокНаНачало;
		ТабДвижений1.Параметры.ВлажностьОстаткаНаНачало = ВыборкаСсылка.ВлажностьОстаткаНаНачало;
		ТабДвижений1.Параметры.СорнаяПримесьОстаткаНаНачало = ВыборкаСсылка.СорнаяПримесьОстаткаНаНачало;
		
		ТабДвижений1.Параметры.ФизическийВесПриход = ВыборкаСсылка.ФизическийВесПриход;
		ТабДвижений1.Параметры.ВлажностьФизическийВесПриход = ВыборкаСсылка.ВлажностьФизическийВесПриход;
		ТабДвижений1.Параметры.СорнаяПримесьФизическийВесПриход = ВыборкаСсылка.СорнаяПримесьФизическийВесПриход;
		
		ТабДвижений1.Параметры.ФизическийВесПереоформленияПриход = ВыборкаСсылка.ФизическийВесПереоформленияПриход;
		ТабДвижений1.Параметры.ВлажностьПереоформленияПриход = ВыборкаСсылка.ВлажностьПереоформленияПриход;
		ТабДвижений1.Параметры.СорнаяПримесьПереоформленияПриход = ВыборкаСсылка.СорнаяПримесьПереоформленияПриход;
		ТабДокумент.Вывести(ТабДвижений1);
		//Если  ВыборкаСсылка.ФизическийВесВнутрПриход>0 тогда
		//	ВНПеремещениеПриход = Макет.ПолучитьОбласть("ВНПеремещениеПриход");
		//	ВНПеремещениеПриход.Параметры.НачалоПеремещенияПриход = Формат(ВыборкаСсылка.НачалоВнутрПриход, "ДЛФ=D");
		//	ВНПеремещениеПриход.Параметры.КонецПеремещенияПриход = Формат(ВыборкаСсылка.ОкончаниеВнутрПриход, "ДЛФ=D");
		//	ВНПеремещениеПриход.Параметры.ФизическийВесВнутрПриход = ВыборкаСсылка.ФизическийВесВнутрПриход;
		//	ВНПеремещениеПриход.Параметры.ВлажностьВнутрПриход = ВыборкаСсылка.ВлажностьВнутрПриход;
		//	ВНПеремещениеПриход.Параметры.СорнаяПримесьВнутрПриход = ВыборкаСсылка.СорнаяПримесьВнутрПриход;
		//	ТабДокумент.Вывести(ВНПеремещениеПриход);
		//КонецЕсли;
		ТабДвижений2.Параметры.ФизическийВес3 = ВыборкаСсылка.ФизическийВес3;
		ТабДвижений2.Параметры.Влажность3 = ВыборкаСсылка.Влажность3;
		ТабДвижений2.Параметры.СорнаяПримесь3 = ВыборкаСсылка.СорнаяПримесь3;
		//
		// РАСХОД
		ФизическийВесРасход = ВыборкаСсылка.ФизическийВес11;
		ВесПоВлажностиФизическийВесРасход = Окр(ВыборкаСсылка.ФизическийВес11 * ВыборкаСсылка.Влажность11 / 100);
		ВесПоСорнойПримесиФизическийВесРасход = Окр(ВыборкаСсылка.ФизическийВес11 * ВыборкаСсылка.СорнаяПримесь11 / 100);
		
		ТабДвижений2.Параметры.ФизическийВесРасход = ФизическийВесРасход;
		ТабДвижений2.Параметры.ВлажностьФизическийВесРасход = ВыборкаСсылка.Влажность11;
		ТабДвижений2.Параметры.СорнаяПримесьФизическийВесРасход = ВыборкаСсылка.СорнаяПримесь11;
		
		// переоформление
		ВесПоВлажностиФизическийВесПереоформленияРасход = Окр(ВыборкаСсылка.ФизическийВесПереоформленияРасход * ВыборкаСсылка.ВлажностьПереоформленияРасход / 100);
		ВесПоСорнойПримесиФизическийВесПереоформленияРасход = Окр(ВыборкаСсылка.ФизическийВесПереоформленияРасход * ВыборкаСсылка.СорнаяПримесьПереоформленияРасход / 100);
		
		ТабДвижений2.Параметры.ФизическийВесПереоформленияРасход = ВыборкаСсылка.ФизическийВесПереоформленияРасход;
		ТабДвижений2.Параметры.ВлажностьПереоформленияРасход = ВыборкаСсылка.ВлажностьПереоформленияРасход;
		ТабДвижений2.Параметры.СорнаяПримесьПереоформленияРасход = ВыборкаСсылка.СорнаяПримесьПереоформленияРасход;
		
		ТабДокумент.Вывести(ТабДвижений2);
		
		ВесПоВлажностиФизическийВесВнутрРасход = Окр(ВыборкаСсылка.ФизическийВесВнутрРасход * ВыборкаСсылка.ВлажностьВнутрРасход / 100);
		ВесПоСорнойПримесиФизическийВесВнутрРасход = Окр(ВыборкаСсылка.ФизическийВесВнутрРасход * ВыборкаСсылка.СорнаяПримесьВнутрРасход / 100);
		
		Если  ВыборкаСсылка.ФизическийВесВнутрРасход>0 тогда
			ВНПеремещениеРасход = Макет.ПолучитьОбласть("ВНПеремещениеРасход");
			ВНПеремещениеРасход.Параметры.НачалоПеремещенияРасход = Формат(ВыборкаСсылка.НачалоВнутрРасход, "ДЛФ=D");
			ВНПеремещениеРасход.Параметры.КонецПеремещенияРасход = Формат(ВыборкаСсылка.ОкончаниеВнутрРасход, "ДЛФ=D");	
			ВНПеремещениеРасход.Параметры.ФизическийВесВнутрРасход = ВыборкаСсылка.ФизическийВесВнутрРасход;
			ВНПеремещениеРасход.Параметры.ВлажностьВнутрРасход = ВыборкаСсылка.ВлажностьВнутрРасход;
			ВНПеремещениеРасход.Параметры.СорнаяПримесьВнутрРасход = ВыборкаСсылка.СорнаяПримесьВнутрРасход;
			ТабДокумент.Вывести(ВНПеремещениеРасход);
		КонецЕсли;
		// поб. продукт 1,2 кат
		ВесПоВлажностиПобПродуктРасход = (ВыборкаСсылка.ФизическийВес41 * ВыборкаСсылка.Влажность41 / 100);
		ВесПоСорнойПримесиПобПродуктРасход = (ВыборкаСсылка.ФизическийВес41 * ВыборкаСсылка.СорнаяПримесь41 / 100);
		ВесПоВлажностиКат1Расход = (ВыборкаСсылка.ФизическийВес5 * ВыборкаСсылка.Влажность5 / 100);
		ВесПоСорнойПримесиКат1Расход = (ВыборкаСсылка.ФизическийВес5 * ВыборкаСсылка.СорнаяПримесь5 / 100);
		ВесПоВлажностиКат2Расход = (ВыборкаСсылка.ФизическийВес6 * ВыборкаСсылка.Влажность6 / 100);
		ВесПоСорнойПримесиКат2Расход = (ВыборкаСсылка.ФизическийВес6 * ВыборкаСсылка.СорнаяПримесь6 / 100);
		ВесПоВлажностиПрогнозируемогоВесаПобочныхПродуктов = (ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов * ВыборкаСсылка.ПрогнозируемаяВлажностьПобочныхПродуктов / 100);
		ВесПоСорнойПримесиПрогнозируемогоВесаПобочныхПродуктов = (ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьПобочныхПродуктов / 100);
		
		ВесПоВлажностиПрогнозируемогоВеса1Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов1Категории * ВыборкаСсылка.ПрогнозируемаяВлажностьОтходов1Категории / 100);
		ВесПоСорнойПримесиПрогнозируемогоВеса1Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов1Категории * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьОтходов1Категории / 100);
		ВесПоВлажностиПрогнозируемогоВеса2Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов2Категории * ВыборкаСсылка.ПрогнозируемаяВлажностьОтходов2Категории / 100);
		ВесПоСорнойПримесиПрогнозируемогоВеса2Кат = (ВыборкаСсылка.ПрогнозируемыйВесОтходов2Категории * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьОтходов2Категории / 100);
		//
		ФизическийВесКатПП_1_2Расход = ВыборкаСсылка.ФизическийВес41 + ВыборкаСсылка.ФизическийВес5 + ВыборкаСсылка.ФизическийВес6 + ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов + ВыборкаСсылка.ПрогнозируемыйВесОтходов1Категории + ВыборкаСсылка.ПрогнозируемыйВесОтходов2Категории;
		ВесПоВлажностиКатПП_1_2Расход = ВесПоВлажностиПобПродуктРасход + ВесПоВлажностиКат1Расход + ВесПоВлажностиКат2Расход + ВесПоВлажностиПрогнозируемогоВесаПобочныхПродуктов + ВесПоВлажностиПрогнозируемогоВеса1Кат + ВесПоВлажностиПрогнозируемогоВеса2Кат;
		ВесПоСорнойПримесиКатПП_1_2Расход = ВесПоСорнойПримесиПобПродуктРасход + ВесПоСорнойПримесиКат1Расход + ВесПоСорнойПримесиКат2Расход + ВесПоСорнойПримесиПрогнозируемогоВесаПобочныхПродуктов + ВесПоСорнойПримесиПрогнозируемогоВеса1Кат + ВесПоСорнойПримесиПрогнозируемогоВеса2Кат;
		
		ТабДвижений3.Параметры.ФизическийВесКатПП_1_2Расход = ФизическийВесКатПП_1_2Расход;
		ТабДвижений3.Параметры.ВлажностьФизическийВесКатПП_1_2Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКатПП_1_2Расход,ВесПоВлажностиКатПП_1_2Расход,2);
		ТабДвижений3.Параметры.СорнаяПримесьФизическийВесКатПП_1_2Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКатПП_1_2Расход,ВесПоСорнойПримесиКатПП_1_2Расход,2);
		
		// 3 кат.
		ВесПоВлажностиКат3 = (ВыборкаСсылка.ФизическийВес7 * ВыборкаСсылка.Влажность7 / 100);
		ВесПоСорнойПримесиКат3 = (ВыборкаСсылка.ФизическийВес7 * ВыборкаСсылка.СорнаяПримесь7 / 100);
		ВесПоВлажностиПрогнозируемогоВесаКат3 = (ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории * ВыборкаСсылка.ПрогнозируемаяВлажностьОтходов3Категории / 100);
		ВесПоСорнойПримесиПрогнозируемогоВесаКат3 = (ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории * ВыборкаСсылка.ПрогнозируемаяСорнаяПримесьОтходов3Категории/ 100);
		
		ВесПоВлажностиКат3Расход = ВесПоВлажностиКат3 + ВесПоВлажностиПрогнозируемогоВесаКат3;
		ВесПоСорнойПримесиКат3Расход = ВесПоСорнойПримесиКат3 + ВесПоСорнойПримесиПрогнозируемогоВесаКат3;
		
		ФизическийВесКат3Расход = ВыборкаСсылка.ФизическийВес7 + ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории;
		ТабДвижений3.Параметры.ФизическийВесКат3Расход = ФизическийВесКат3Расход;
		ТабДвижений3.Параметры.ВлажностьКа3Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКат3Расход, ВесПоВлажностиКат3Расход,2);
		ТабДвижений3.Параметры.СорнаяПримесьКат3Расход = ИНАГРО_Элеватор.Процент(ФизическийВесКат3Расход,ВесПоСорнойПримесиКат3Расход,2);	
		//
		Если ВыборкаСсылка.ВидОперации=Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет Тогда
			ТабДвижений3.Параметры.ФизическийВесПункт8 = ВыборкаСсылка.ФизическийВес8;
			ТабДвижений3.Параметры.ВлажностьПункт8 = ВыборкаСсылка.Влажность8;
			ТабДвижений3.Параметры.СорнаяПримесьПункт8 = ВыборкаСсылка.СорнаяПримесь8;
			ФизическийВесПункт8 = ВыборкаСсылка.ФизическийВес8;
			ВесПоВлажностиФизическийВесПункт8 = Окр(ВыборкаСсылка.ФизическийВес8 * ВыборкаСсылка.Влажность8  / 100);
			ВесПоСорнойПримесиФизическийВесПункт8 = Окр(ВыборкаСсылка.ФизическийВес8 * ВыборкаСсылка.СорнаяПримесь8  / 100);
		Иначе 
			ТабДвижений3.Параметры.ФизическийВесПункт8 = ВыборкаСсылка.ОстатокПоПеревзвешиванию;
			ТабДвижений3.Параметры.ВлажностьПункт8 = ВыборкаСсылка.ВлажностьОстатокПоПеревзвешиванию;
			ТабДвижений3.Параметры.СорнаяПримесьПункт8 = ВыборкаСсылка.СорнаяПримесьОстатокПоПеревзвешиванию;
			ФизическийВесПункт8 = 0;
			ВесПоВлажностиФизическийВесПункт8 = 0;
			ВесПоСорнойПримесиФизическийВесПункт8 = 0;
		КонецЕсли;
		//
		ВесПоВлажностиВСЕГОРасхода = ВесПоВлажностиФизическийВесРасход + 
		ВесПоВлажностиФизическийВесПереоформленияРасход +
		ВесПоВлажностиФизическийВесВнутрРасход +
		ВесПоВлажностиКатПП_1_2Расход +
		ВесПоВлажностиКат3Расход + 
		ВесПоВлажностиФизическийВесПункт8;
		ВесПоСорнойПримесиВСЕГОРасхода = ВесПоСорнойПримесиФизическийВесРасход +
		ВесПоСорнойПримесиФизическийВесПереоформленияРасход +
		ВесПоСорнойПримесиФизическийВесВнутрРасход +
		ВесПоСорнойПримесиКатПП_1_2Расход +
		ВесПоСорнойПримесиКат3Расход +
		ВесПоСорнойПримесиФизическийВесПункт8;
		
		ВСЕГОРасход = ФизическийВесРасход + 
		ВыборкаСсылка.ФизическийВесПереоформленияРасход +
		ВыборкаСсылка.ФизическийВесВнутрРасход + 
		ФизическийВесКатПП_1_2Расход + 
		ФизическийВесКат3Расход + 
		ФизическийВесПункт8;
		ТабДвижений3.Параметры.ВСЕГОРасход = ВСЕГОРасход;
		ТабДвижений3.Параметры.ВлажностьВСЕГОРасход = ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоВлажностиВСЕГОРасхода,2);
		ТабДвижений3.Параметры.РазницаВлажность = ВыборкаСсылка.Влажность3 - ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоВлажностиВСЕГОРасхода,2); 
		ПримесьДляРазницы = 0;
		Если ВСЕГОРасход <> ВыборкаСсылка.ФизическийВес4 Тогда 
			ТабДвижений3.Параметры.СорнаяПримесьВСЕГОРасход = ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоСорнойПримесиВСЕГОРасхода,2);		
			ПримесьДляРазницы = ИНАГРО_Элеватор.Процент(ВСЕГОРасход,ВесПоСорнойПримесиВСЕГОРасхода,2);		
		Иначе
			ТабДвижений3.Параметры.СорнаяПримесьВСЕГОРасход = ВыборкаСсылка.СорнаяПримесь4;
			ПримесьДляРазницы = ВыборкаСсылка.СорнаяПримесь4;
		КонецЕсли;
		
		ТабДвижений3.Параметры.РазницаСорнаяПримесь = ВыборкаСсылка.СорнаяПримесь3 - ПримесьДляРазницы; 
		// РАЗНИЦА
		РазницаМеждуПриходомРасходом = ВыборкаСсылка.ФизическийВес3 - ВСЕГОРасход;
		ТабДвижений3.Параметры.РазницаМеждуПриходомРасходом = РазницаМеждуПриходомРасходом;	
		ТабДвижений3.Параметры.ВесПовышениеВсего = ВыборкаСсылка.ВесПовышениеВсего;
		
		ВесНедостачи = РазницаМеждуПриходомРасходом + ВыборкаСсылка.ВесПовышениеВсего;
		Если ВыборкаСсылка.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.РасчетПоФакту Тогда
			ВесНедостачи = ВесНедостачи - ВыборкаСсылка.ВесУбыльВсего;
		КонецЕсли;
	
		Если ВесНедостачи < 0 Тогда
			ВесНедостачи = "(" + ((-1)*ВесНедостачи) + ")";
		КонецЕсли;
		ТабДвижений3.Параметры.ВесНедостачи = ВесНедостачи;
		ТабДокумент.Вывести(ТабДвижений3);
		
		//ШАПКА2
		Шапка2 = Макет.ПолучитьОбласть("Шапка2");
		ТабДокумент.Вывести(Шапка2);
		
		//ТабСушкиОчистки
		СтрСушкиОчистки = Макет.ПолучитьОбласть("СтрСушкиОчистки");
		ВСЕГОВесЗерна = 0;
		ВСЕГОМасаПП_1_2кат = 0;
		ВСЕГОВесОтходов3кат = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			СтрСушкиОчистки.Параметры.АктНомерДок = ВыборкаДетальныеЗаписи.НомерАкт;
			СтрСушкиОчистки.Параметры.АктДатаДок = Формат(ВыборкаДетальныеЗаписи.ДатаАкт, "ДЛФ=D");
			СтрСушкиОчистки.Параметры.ВидОперации = ВыборкаДетальныеЗаписи.ВидОчисткиСушки;
			СтрСушкиОчистки.Параметры.МасаЗерна = ВыборкаДетальныеЗаписи.ВесЗернаДо;
			МасаПП_1_2кат = ВыборкаДетальныеЗаписи.ВесПобочногоПродукта + ВыборкаДетальныеЗаписи.ВесОтходов1Категории + ВыборкаДетальныеЗаписи.ВесОтходов2Категории;
			СтрСушкиОчистки.Параметры.МасаПП_1_2кат = МасаПП_1_2кат;
			СтрСушкиОчистки.Параметры.Маса3кат = ВыборкаДетальныеЗаписи.ВесОтходов3Категории;
			ВСЕГОВесЗерна = ВСЕГОВесЗерна + ВыборкаДетальныеЗаписи.ВесЗернаДо;
			ВСЕГОМасаПП_1_2кат = ВСЕГОМасаПП_1_2кат + МасаПП_1_2кат;
			ВСЕГОВесОтходов3кат = ВСЕГОВесОтходов3кат + ВыборкаДетальныеЗаписи.ВесОтходов3Категории;		
			ТабДокумент.Вывести(СтрСушкиОчистки);
		КонецЦикла;
		
		Если (ВыборкаСсылка.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет) и 
			((ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов + ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории) > 0) Тогда
			
			СтрСушкиОчистки.Параметры.ВидОперации = "Прогнозна вага побічного продукту і відходів";
			СтрСушкиОчистки.Параметры.МасаЗерна = 0;
			МасаПП_1_2кат = ВыборкаСсылка.ПрогнозируемыйВесПобочныхПродуктов;
			СтрСушкиОчистки.Параметры.МасаПП_1_2кат = МасаПП_1_2кат;
			СтрСушкиОчистки.Параметры.Маса3кат = ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории;
			ВСЕГОВесЗерна = ВСЕГОВесЗерна + 0;
			ВСЕГОМасаПП_1_2кат = ВСЕГОМасаПП_1_2кат + МасаПП_1_2кат;
			ВСЕГОВесОтходов3кат = ВСЕГОВесОтходов3кат + ВыборкаСсылка.ПрогнозируемыйВесОтходов3Категории;		
			ТабДокумент.Вывести(СтрСушкиОчистки);
			
		КонецЕсли;
		
		
		//Дно
		Дно = Макет.ПолучитьОбласть("Дно");
		СрокХранения = "";
		СрокХранения = ""+СрокХранения+?(ВыборкаСсылка.СрокХраненияМесяцев=0,"","" + ВыборкаСсылка.СрокХраненияМесяцев + ?(КодЯзыкаПечать = "uk"," місяців"," месяцев"));
		СрокХранения = ""+СрокХранения+?(ВыборкаСсылка.СрокХраненияДней=0,""," " + ВыборкаСсылка.СрокХраненияДней + ?(КодЯзыкаПечать = "uk"," днів"," дней"));
		Дно.Параметры.СрокХранения = СрокХранения;
		
		Дно.Параметры.ВСЕГОВесЗерна = ВСЕГОВесЗерна;
		Дно.Параметры.ВСЕГОМасаПП_1_2кат = ВСЕГОМасаПП_1_2кат;
		Дно.Параметры.ВСЕГОВесОтходов3кат = ВСЕГОВесОтходов3кат;
		
		Дно.Параметры.УбыльВлажности = ВыборкаСсылка.УбыльВлажности;
		Дно.Параметры.УбыльПоВлажности = ВыборкаСсылка.УбыльПоВлажности;
		Дно.Параметры.УбыльСорнойПримеси = ВыборкаСсылка.УбыльСорнойПримеси;
		Дно.Параметры.УбыльПоСорнойПримеси = ВыборкаСсылка.УбыльПоСорнойПримеси;
		Дно.Параметры.УбыльЕстественная = ВыборкаСсылка.УбыльЕстественная;
		Дно.Параметры.УбыльПоЕстественной = ВыборкаСсылка.УбыльПоЕстественной;
		Дно.Параметры.ВесУбыльВсего = ВыборкаСсылка.ВесУбыльВсего;
		
		ТабДокумент.Вывести(Дно);
		
		Подписи = Макет.ПолучитьОбласть("Подписи");
		Подписи.Параметры.Директор = Руководители.Руководитель;
		Подписи.Параметры.ГлавБух = Руководители.ГлавныйБухгалтер; 
		Подписи.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ; 
		
		ТабДокумент.Вывести(Подписи);
				
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

#КонецОбласти 

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы <> "ФормаДокумента"
		И ВидФормы <> "ФормаОбъекта" Тогда
		Возврат;
	КонецЕсли;

	ВидОперации = Неопределено; 

	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "ВидОперации");
	КонецЕсли;

	// Если документ копируется, то вид формы получаем из копируемого документа.
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Если Параметры.Свойство("ЗначениеКопирования")
			И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
			ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
				Параметры.ЗначениеКопирования, "ВидОперации");
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Если Параметры.Свойство("ЗначенияЗаполнения") 
			И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
			Если Параметры.ЗначенияЗаполнения.Свойство("ВидОперации") Тогда
				ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
		Если Параметры.Свойство("Основание")
			И ЗначениеЗаполнено(Параметры.Основание) Тогда
			ВидОперации = ОпределитьВидОперацииПоДокументуОснованию(Параметры.Основание);
		КонецЕсли;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ФормыИНАГРО_АктРасчет310 = ПолучитьСоответствиеВидовОперацийФормам();
	ВыбраннаяФорма = ФормыИНАГРО_АктРасчет310[ВидОперации];
	Если ВыбраннаяФорма = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСоответствиеВидовОперацийФормам() Экспорт

	ФормыИНАГРО_АктРасчет310 = Новый Соответствие;
	
	ФормыИНАГРО_АктРасчет310.Вставить(Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет, "ФормаДокументаОбщая");
	ФормыИНАГРО_АктРасчет310.Вставить(Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.РасчетПоФакту,         "ФормаДокументаОбщая");
		
	Возврат ФормыИНАГРО_АктРасчет310;

КонецФункции 

Функция ОпределитьВидОперацииПоДокументуОснованию(Основание) Экспорт

	Результат = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ПредварительныйРасчет;

	Возврат Результат;

КонецФункции

Функция ПолучитьФиксированныйМассивВидовОпераций() Экспорт

	МассивВидовОпераций = Новый Массив;
	СписокВидовОпераций = Новый СписокЗначений;
	
	ЗначенияПеречисления = Метаданные.Перечисления.ИНАГРО_ВидыОперацийАктРасчет310.ЗначенияПеречисления;
	Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
		ТекущийВидОперации = Перечисления.ИНАГРО_ВидыОперацийАктРасчет310[ЗначениеПеречисления.Имя];
		МассивВидовОпераций.Добавить(ТекущийВидОперации);
	КонецЦикла;
		
	Возврат Новый ФиксированныйМассив(МассивВидовОпераций);

КонецФункции

// Формирует список параметров документа
//
// Параметры: 
//  Объект - имя документа. 
//
// Возвращаемое значение:
//  Фильтр с параметрами
//
Функция СформироватьФильтрДокумента(Объект) Экспорт 
	
	Фильтр = "";		
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Фильтр = Фильтр + " И Владелец=&Владелец ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.ДоговорКонтрагента) Тогда
		Фильтр = Фильтр + " И Договор=&Договор ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.Склад) Тогда
		Фильтр = Фильтр + " И Склад=&Склад ";
	КонецЕсли;	
	Если НЕ ИНАГРО_Элеватор.ПолучитьПараметрУчетаЭлеватора(Объект.Дата, "НеВестиУчетПоВидуХраненияВККУ", Ложь) 
		И ЗначениеЗаполнено(Объект.ВидХранения) Тогда
		Фильтр = Фильтр + " И ВидХранения=&ВидХранения ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Фильтр = Фильтр + " И Номенклатура=&Номенклатура ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(Объект.Урожай) Тогда
		Фильтр = Фильтр + " И Урожай=&Урожай ";
	КонецЕсли;
	
	Возврат Фильтр;
	
КонецФункции

#КонецОбласти 

#КонецЕсли

