
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокСкорректированный.Очистить();
	ПолеКолонок = Неопределено;
	Если НЕ Параметры.Свойство("ТабНастройкиКолонок", ПолеКолонок) Тогда
		Отказ = Истина;
		Возврат;		
	КонецЕсли;
	лЖурналРабочегоСтола = Неопределено;
	Если Параметры.Свойство("ЖурналРабочегоСтола", лЖурналРабочегоСтола) Тогда
		ЖурналРабочегоСтола = лЖурналРабочегоСтола;
	КонецЕсли;
	
	СписокДанныхДляВыбора.Очистить();
	СписокДанныхДляВыбора1.Очистить();
	СписокДанныхДляВыбора2.Очистить();
	СписокДанныхДляВыбора3.Очистить();

	Для каждого Стр из ПолеКолонок Цикл
		
		Если Стр.НомерТаб = 100 Тогда
			Нов = СписокСкорректированный.Добавить();
			Нов.Родитель = Стр.Родитель;
			Нов.КолонкаПолная = Стр.КолонкаПолная;
			Нов.ИмяКолонки = Стр.ИмяКолонки;
			Нов.Видимость = Стр.Видимость;
			Нов.НомерТаб = Стр.НомерТаб;
			Продолжить;
	   КонецЕсли;
	   Если Стр.НомерТаб = 200 Тогда
		    ЭтаФорма.Элементы.Группа3.Заголовок = Стр.КолонкаПолная;
			Нов = СписокСкорректированный.Добавить();
			Нов.Родитель = Стр.Родитель;
			Нов.КолонкаПолная = Стр.КолонкаПолная;
			Нов.ИмяКолонки = Стр.ИмяКолонки;
			Нов.Видимость = Стр.Видимость;
			Нов.НомерТаб = Стр.НомерТаб;
			Продолжить;
		КонецЕсли;
		Если Стр.НомерТаб = 300 Тогда
		    ЭтаФорма.Элементы.Группа6.Заголовок = Стр.КолонкаПолная;
			Нов = СписокСкорректированный.Добавить();
			Нов.Родитель = Стр.Родитель;
			Нов.КолонкаПолная = Стр.КолонкаПолная;
			Нов.ИмяКолонки = Стр.ИмяКолонки;
			Нов.Видимость = Стр.Видимость;
			Нов.НомерТаб = Стр.НомерТаб;
			 Продолжить;
		КонецЕсли;	
		Если Стр.НомерТаб = 400 Тогда
		    ЭтаФорма.Элементы.Группа7.Заголовок = Стр.КолонкаПолная;
			Нов = СписокСкорректированный.Добавить();
			Нов.Родитель = Стр.Родитель;
			Нов.КолонкаПолная = Стр.КолонкаПолная;
			Нов.ИмяКолонки = Стр.ИмяКолонки;
			Нов.Видимость = Стр.Видимость;
			Нов.НомерТаб = Стр.НомерТаб;
			 Продолжить;
		КонецЕсли;	
		Если Стр.НомерТаб = 500 Тогда
		    ЭтаФорма.Элементы.Группа8.Заголовок = Стр.КолонкаПолная;
			Нов = СписокСкорректированный.Добавить();
			Нов.Родитель = Стр.Родитель;
			Нов.КолонкаПолная = Стр.КолонкаПолная;
			Нов.ИмяКолонки = Стр.ИмяКолонки;
			Нов.Видимость = Стр.Видимость;
			Нов.НомерТаб = Стр.НомерТаб;
			 Продолжить;
		КонецЕсли;	
        
	    Если Стр.НомерТаб > 200 И Стр.НомерТаб < 300  Тогда
			Нов = СписокДанныхДляВыбора.Добавить();
		КонецЕсли;
		 Если Стр.НомерТаб > 300 И Стр.НомерТаб < 400  Тогда
			Нов = СписокДанныхДляВыбора1.Добавить();
		КонецЕсли;
 		Если Стр.НомерТаб > 400 И Стр.НомерТаб < 500  Тогда
			Нов = СписокДанныхДляВыбора2.Добавить();
		КонецЕсли;
		 Если Стр.НомерТаб > 500 И Стр.НомерТаб < 600  Тогда
			Нов = СписокДанныхДляВыбора3.Добавить();
		КонецЕсли;
		
		Нов.Родитель = Стр.Родитель;
		Нов.КолонкаПолная = Стр.КолонкаПолная;
		Нов.ИмяКолонки = Стр.ИмяКолонки;
		Нов.Видимость = Стр.Видимость;
		Нов.НомерТаб = Стр.НомерТаб;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеВСписок(Значение, ОтборПоВсем, СписокТекущий, Заголовок = "");
	Если ОтборПоВсем Тогда
		Отметка = Ложь;
	Иначе
		Отметка = СписокТекущий.НайтиПоЗначению(Значение) <> Неопределено;
	КонецЕсли;
	СписокДанныхДляВыбора.Добавить(Значение, Заголовок, Отметка);
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	нн = 200;
	Для Каждого Стр Из СписокДанныхДляВыбора Цикл
		нн = нн + 1;
		Нов = СписокСкорректированный.Добавить();
		Нов.Родитель = Стр.Родитель;
		Нов.КолонкаПолная = Стр.КолонкаПолная;
		Нов.ИмяКолонки = Стр.ИмяКолонки;
		Нов.Видимость = Стр.Видимость;
		Нов.НомерТаб = нн;
	КонецЦикла;
	нн = 300;
	Для Каждого Стр Из СписокДанныхДляВыбора1 Цикл
		нн = нн + 1;
		Нов = СписокСкорректированный.Добавить();
		Нов.Родитель = Стр.Родитель;
		Нов.КолонкаПолная = Стр.КолонкаПолная;
		Нов.ИмяКолонки = Стр.ИмяКолонки;
		Нов.Видимость = Стр.Видимость;
		Нов.НомерТаб = нн;
	КонецЦикла;
	нн = 400;
	Для Каждого Стр Из СписокДанныхДляВыбора2 Цикл
		нн = нн + 1;
		Нов = СписокСкорректированный.Добавить();
		Нов.Родитель = Стр.Родитель;
		Нов.КолонкаПолная = Стр.КолонкаПолная;
		Нов.ИмяКолонки = Стр.ИмяКолонки;
		Нов.Видимость = Стр.Видимость;
		Нов.НомерТаб = нн;
	КонецЦикла;
	нн = 500;
	Для Каждого Стр Из СписокДанныхДляВыбора3 Цикл
		нн = нн + 1;
		Нов = СписокСкорректированный.Добавить();
		Нов.Родитель = Стр.Родитель;
		Нов.КолонкаПолная = Стр.КолонкаПолная;
		Нов.ИмяКолонки = Стр.ИмяКолонки;
		Нов.Видимость = Стр.Видимость;
		Нов.НомерТаб = нн;
	КонецЦикла;
	СписокСкорректированный.Сортировать("НомерТаб Возр");
	
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Действие", "УстановитьСписокКолонок");
	СтруктураНастройки.Вставить("СписокКолонок", СписокСкорректированный);
	СтруктураНастройки.Вставить("ЖурналРабочегоСтола", ЖурналРабочегоСтола);
	Закрыть(СтруктураНастройки);
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора Цикл
		Элемент.Видимость = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе1(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора1 Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе2(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора2 Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе3(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора3 Цикл
		Элемент.Видимость = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки1(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора1 Цикл
		Элемент.Видимость = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки2(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора2 Цикл
		Элемент.Видимость = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки3(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора3 Цикл
		Элемент.Видимость = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСтандартные(Команда)
	СтруктураНастройки = Новый Структура;
	СтруктураНастройки.Вставить("Действие", "УстановитьСтандартныеНастройки");
	СтруктураНастройки.Вставить("ЖурналРабочегоСтола", ЖурналРабочегоСтола);
	Закрыть(СтруктураНастройки);
КонецПроцедуры


