
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// ИНАГРО ++ В кадровые данные выводим документы ИН-АГРО
	
	//ВладелецФормы = ПараметрыВыполненияКоманды.Источник;
	//
	//ПараметрыОткрытия = Новый Структура;
	//ПараметрыОткрытия.Вставить("СотрудникСсылка", ПараметрКоманды);
	//ПараметрыОткрытия.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);

	//ОткрытьФорму("Справочник.Сотрудники.Форма.КадровыеДокументы", 
	//	ПараметрыОткрытия, 
	//	ВладелецФормы, 
	//	, 
	//	ПараметрыВыполненияКоманды.Окно);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СотрудникСсылка", ПараметрКоманды);
	ПараметрыФормы.Вставить("КлючНазначенияИспользования", "ИНАГРО_ДокументыПоСотрудникуОрганизации");
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	
	ОткрытьФорму("Справочник.Сотрудники.Форма.ИНАГРО_КадровыеДокументы", ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	// ИНАГРО --
КонецПроцедуры
