#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		ПараметрыФормы = Новый Структура("ОбъектОтбора", ПараметрКоманды);
		ОткрытьФорму("Обработка.ИНАГРО_ФормированиеПлатежныхДокументовПоНалогам.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти