#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  	

	УправлениеФормой(ЭтаФорма); 

КонецПроцедуры  

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.МаркаАвтотранспорта) Тогда
		ТекстСообщения = НСтр("ru='Не заполнена Марка автотранспорта!';uk='Не заповнена Марка автотранспорту!'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Запись.МаркаАвтотранспорта", , Отказ);		
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УказатьНормыРасходаНаВидРаботПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьНадбавкуНаНормуПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаАвтотранспортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;	
	Отбор.Вставить("ВидТехники", ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыТехники.Автотранспорт"));
		
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
		
	ОткрытьФорму("Справочник.ИНАГРО_МоделиТС.ФормаВыбора", ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаАгрегатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;	
	Отбор.Вставить("ВидТехники", ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыТехники.Прицеп"));
		
	ПараметрыФормы = Новый Структура("Отбор", Отбор);
		
	ОткрытьФорму("Справочник.ИНАГРО_МоделиТС.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НадбавкаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма); 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Запись	 = Форма.Запись;

	Элементы.НормаРасходаТоплива.Доступность      = Запись.УказатьНормыРасходаНаВидРабот;
	Элементы.НормаРасходаТопливаЗимой.Доступность = Запись.УказатьНормыРасходаНаВидРабот;		
	Элементы.НормыК.Доступность                   = Запись.УказатьНормыРасходаНаВидРабот;
	Элементы.НормаСпецРаботы.Доступность          = Запись.УказатьНормыРасходаНаВидРабот;
	
	Элементы.Надбавка.Доступность                 = Запись.УказатьНадбавкуНаНорму;
	
	Если ЗначениеЗаполнено(Запись.Надбавка) Тогда 		
		Элементы.НадбавкаЗначение.Заголовок = НСтр("ru='Значение = ';uk='Значення = '") +
			РеквизитыНадбавки(Запись.Надбавка, "РазмерНадбавки") + ?(РеквизитыНадбавки(Запись.Надбавка, "ВПроцентах"), " %", "");	
	КонецЕсли; 
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция РеквизитыНадбавки(Надбавка, Реквизит)
	
	Возврат	ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Надбавка, Реквизит);
	
КонецФункции

#КонецОбласти