// Формирует подчиненные типовые документы.
//
//	Параметры:
//  	ДокументОбъект - ДокументОбъект - документ для которого выполяентся операция
//      Отказ          - Булево - устанавливает в Истина, если отказ от формирования типового документа
//
Процедура СформироватьПодчиненныеДокументы(ДокументОбъект, Отказ) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ЭлеваторФормированиеДокументовСервер");
	Если Обр <> Неопределено Тогда
		Обр.СформироватьПодчиненныеДокументы(ДокументОбъект, Отказ);
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

