#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Период(Команда)
	
	ПараметрыФормыВыбора = Новый Структура("НачалоХранения, КонецХранения", НачалоХранения, КонецХранения);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыФормыВыбора, Элементы.Период, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НачалоХранения = РезультатВыбора.НачалоПериода;
	КонецХранения  = РезультатВыбора.КонецПериода;
		
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураОтборов = Новый Структура;
	СтруктураОтборов.Вставить("НачалоХранения", НачалоХранения);
	СтруктураОтборов.Вставить("КонецХранения",  КонецХранения);
	СтруктураОтборов.Вставить("Урожай",         Урожай);
	СтруктураОтборов.Вставить("Склад",          Склад);
	СтруктураОтборов.Вставить("Номенклатура",   Номенклатура);
	СтруктураОтборов.Вставить("Контрагент",     Контрагент);
	
	ЗаписатьСтруктуруОтборовНаСервере(СтруктураОтборов);
	
	Закрыть(СтруктураОтборов);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьСтруктуруОтборовНаСервере(СтруктураОтборов)
	
	Документы.ИНАГРО_РасчетУслугХранения.ЗаписатьВыбраннуюПечатнуюФорму(СтруктураОтборов);

КонецПроцедуры 

#КонецОбласти