#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодключатьПоIPПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура КвоДатчиковПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФайлДрайвераНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбратьФайл(Элемент, "dll");
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)	
	
	ВыбратьФайл(Элемент, "epf");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыРазделы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	Если Объект.ВидОборудования = ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыВнешнегоОборудования.Весы")
		И НЕ Объект.ПодключатьПоIP Тогда
		
		Элементы.ГруппаНастройкаПортов.Видимость = Истина;
		Элементы.ГруппаНастройкиПодключенияПоIP.Видимость = Ложь;		
			
		Если Объект.КвоДатчиков = 1 Тогда
			Элементы.ГруппаПорт2.Видимость = Ложь;	
		ИначеЕсли Объект.КвоДатчиков = 2 Тогда
			Элементы.ГруппаПорт2.Видимость = Истина;
		КонецЕсли;		
		
	ИначеЕсли Объект.ВидОборудования = ПредопределенноеЗначение("Перечисление.ИНАГРО_ВидыВнешнегоОборудования.Весы")
		И Объект.ПодключатьПоIP Тогда
		
		Элементы.ГруппаНастройкаПортов.Видимость = Ложь;
		Элементы.ГруппаНастройкиПодключенияПоIP.Видимость = Истина;

	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Элемент, ТипФайла)
	
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ТипФайла="epf" Тогда
		ДиалогОткрытияФайла.Фильтр=НСтр("ru='Файл внешней обработки(*.epf)|*.epf';uk='Файл зовнішньої обробки (*.epf)|*.epf'");
		ДиалогОткрытияФайла.Расширение ="epf";
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.Файл;
	ИначеЕсли ТипФайла="dll" Тогда
		ДиалогОткрытияФайла.Фильтр=НСтр("ru='Файл динамической библиотеки(*.dll)|*.dll';uk='Файл динамічної бібліотеки(*.dll)|*.dll'");
		ДиалогОткрытияФайла.Расширение ="epf";
		ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлДрайвера;
	КонецЕсли;
	
	ДиалогОткрытияФайла.Заголовок=НСтр("ru='Выберите файл';uk='Виберіть файл'");
	ДиалогОткрытияФайла.ПредварительныйПросмотр = Ложь;
	ДиалогОткрытияФайла.ИндексФильтра = 0;
	ДиалогОткрытияФайла.ПроверятьСуществованиеФайла = Истина;
	
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Если ТипФайла="epf" Тогда
			Объект.Файл = ДиалогОткрытияФайла.ПолноеИмяФайла;
		ИначеЕсли ТипФайла="dll" Тогда
			Объект.ФайлДрайвера = ДиалогОткрытияФайла.ПолноеИмяФайл;
		КонецЕсли;              
		//Объект.КаталогФайлаДрайвера = ДиалогОткрытияФайла.Каталог;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти