
// DIN  06.05.22 #951

Процедура ОбменДаннымиОбмен_FlyDoc_Документы_ПриЗаписиПриЗаписи(Источник, Отказ) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ОтложеннаяЗапись", Истина);
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("СМС_Обмен_FlyDoc", Источник, Отказ);

КонецПроцедуры

Процедура ОбменДаннымиОбмен_FlyDoc_Документы_ПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("СМС_Обмен_FlyDoc", Источник, Отказ);

КонецПроцедуры
// DIN  06.05.22 #951