#Область ПрограммныйИнтерфейс

#Область Движения

// Выполняет движения по списанию топлива документа ИНАГРО_ПутевойЛистТрактористаМашиниста.
//
//  Параметры:
//		ДокОбъект                 - ДокументОбъект
//		СтруктураШапкиДокумента   - Структура - структура реквизитов шапки документа
//		ТаблицаПоПутевымЛистам    - ТаблицаЗначений
//		ТаблицаТопливо            - ТаблицаЗначений
//		ТаблицаПоВыпускуПродукции - ТаблицаЗначений
//		ТаблицаТопливоСливТоплива - ТаблицаЗначений
//      Отказ                     - Булево - если Истина, отказ от проведения документа
//      Заголовок                 - Строка - заголовок для сообщений об ошибках проведения
//
Процедура ИНАГРО_ДвиженияПоТопливу(ДокОбъект,
								   СтруктураШапкиДокумента,
								   ТаблицаПоПутевымЛистам, 
								   ТаблицаТопливо,
								   ТаблицаПоВыпускуПродукции,
								   ТаблицаТопливоСливТоплива,
								   Отказ,
								   Заголовок) Экспорт
								   
	ИНАГРО_ТранспортСервер.ИНАГРО_ДвиженияПоТопливу(ДокОбъект,
												    СтруктураШапкиДокумента,
												    ТаблицаПоПутевымЛистам, 
												    ТаблицаТопливо,
												    ТаблицаПоВыпускуПродукции,
												    ТаблицаТопливоСливТоплива,
												    Отказ,
													Заголовок)
		
КонецПроцедуры  

// Делает движения по регистру ИНАГРО_МатериалыСписанныеНаТранспорт.
//
//  Параметры:
//		Движения       		    - КоллекцияДвижений - коллекция движений документа
//		ТаблицаПоТоварам	    - ТаблицаЗначений - таблица по которой выполняются движения
//		СтруктураШапкиДокумента	- Структура - структура реквизитов шапки документа
//
Процедура ИНАГРО_ДвижениеПоМатериаламСписаннымНаТранспорт(Движения, ТаблицаПоТоварам, СтруктураШапкиДокумента) Экспорт
	
	ИНАГРО_ТранспортСервер.ИНАГРО_ДвижениеПоМатериаламСписаннымНаТранспорт(Движения, ТаблицаПоТоварам, СтруктураШапкиДокумента);	
	
КонецПроцедуры

#КонецОбласти

#Область ВыпускПродукции

// Подготавливает таблицу выпуска продукции автотранспорт по операциям
//
//  Параметры:
//		СтруктураШапкиДокумента	- Структура - структура реквизитов шапки документа
//
//	Возвращаемое значение:
//  	ТаблицаЗначений         - таблица выпуска продукции автотранспорт по операциям
//
Функция ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииАвтотранспортПоОперациям(СтруктураШапкиДокумента) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииАвтотранспортПоОперациям(СтруктураШапкиДокумента);
	
КонецФункции

// Подготавливает таблицу выпуска продукции сельхозтехника по операциям
//
//  Параметры:
//		СтруктураШапкиДокумента	- Структура - структура реквизитов шапки документа
//
//	Возвращаемое значение:
//  	ТаблицаЗначений         - таблица выпуска продукции автотранспорт по операциям
//
Функция ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииСельхозтехникаПоОперациям(СтруктураШапкиДокумента) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииСельхозтехникаПоОперациям(СтруктураШапкиДокумента);
	
КонецФункции

// Процедура проверяет отпука и больничные сотрудников
//
//  Параметры:
//		ПутевойЛист	- ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля, ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста
//
//	Возвращаемое значение:
//  	Булево      - Истина, если сотрудник был в отпуске или на больничном   
//
Функция ПроверитьОтпускаБольничныеСотрудников(ПутевойЛист) Экспорт
	
	Возврат ИНАГРО_УчетРабочегоВремени.ПроверитьОтпускаБольничныеСотрудников(ПутевойЛист);
	
КонецФункции

#КонецОбласти

#Область ПодготовкаТаблицПутевыхЛистовДляПроведения

// Выгружает результат запроса в таблицу значений, добавляет ей необходимые колонки для проведения.
//
//  Параметры: 
//  	РезультатЗапросаПоПутевымЛистам - результат запроса по табличной части "ПутевыеЛисты"
// 	 СтруктураШапкиДокумента	        - Структура - структура реквизитов шапки документа
//
//  Возвращаемое значение:
//  	ТаблицаЗначений                 - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_АТ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_АТ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента);
	
КонецФункции

// Выгружает результат запроса в таблицу значений, добавляет ей необходимые колонки для проведения.
//
//  Параметры: 
//  	РезультатЗапросаПоПутевымЛистам - результат запроса по табличной части "ПутевыеЛисты"
// 		СтруктураШапкиДокумента	        - Структура - структура реквизитов шапки документа
//      Отказ                           - Булево - если Истина, отказ от проведения документа
//
//  Возвращаемое значение:
//  	ТаблицаЗначений                 - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_ТМ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента, Отказ) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_ТМ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента, Отказ);
	
КонецФункции

// Формирует выборку путевых листов для ЗП АТ.
//
//  Параметры:
//		СсылкаНаОбъект   - ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля
//
//  Возвращаемое значение:
//  	Выборка          - выборка по результату запроса
//
Функция ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_АТ(СсылкаНаОбъект) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_АТ(СсылкаНаОбъект);
	
КонецФункции

// Формирует выборку путевых листов для ЗП ТМ.
//
//  Параметры:
//		СсылкаНаОбъект   - ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста
//
//  Возвращаемое значение:
//  	Выборка          - выборка по результату запроса
//
Функция ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_ТМ(СсылкаНаОбъект) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_ТМ(СсылкаНаОбъект);
	
КонецФункции

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
//  Параметры:
//		ЭтотОбъект                - ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля, ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста
//  	РезультатЗапросаПоТопливу - результат запроса по табличной части "Топливо"
//  	СтруктураШапкиДокумента   - Структура - структура реквизитов шапки документа
//		СливТоплива               - Булево
//
//  Возвращаемое значение:
//  	ТаблицаЗначений           - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуТопливо(ЭтотОбъект, РезультатЗапросаПоТопливу, СтруктураШапкиДокумента, СливТоплива = 0) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьТаблицуТопливо(ЭтотОбъект, РезультатЗапросаПоТопливу, СтруктураШапкиДокумента, СливТоплива);
	
КонецФункции

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
//  Параметры:
//		ЭтотОбъект                               - ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля, ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста
//  	РезультатЗапросаПоТопливоИзрасходованное - результат запроса по табличной части "ТопливоИзрасходованно"
//  	СтруктураШапкиДокумента                  - Структура - структура реквизитов шапки документа
//
//  Возвращаемое значение:
//  	ТаблицаЗначений                          - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуТопливоИзрасходованное(ЭтотОбъект, РезультатЗапросаПоТопливоИзрасходованное, СтруктураШапкиДокумента) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПодготовитьТаблицуТопливоИзрасходованное(ЭтотОбъект, РезультатЗапросаПоТопливоИзрасходованное, СтруктураШапкиДокумента);
	
КонецФункции

#КонецОбласти

#Область ПрочийФункционал
							   
// Возвращает коэффициент перерасчета топлива.
//
//  Параметры:
//		ТранспортноеСредство - СправочникСсылка.ИНАГРО_МоделиТС
//  	Топливо              - СправочникСсылка.Номенклатура
//
//  Возвращаемое значение:
//  	Число                - коэффициент пересчета в основное топливо
//      Неопределено
//
Функция ПолучитьКоэффициентПересчетаВОсновноеТопливо(ТранспортноеСредство, Топливо) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ПолучитьКоэффициентПересчетаВОсновноеТопливо(ТранспортноеСредство, Топливо);
	
КонецФункции	

// Определяет расценки технологической операции на дату.
//
//  Параметры:
//		ДатаРасценок            - Дата
//  	АвтомобильМодель        - СправочникСсылка.ОсновныеСредства
//  	ТехнологическаяОперация - СправочникСсылка.ИНАГРО_ТехнологическиеОперации
//  	Прицеп                  - СправочникСсылка.ИНАГРО_МоделиТС
//  	Организация             - СправочникСсылка.Организации
//
//  Возвращаемое значение:
//  	Структура                - структура расценок
//
Функция ИНАГРО_ПолучитьСтруктуруРасценок(ДатаРасценок, АвтомобильМодель, ТехнологическаяОперация, Прицеп, Организация) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПолучитьСтруктуруРасценок(ДатаРасценок, АвтомобильМодель, ТехнологическаяОперация, Прицеп, Организация);
			
КонецФункции

// Определяет расценки технологической операции на дату для сельскохозяйственной техники.  
//
//  Параметры:
//		ДатаРасценок            - Дата
//  	МаркаСельхозтехники     - СправочникСсылка.ОсновныеСредства
//  	ТехнологическаяОперация - СправочникСсылка.ИНАГРО_ТехнологическиеОперации
//  	МаркаАгрегата           - СправочникСсылка.ИНАГРО_МоделиТС
//  	Организация             - СправочникСсылка.Организации
//
//  Возвращаемое значение:
//  	Структура                - структура расценок
//
Функция ИНАГРО_ПолучитьСтруктуруРасценокВидыРаботСХТехники(ДатаРасценок, МаркаСельхозтехники, ТехнологическаяОперация, МаркаАгрегата, Организация) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_ПолучитьСтруктуруРасценокВидыРаботСХТехники(ДатаРасценок, МаркаСельхозтехники, ТехнологическаяОперация,	МаркаАгрегата, Организация);
			
КонецФункции

// Возвращает показатели спидометра и бака для ТС на заданную дату, за исключением данных 
// внесенных документом источником, в случае повторного вызова после проведения.
//
//  Параметры:
//		Дата             - Дата
//  	ОсновноеСредство - СправочникСсылка.ОсновныеСредства
//  	Документ         - ДокументСсылка.ИНАГРО_ВводНачальныхОстатковТоплива,
//                         ДокументСсылка.ИНАГРО_ПередачаТоплива,
//                         ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля,
//                         ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста,
//                         ДокументСсылка.ИНАГРО_СливТоплива
//
//  Возвращаемое значение:
//  	Структура        - структура показаний спидометра и бака
//
Функция ПолучитьПоказанияСпидометраИБака(Дата, ОсновноеСредство, Документ) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ПолучитьПоказанияСпидометраИБака(Дата, ОсновноеСредство, Документ);
	
КонецФункции

// Возвращает нормы расхода топлива.
//
//  Параметры:
//  	ДатаНорм      - дата, на которую определяются нормы.
//  	Авто		  - ОС, для которого определяются нормы.
//  Возвращаемое значение:
//  	Структура
//
Функция ИНАГРО_НормыРасходаТоплива(ДатаНорм, Авто) Экспорт
	
	Возврат ИНАГРО_ТранспортСервер.ИНАГРО_НормыРасходаТоплива(ДатаНорм, Авто);
	
КонецФункции

#КонецОбласти

#КонецОбласти
