
Функция ПолучитьРезультатыФункцииПечатьДокумента(МассивДанныхПоДокументам) Экспорт
	ИДКонфигурации  = скEDI_НастройкиПодКонфигурацию.ИДКонфигурации();
	
	Если ИДКонфигурации = "БП"
	ИЛИ ИДКонфигурации = "УТ"
	ИЛИ ИДКонфигурации = "УТП"
	ИЛИ ИДКонфигурации = "УПП" Тогда
	
		#Если ТолстыйКлиентОбычноеПриложение Тогда
			Результат = Новый Соответствие;
			Для Каждого ЭлементМассиваДанныхПоДокументам Из МассивДанныхПоДокументам Цикл
				Если ЭлементМассиваДанныхПоДокументам.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Исходящий") Тогда
					Если ЭлементМассиваДанныхПоДокументам.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан")
						Или ЭлементМассиваДанныхПоДокументам.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ЕстьТолькоДокумент1С") Тогда
						
						Документ1С = ЭлементМассиваДанныхПоДокументам.Документ1С;
						Если ЭлементМассиваДанныхПоДокументам.ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.НалоговаяНакладная") Тогда
							ИспользоватьДанныеЗЦ = Ложь;
							Если ЗначениеЗаполнено(Документ1С.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены) Тогда
								НалоговыйДокументОбъект = Документ1С.ОсновнаяНалоговаяПриРезервеНомераПриПродажаНижеОбычнойЦены.ПолучитьОбъект();	
							    ИспользоватьДанныеЗЦ = Истина;
							Иначе
								НалоговыйДокументОбъект = Документ1С.ПолучитьОбъект();
							КонецЕсли;
							Попытка
								СтруктураПараметров = НалоговыйДокументОбъект.ПечатьДокумента(Истина);
								Если ИспользоватьДанныеЗЦ Тогда
									ДанныеШапки = СтруктураПараметров.НалоговыйДокументЗЦ;
								Иначе	
									ДанныеШапки = СтруктураПараметров.НалоговыйДокумент;
								КонецЕсли;
								Результат.Вставить(Документ1С, Новый ХранилищеЗначения(ДанныеШапки));
							Исключение
							КонецПопытки;
						ИначеЕсли ЭлементМассиваДанныхПоДокументам.ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной") Тогда
							НалоговыйДокументОбъект = Документ1С.ПолучитьОбъект();
							Попытка
								СтруктураПараметров = НалоговыйДокументОбъект.ПечатьДокумента(Истина);
								ДанныеШапки = СтруктураПараметров.НалоговыйДокумент;
								Результат.Вставить(Документ1С, Новый ХранилищеЗначения(ДанныеШапки));
							Исключение
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Возврат Результат;
		#Иначе
			Возврат Неопределено;
		#КонецЕсли
	ИначеЕсли ИДКонфигурации = "БП20"
		ИЛИ ИДКонфигурации = "УТ30"
		ИЛИ ИДКонфигурации = "УТ31"
		ИЛИ ИДКонфигурации = "БП20ИНАГРО"
		ИЛИ ИДКонфигурации = "BASУТ"
		ИЛИ ИДКонфигурации = "BASКУП"
		ИЛИ ИДКонфигурации = "BASERP"
		ИЛИ ИДКонфигурации = "FlyDoc" 
		ИЛИ ИДКонфигурации = "УНФ" 
		Тогда
		
		Возврат Неопределено;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции


