// ИНАГРО++
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ИНАГРО_ЭтоСельсоветПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Элементы.ИНАГРО_ЭтоСельсовет.Видимость = ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБСПУ();
	Элементы.ИНАГРО_Сельсовет.Видимость    = ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБСПУ();	
	Элементы.ИНАГРО_Сельсовет.Доступность  = Объект.ИНАГРО_ЭтоСельсовет;
	
КонецПроцедуры 

#КонецОбласти
	
#КонецОбласти
// ИНАГРО--
