
&НаСервере
Процедура ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ПодготовитьИРазместитьНетиповыеЭлементыНаФорме();
КонецПроцедуры

//added by Al
&НаСервере
Процедура ПодготовитьИРазместитьНетиповыеЭлементыНаФорме()
	                             
	//создаем группы страниц и страницы                             
	СМС_ДФИ_КлиентСервер.СздСтраница(ЭтаФорма, "СМС_КроссЭлеваторныеНастройки", Элементы.ГруппаСтраницы, 
	НСтр("ru = 'Кросс-элеваторные настройки'; uk = 'Крос-елеваторні налаштування'"));	                             
	 
	СМС_ДФИ_КлиентСервер.СздГруппаСтраниц(ЭтаФорма, "СМС_ГруппаСтраницы", Элементы.СМС_КроссЭлеваторныеНастройки);                                                                        
	
	СМС_ДФИ_КлиентСервер.СздСтраница(ЭтаФорма, "СМС_ОбщиеНастройки", Элементы.СМС_ГруппаСтраницы, 
	НСтр("ru = 'Общие настройки'; uk = 'Загальні налаштування'"));
	
	СМС_ДФИ_КлиентСервер.СздПолеФлажок(ЭтаФорма, "СМС_ИспользоватьМеханизмУчетаОстатковКультурПоПартиям", Элементы.СМС_ОбщиеНастройки, 
									   , 1, "Запись.СМС_ИспользоватьМеханизмУчетаОстатковКультурПоПартиям"); 
	                                                                         
КонецПроцедуры
//added by Al
