#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	ОбработатьЗаголовки(ДокументРезультат);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьЗаголовки(ТабДок) 	
	
	КодЯзыкаПечати =  Локализация.КодЯзыкаИнтерфейса();
	Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл		
		НачальнаяКолонка = 0;
		Для индКол=1 По ТабДок.ШиринаТаблицы Цикл
			Если КодЯзыкаПечати = "uk" Тогда
				Если  ТабДок.Область(индСтр, индКол).Текст = "Не працює" Тогда				
					ТабДок.Область(индСтр, индКол).Текст = НСтр("ru='Звільнений';uk='Звільнений'");
				КонецЕсли;
			Иначе
				Если ТабДок.Область(индСтр, индКол).Текст = "Не работает" Тогда				
					ТабДок.Область(индСтр, индКол).Текст = НСтр("ru='Уволен';uk='Уволен'");
				КонецЕсли;
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли