#Область ОбработчикиСобытийЭлементовШапкиФормы
	 
&НаКлиенте
Процедура ИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СписокРеквизитов = Новый СписокЗначений;	
	
	СформироватьСписокРеквизитов(СписокРеквизитов);
	
	ОповещениеВыбора = Новый ОписаниеОповещения("ВыборИзСпискаЗавершение", ЭтаФорма);
	ПоказатьВыборИзСписка(ОповещениеВыбора, СписокРеквизитов, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВыборИзСпискаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент <> Неопределено Тогда
		Запись.ИмяРеквизита = ВыбранныйЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьСписокРеквизитов(СписокРеквизитов)
	
	Если Запись.ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВвоз Тогда
		СписокРеквизитов.Добавить("Поставщик");
		СписокРеквизитов.Добавить("ЛабораторныйАнализ");
		СписокРеквизитов.Добавить("СтепеньВлажности");
		СписокРеквизитов.Добавить("СтепеньЗагрязнения");
		СписокРеквизитов.Добавить("СтепеньЗараженности");
		СписокРеквизитов.Добавить("НомерПробы");
		СписокРеквизитов.Добавить("Силос");
		СписокРеквизитов.Добавить("МестоХранения");
		СписокРеквизитов.Добавить("ПолеТок");
	ИначеЕсли Запись.ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВнутр Тогда 
		СписокРеквизитов.Добавить("МестоХранения");
		СписокРеквизитов.Добавить("НовоеМестоХранения");
	ИначеЕсли Запись.ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВывоз Тогда
		СписокРеквизитов.Добавить("ЛабораторныйАнализ");
		СписокРеквизитов.Добавить("МестоХранения");
		СписокРеквизитов.Добавить("ПриказНаВывоз");
	ИначеЕсли Запись.ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВвозЖД Тогда
		СписокРеквизитов.Добавить("ЛабораторныйАнализ");
		СписокРеквизитов.Добавить("МестоХранения");
	ИначеЕсли Запись.ВидРеестра = Перечисления.ИНАГРО_ВидыРеестровТТН.ИНАГРО_РеестрТТНВывозЖД Тогда
		СписокРеквизитов.Добавить("ЛабораторныйАнализ");
		СписокРеквизитов.Добавить("МестоХранения");
		СписокРеквизитов.Добавить("ПриказНаВывоз");
	КонецЕсли;	
	
КонецПроцедуры;

#КонецОбласти