
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОписаниеИспользования = ПолучитьТекстОписанияИспользованияНаСервере(Запись.Событие);
	Если ОписаниеИспользования = "" Тогда
		Элементы.ОписаниеИспользования.Видимость = Ложь;
	Иначе
		Элементы.ОписаниеИспользования.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекстОписанияИспользованияНаСервере(Событие)
	ТекстОписания = Перечисления.скEDI_События.ПолучитьТекстОписанияИспользования(Событие);
	Возврат ТекстОписания;
КонецФункции

&НаКлиенте
Процедура СобытиеПриИзменении(Элемент)
	ОписаниеИспользования = ПолучитьТекстОписанияИспользованияНаСервере(Запись.Событие);
	Если ОписаниеИспользования = "" Тогда
		Элементы.ОписаниеИспользования.Видимость = Ложь;
	Иначе
		Элементы.ОписаниеИспользования.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры
