Процедура ПриЗаписи(Отказ)
	Если ОсновнаяПодписьШифрования Тогда
		Если ИспользованиеКлюча = Перечисления.скEDI_ИспользованиеКлючей.Шифрование Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			               |	скEDI_Подписи.Ссылка
			               |ИЗ
			               |	Справочник.скEDI_Подписи КАК скEDI_Подписи
			               |ГДЕ
			               |	скEDI_Подписи.Ссылка <> &Ссылка
			               |	И скEDI_Подписи.Владелец = &Владелец
			               |	И скEDI_Подписи.ОсновнаяПодписьШифрования";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("Владелец", Владелец);
			ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
			Пока ВыборкаРезультатаЗапроса.Следующий() Цикл
				ОрганизацияОбъект = ВыборкаРезультатаЗапроса.Ссылка.ПолучитьОбъект();
				ОрганизацияОбъект.ОсновнаяПодписьШифрования = Ложь;
				ОрганизацияОбъект.Записать();
			КонецЦикла;
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	//Отказ = Не МонопольныйРежим();
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ИспользованиеКлюча = Перечисления.скEDI_ИспользованиеКлючей.Шифрование Тогда
	Иначе
		ОсновнаяПодписьШифрования = Ложь;
		Для Каждого Сертификат Из Сертификаты Цикл
			Сертификат.ИспользоватьПриПриемеМассивомСертификатов = Ложь;
		КонецЦикла;
	КонецЕсли; 
КонецПроцедуры
