#Область ПрограммныйИнтерфейс

// Проверяет текущую конфигурацию.
//
//  Возвращаемое значение:
//      Булево - Истина, если конфигурация "БухгалтерияСельскохозяйственногоПредприятия" 
//
Функция ЕстьБСПУ() Экспорт
		
	Если    Метаданные.Имя = "BASАгроБухгалтерия"
		ИЛИ Метаданные.Имя = "КомплексноеРешениеСельскохозяйственногоПредприятия" Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

// Проверяет текущую конфигурацию.
//
//  Возвращаемое значение:
//      Булево - Истина, если конфигурация "BASБухгалтерияЭлеватораМельницыИКомбикормовогоЗавода" 
// 
Функция ЕстьБЭМКЗУ() Экспорт
		
	Если    Метаданные.Имя = "BASБухгалтерияЭлеватораМельницыИКомбикормовогоЗавода"
		ИЛИ Метаданные.Имя = "КомплексноеРешениеСельскохозяйственногоПредприятия" Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

#КонецОбласти
