
#Область ПрограммныйИнтерфейс

// Функция возвращает объект обработчика драйвера по его наименованию
//
Функция ПолучитьОбработчикаДрайвера(ОбработчикДрайвера) Экспорт
	
	Возврат ИНАГРО_МенеджерОборудованияКлиентПереопределяемый.ПолучитьОбработчикаДрайвера(ОбработчикДрайвера);
	
КонецФункции

// Функция возвращает список подключенного в справочнике ПО
//
Функция ПолучитьСписокОборудования(ТипыПО = Неопределено, Идентификатор = Неопределено, РабочееМесто = Неопределено) Экспорт

	Возврат ИНАГРО_МенеджерОборудованияВызовСервера.ПолучитьСписокОборудования(ТипыПО, Идентификатор, РабочееМесто);

КонецФункции

// Возвращает структуру параметров конкретного экземпляра устройства
// При первом обращении получает из БД сохраненные ранее параметры.
Функция ПолучитьПараметрыУстройства(Идентификатор) Экспорт

	Возврат ИНАГРО_МенеджерОборудованияВызовСервера.ПолучитьПараметрыУстройства(Идентификатор);

КонецФункции

// Функция возвращает структуру с данными устройства
// (со значениями реквизитов элемента справочника)
Функция ПолучитьДанныеУстройства(Идентификатор) Экспорт

	Возврат ИНАГРО_МенеджерОборудованияВызовСервера.ПолучитьДанныеУстройства(Идентификатор);

КонецФункции

// Возвращает имя формы настройки обработчика драйвера
// При первом обращении возвращает сформированное на сервере имя
Функция ПолучитьИмяФормыНастройкиПараметров(НаименованиеОбработчикаДрайвера) Экспорт

	НаименованиеФормыНастройки = 
	    СтрЗаменить(ИНАГРО_МенеджерОборудованияВызовСервера.ПолучитьИмяДрайвераЭкземпляра(НаименованиеОбработчикаДрайвера),
	                "Обработчик",
	                "ИНАГРО_ФормаНастройки");

	Возврат НаименованиеФормыНастройки;

КонецФункции

// Возвращает имя компьютера клиента
// При первом обращении получает имя компьютера из переменной сеанса
Функция ПолучитьРабочееМестоКлиента() Экспорт

	Возврат ИНАГРО_МенеджерОборудованияВызовСервера.ПолучитьРабочееМестоКлиента();

КонецФункции

// Возвращает имя компьютера клиента
// При первом обращении получает имя компьютера из переменной сеанса
Функция НайтиРабочиеМестаПоИД(ИдентификаторКлиента) Экспорт

	Возврат ИНАГРО_МенеджерОборудованияВызовСервера.НайтиРабочиеМестаПоИД(ИдентификаторКлиента);

КонецФункции

// Возвращает макет слип чека по наименованию макета
//
Функция ПолучитьСлипЧек(ИмяМакета, ШиринаСлипЧека, Параметры, АвторизацияПИН = Ложь) Экспорт

	Возврат ИНАГРО_МенеджерОборудованияВызовСервера.ПолучитьСлипЧек(ИмяМакета, ШиринаСлипЧека, Параметры, АвторизацияПИН);

КонецФункции

// Функция возвращает имя перечисления из его метаданных
//
Функция ПолучитьИмяТипаОборудования(ТипОборудования) Экспорт

	Возврат ИНАГРО_МенеджерОборудованияВызовСервера.ПолучитьИмяТипаОборудования(ТипОборудования);

КонецФункции

// Возвращает Истина, если клиентское приложение запущено под управлением ОС Linux.
//
Функция ЭтоLinuxКлиент() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	ЭтоLinuxКлиент = СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86
	             ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
	Возврат ЭтоLinuxКлиент;
	
КонецФункции

#КонецОбласти