#Область СМС_ОбменДаннымиСчетаРасходные_ПоОрганизации

Процедура ОбменДаннымиОбмен_СчетаРасходные_ПоОрганизацииПередУдалением(Источник, Отказ) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("СМС_Обмен_СчетаРасходные_ПоОрганизации", Источник, Отказ);
КонецПроцедуры

Процедура ОбменДаннымиДаннымиОбмен_СчетаРасходные_ПоОрганизацииПередЗаписьюДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента("СМС_Обмен_СчетаРасходные_ПоОрганизации", Источник, Отказ, РежимЗаписи, РежимПроведения);
КонецПроцедуры

#КонецОбласти

#Область СМС_Обмен_FlyDoc
// DIN  06.05.22 #951
Процедура ОбменДаннымиОбмен_FlyDoc_Документы_ПриЗаписи(Источник, Отказ) Экспорт
	
	Источник.ДополнительныеСвойства.Вставить("ОтложеннаяЗапись", Истина);	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("СМС_Обмен_FlyDoc", Источник, Отказ);

КонецПроцедуры

Процедура ОбменДаннымиОбмен_FlyDoc_Документы_ПередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("СМС_Обмен_FlyDoc", Источник, Отказ);

КонецПроцедуры
// DIN  06.05.22 #951

#КонецОбласти