#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
						
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Ввод новых документов ""Сторнирование"" запрещен. Для ввода корректирующих записей в регистры используйте документ ""Операция (БУ и НУ)""!';uk='Введення нових документів ""Сторнування"" заборонене. Для введення коригуючих записів в регістри використовуйте документ ""Операція (БО і ПО)""!'");
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
			
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
