

Процедура ЗаполнитьКарточкуКлиента(СтруктураИнформацииДляЗаполнения) Экспорт
	
	
	СтруктураПроверкиОпендатабот = ОпендатаботЗаполнениеКонтрагентаСервер.ПолучитьСтруктуруОпендатаботДляЗаполненияКонтрагента(СокрЛП(СтруктураИнформацииДляЗаполнения.СтрокаПоиска),СтруктураИнформацииДляЗаполнения.Контрагент);
	
	Если СтруктураПроверкиОпендатабот.РезультатПроверки = Ложь Тогда
		Возврат;
	КонецЕсли;
	
	Контрагенты = СтруктураПроверкиОпендатабот.Контрагенты;
	
	Если Не Контрагенты.Количество() = 0 Тогда
		
		ТекстВопроса=НСтр("ru='Контрагент найден в базе. Открыть существующие карточки или заполнить данные в текущей карточке?';uk= 'Контрагента знайдено в базі. Відкрити існуючі картки чи заповнини дані відкритої картки?'");	
		спКнопки=Новый СписокЗначений;
		спКнопки.Добавить(НСтр("ru='Открыть';uk='Відкрити'"));
		Если СтруктураИнформацииДляЗаполнения.Контрагент = Неопределено Тогда
			спКнопки.Добавить(НСтр("ru='Создать контрагента';uk='Створити контрагента'"));
		Иначе
			спКнопки.Добавить(НСтр("ru='Заполнить';uk='Заповнити'"));
		КонецЕсли;
		спКнопки.Добавить(НСтр("ru='Отменить';uk='Відмінити'"));
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("Контрагенты",Контрагенты);
		ДополнительныеПараметры.Вставить("СтруктураИнформацииДляЗаполнения",СтруктураИнформацииДляЗаполнения);
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОпендатаботВопросНаОткрытиеКарточки",ЭтотОбъект,ДополнительныеПараметры), ТекстВопроса, спКнопки);
	Иначе

		ПолучитьИнформациюПоКонтрагенту(СтруктураИнформацииДляЗаполнения);
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПолучитьИнформациюПоКонтрагенту(СтруктураИнформацииДляЗаполнения)
	
	ОпендатаботЗаполнениеКонтрагентаСервер.ПолучитьИнформациюПоКонтрагенту(СтруктураИнформацииДляЗаполнения);
	
КонецПроцедуры

Функция ЗаписатьДанныеВКарточкуКонтрагентаНаСервере(СтруктураИнформацииДляЗаполнения) Экспорт
	
	РезультатЗаполнения = ОпендатаботЗаполнениеКонтрагентаСерверПереопределяемый.ЗаписатьДанныеВКарточкуКонтрагента(СтруктураИнформацииДляЗаполнения);
	Возврат РезультатЗаполнения;
	
КонецФункции

Процедура ОпендатаботВопросНаОткрытиеКарточки(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Контрагенты = ДополнительныеПараметры.Контрагенты;
	
   	Если РезультатВопроса = НСтр("ru='Открыть';uk='Відкрити'") Тогда
		ПоместитьВоВременноеХранилище(Истина, ДополнительныеПараметры.СтруктураИнформацииДляЗаполнения.АдресРезультата);
		Для Каждого СсылкаКонтрагент Из Контрагенты Цикл
    		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", СсылкаКонтрагент));
		КонецЦикла;
	ИначеЕсли РезультатВопроса = НСтр("ru='Заполнить';uk='Заповнити'")
		Или РезультатВопроса = НСтр("ru='Создать контрагента';uk='Створити контрагента'") Тогда
		ПолучитьИнформациюПоКонтрагенту(ДополнительныеПараметры.СтруктураИнформацииДляЗаполнения);
	Иначе
		ПоместитьВоВременноеХранилище(Ложь, ДополнительныеПараметры.СтруктураИнформацииДляЗаполнения.АдресРезультата);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбновитьФормуКарточкиКлиента(ТекущаяФорма,Контрагент) Экспорт
	
	ТекущаяФорма.Модифицированность = Ложь;
	ТекущаяФорма.Закрыть();
	Оповестить("Опендатабот.ИзменениеКонтрагента", Контрагент);
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", Контрагент));
	
Конецпроцедуры
