#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаписьУчетнойПолитики = ЭтотОбъект[0];

	Если ДанныеЗаполнения = Неопределено
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура")  Тогда
		РегистрыСведений.ИНАГРО_УчетнаяПолитика.УстановкаПараметровУчетнойПолитикиПоУмолчанию(
			ЗаписьУчетнойПолитики,
			?(ДанныеЗаполнения = Неопределено, Новый Структура, ДанныеЗаполнения));
	КонецЕсли;

	РегистрыСведений.ИНАГРО_УчетнаяПолитика.УстановкаПараметровУчетнойПолитикиПоУмолчаниюНаПериод(ЗаписьУчетнойПолитики);

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли