
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("ИдентификаторФоновогоЗадания") Тогда
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Параметры.ИдентификаторФоновогоЗадания));
		
		Если ФоновоеЗадание <> Неопределено Тогда 
			
			ЗаполнитьЗначенияСвойств(
			ЭтаФорма ,
			ФоновоеЗадание,
			"Ключ,
			|Наименование,
			|Начало,
			|Конец,
			|Расположение,
			|Состояние,
			|ИмяМетода");
			
			ЭтаФорма.Идентификатор = Параметры.ИдентификаторФоновогоЗадания; 
			
			Если ФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда 
				СообщенияПользователюИОписаниеИнформацииОбОшибке = ФоновоеЗадание.ИнформацияОбОшибке.Описание;
			КонецЕсли;
			
			МассивСообщений = ФоновоеЗадание.ПолучитьСообщенияПользователю();
			
			Для Каждого Сообщение Из МассивСообщений Цикл 
				Если ЗначениеЗаполнено(Сообщение.Текст) Тогда 
					СообщенияПользователюИОписаниеИнформацииОбОшибке = СообщенияПользователюИОписаниеИнформацииОбОшибке
					+ ?(ЗначениеЗаполнено(СообщенияПользователюИОписаниеИнформацииОбОшибке), Символы.ПС,"")
					+ Сообщение.Текст;
				КонецЕсли;	
			КонецЦикла;	
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры
