#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГиперссылкаДополнительноНДФЛНажатие(Элемент)
	ПараметрыФормы = Новый Структура("Вид", "НДФЛ");
	ФормаДополнительныхДанных = ОткрытьФорму("РегистрСведений.ИНАГРО_УчетнаяПолитикаПоПерсоналу.Форма.ФормаДополнительныхДанных", ПараметрыФормы);	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаНормативныеВеличиныНажатие(Элемент)
	ПараметрыФормы = Новый Структура("Вид", "Нормативные");
	ФормаДополнительныхДанных = ОткрытьФорму("РегистрСведений.ИНАГРО_УчетнаяПолитикаПоПерсоналу.Форма.ФормаДополнительныхДанных", ПараметрыФормы);	
КонецПроцедуры

&НаКлиенте
Процедура ГиперссылкаДополнительноСтраховыеВзносыНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура("Вид", "СтраховыеВзносы");
	ФормаДополнительныхДанных = ОткрытьФорму("РегистрСведений.ИНАГРО_УчетнаяПолитикаПоПерсоналу.Форма.ФормаДополнительныхДанных", ПараметрыФормы);	
	
КонецПроцедуры

#КонецОбласти