
Процедура ПередЗаписью(Отказ, Замещение)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Запись ИЗ ЭтотОбъект Цикл
		Если Запись.ВерсияШаблона <> "" Тогда
			Если Запись.ЕДРПОУВладельцаШаблона = "" Тогда
				ТекстСообщения = НСтр("ru='Для шаблона';uk='Для шаблону'") + " """ + Запись.ИмяШаблона + """ " + НСтр("ru='Не указан ЕДРПОУ Владельца';uk='Не вказано ЄДРПОУ Власника'");
				Сообщить(ТекстСообщения, СтатусСообщения.Важное);
				Отказ = Истина;
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
