// Процедура выполняет общие действия при измененнии контрагента
//
//  Параметры:
//      Дата                - Дата
//  	ОрганизацияДоговора - СправочникСсылка.Организации
//  	ВладелецДоговора    - СправочникСсылка.Контрагенты
//  	ДоговорКонтрагента  - СправочникСсылка.ДоговорыКонтрагентов
//      СтруктураПараметров - Структура - структура дополнительных параметров
//
Процедура ПриИзмененииЗначенияКонтрагента(Дата, ОрганизацияДоговора, ВладелецДоговора, ДоговорКонтрагента, СтруктураПараметров = Неопределено) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ЭлеваторЗаполнениеДокументовСервер");
	Если Обр <> Неопределено Тогда
		Обр.ПриИзмененииЗначенияКонтрагента(Дата, ОрганизацияДоговора, ВладелецДоговора, ДоговорКонтрагента, СтруктураПараметров);
	КонецЕсли;
КонецПроцедуры

// Заполняет тип номер журнала весовой
//
//  Параметры:
//  	Объект - ДокументОбъект, ДанныеФормыСтруктура
//
Процедура ЗаполнитьТипНомерЖурналаВесовой(Объект) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ЭлеваторЗаполнениеДокументовСервер");
	Если Обр <> Неопределено Тогда
		Обр.ЗаполнитьТипНомерЖурналаВесовой(Объект);
	КонецЕсли;
КонецПроцедуры

// Возвращает параметры видов документов
//
//	Параметры:
//  	ИмяРеквизита
//		ЗначениеРеквизита
//
//	Возвращаемое значение:
//
//
Функция ПолучитьПараметрыВидовДокументов(ИмяРеквизита, ЗначениеРеквизита) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ЭлеваторЗаполнениеДокументовСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ПолучитьПараметрыВидовДокументов(ИмяРеквизита, ЗначениеРеквизита);
	КонецЕсли;
КонецФункции

// Не используется
// Функция для получения договоров контрагентов при жёстком контроле
// ДокументОбъект
// Организация
// Контрагент
// номенклатура.
Функция ПолучитьДоговорПоОрганизацииИКонтрагентуИзРегистра(ДокументОбъект,Организация, Контрагент,номенклатура=Неопределено) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ЭлеваторЗаполнениеДокументовСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ПолучитьДоговорПоОрганизацииИКонтрагентуИзРегистра(ДокументОбъект, Организация, Контрагент, номенклатура);
	КонецЕсли;
КонецФункции

