////////////////////////////////////////////////////////////////////////////////
// Подсистема "Даты запрета изменения".
// Настройка переопределяемого модуля в конфигурации "Демо: БСП".
// 
// Реализация процедур и функций модуля ДатыЗапретаИзмененияПереопределяемый
// для поддержки библиотечного подхода разработки.
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

// Вызывается из переопределяемого модуля
Процедура НастройкаИнтерфейса(Знач НастройкиРаботыИнтерфейса) Экспорт
	
	НастройкиРаботыИнтерфейса.ИспользоватьВнешнихПользователей = Ложь;
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АвансовыйОтчет"                                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктОбОказанииПроизводственныхУслуг"                              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АктСверкиВзаиморасчетов"                                         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводВЭксплуатациюОС"                                             , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводНачальныхОстатков"                                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратТоваровОтПокупателя"                                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратТоваровПоставщику"                                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыработкаНМА"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыработкаОС"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ГТДИмпорт"                                                  		, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Доверенность"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ДокументРасчетовСКонтрагентом"                                   , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗакрытиеМесяца"                                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ЗаявкаНаПокупкуПродажуВалюты"                                    , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеГрафиковАмортизацииОС"                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеНалоговогоНазначенияЗапасов"                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеНалоговогоНазначенияОС"                                 , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеНалоговогоНазначенияТЗР"                                , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПараметровНачисленияАмортизацииНМА"                     , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПараметровНачисленияАмортизацииОС"                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеСостоянияОС"                                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА"              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС"               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияНЗП"                                               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияНМА"                                               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияОС"                                                , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияРасчетовСКонтрагентами"                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияТоваровНаСкладе"                                   , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИндексацияОС"                                                	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КомплектацияНоменклатуры"                                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаДолга"                                              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаЗаписейРегистров"                                   , "Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаОжидаемогоИПодтвержденногоНДС"                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаОстатковНКУна01042011"                              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МодернизацияНМА"                                                 , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МодернизацияОС"                                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НалоговаяНакладная"                                              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.НормированиеРасходовПоНалогуНаПрибыль"                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОперацияБух"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОпределениеФинансовыхРезультатов"                                , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОприходованиеТоваров"                                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтражениеВзаиморасчетовСКонтрагентамиВ1ДФ"                       , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетКомиссионераОПродажах"                                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетКомитентуОПродажах"                                         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетОРозничныхПродажах"                                         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ОтчетПроизводстваЗаСмену"                                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Партия"                                                  		, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПартияМалоценныхАктивовВЭксплуатации"                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаМалоценныхАктивовВЭксплуатацию"                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаНМА"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаОборудованияВМонтаж"                                     , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаОС"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаТоваров"                                                 , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеМалоценныхАктивовВЭксплуатации"                       , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеНМА"                                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеОС"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеТоваров"                                              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаОС"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаТоваровВРознице"                                       , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПерерасчетПропорциональногоНДСпоТоварамИОС"                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПлатежноеПоручение"                                              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПлатежныйОрдерПоступлениеДенежныхСредств"                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПлатежныйОрдерСписаниеДенежныхСредств"                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПодготовкаКПередачеОС"                                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПокупкаПродажаВалюты"                                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеДопРасходов"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеИзПереработки"                                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеНаРасчетныйСчет"                                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеНМА"                                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеТоваровУслуг"                                         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Приложение1КНалоговойНакладной"                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.Приложение2КНалоговойНакладной"                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПринятиеКУчетуНМА"                                               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПриходныйКассовыйОрдер"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасходныйКассовыйОрдер"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасчетКоэффициентовДляЗаполненияПриложенияСВДекларацииПоПрибыли" , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РасчетыПоНалогуНаПрибыль"                                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеализацияТоваровУслуг"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РеализацияУслугПоПереработке"                                    , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияАвансовВНалоговомУчете"                               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияВходящегоНалоговогоДокумента"                         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегистрацияСтоимостиПриобретенияОСПропорциональноОблагаемыхНДС"  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеМалоценныхАктивовИзЭксплуатации"                         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеНМА"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеОС"                                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеСРасчетногоСчета"                                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеТоваров"                                                 , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетНаОплатуПокупателю"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СчетНаОплатуПоставщика"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ТребованиеНакладная"                                             , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УдалитьВводНачальныхОстатковМалоценныхАктивовВЭксплуатации"      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УдалитьВводНачальныхОстатковОС"                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВводСведенийОБанковскихКарточкахРаботников"               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УдалитьРемонтОС"                                                 , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаГарантийныхСроковНалоговыйУчет"                         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаКоэффициентаПропорциональногоОтнесенияНДСНаКредит"      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаПорядкаЗакрытияПодразделений"                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УстановкаЦенНоменклатуры"                                        , "Дата" , "БухгалтерскийУчет", "");

	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрБухгалтерии.Хозрасчетный"                                          , "Период", "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ВыпускПродукцииУслугБухгалтерскийУчет"                  , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ВыработкаНМА"                                         	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ВыработкаОС"                                         	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.КнигаДоходовРасходовПоЕдиномуНалогу"                    , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.КорректировкиНалоговыхНазначенийТЗР"                    , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НДСНалоговыеОбязательства"                              , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.НДСНалоговыйКредит"                                     , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПриобретений"                , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ОжидаемыйИПодтвержденныйНДСПродаж"                      , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПереоценкаОСБухгалтерскийУчет"                          , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПриобретенияНалоговыйУчет"                              , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиВРазрезеГарантийныхСроковНалоговыйУчет"          , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ПродажиНалоговыйУчет"                                   , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РеализацияУслуг"                                        , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РеализованныеТоварыКомитентов"                          , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.РозничныеПродажиПодакцизныхТоваров"						, "Период" , "БухгалтерскийУчет", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.СтоимостьПриобретенияОСПропорциональноОблагаемыхНДС"    , "Период" , "БухгалтерскийУчет", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ВстречныйВыпускПродукцииУслуг"                            , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ГарантийныеСрокиНалоговыйУчет"                            , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет"                    , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КодыОрганизации"                                          , "Период" , "БухгалтерскийУчет", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КурсыВалют"                                               , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КоэффициентыДляЗаполнениПриложенияСВДекларацииПоПрибыли"  , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.КоэффициентыПропорциональногоОтнесенияНДСНаКредит"        , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МестонахождениеНМАБухгалтерскийУчет"                      , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МестонахождениеОСБухгалтерскийУчет"                       , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций"          , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НалоговыеНазначенияОС"                                    , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НастройкаНумерацииНалоговыхДокументов"                    , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НастройкаПечатиНалоговыхДокументов"                    	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НастройкиПечатиКассовойКниги"                    			, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет"                 , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет"                     , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НеоблагаемыйМинимум"					                    , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.НоминальнаяСтоимостьБланковСтрогогоУчета"					, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ОтветственныеЛица"                                        , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ОтветственныеЛицаКонтрагентов"                            , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ОтветственныеЛицаОрганизаций"                             , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет"                  , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет"                      , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПараметрыНалоговогоУчета"                            		, "Период" , "БухгалтерскийУчет", "");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет"               , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет"                   , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет"                , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет"                    , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПоказателиПриНормальнойМощности"                  		, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций"                  , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ПоследниеНомераЛистовКассовойКниги"                  		, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СобытияОСОрганизаций"                                     , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СостоянияНМАОрганизаций"                                  , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет", "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет" , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СтавкиНалогаНаПрибыль" 									, "Период" , "БухгалтерскийУчет", "Организация");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СхемыНалогообложенияКонтрагентов" 						, "Период" , "БухгалтерскийУчет", "");                // ИНАГРО. Для Пактума.Убираем РС из подписки ПроверитьДатуЗапретаИзмененияПередЗаписьюНабораЗаписей
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СчетаБухгалтерскогоУчетаНМА"                              , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.СчетаБухгалтерскогоУчетаОС"                               , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.УчетнаяПолитикаОрганизаций"                               , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ЦеныНоменклатуры"                                         , "Период" , "БухгалтерскийУчет", "");
	
	
КонецПроцедуры

// Вызывается из переопределяемого модуля
Процедура ПередПроверкойЗапретаИзменения(Объект, СтандартнаяОбработка, УзелПланаОбмена, ВерсияОбъекта) Экспорт	
	
	
КонецПроцедуры


// Возвращает ссылку на раздел даты запрета редактирования "Бухгалтерский учет".
//
Функция РазделБухгалтерскийУчет() Экспорт
	
	РазделыДатЗапретаИзменения = ПланыВидовХарактеристик.РазделыДатЗапретаИзменения.СвойстваРазделовДатЗапрета();
	РазделБухгалтерскийУчет = РазделыДатЗапретаИзменения.Разделы.Получить("БухгалтерскийУчет");
	Возврат РазделБухгалтерскийУчет;
	
КонецФункции

// Вызывается из переопределяемого модуля
Процедура ИНАГРО_ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(Знач ИсточникиДанных) Экспорт // ИНАГРО
	
	// Данные(Таблица, ПолеДаты, Раздел, ПолеОбъекта)
	
	Если ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБСПУ() Тогда
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АвансовыйОтчет"                                           , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктПереоценкиБиологическихАктивов"                        , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктПриемаПередачи"                                        , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВедомостьВыплатПайщикам"                                  , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВедомостьРеализацияБиологическихАктивов"                  , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВозвратБиологическихАктивовОтПокупателя"                  , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВозвратБиологическихАктивовПоставщику"                    , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ГТДИмпортБиологическихАктивов"                            , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Забой"                                 					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ЗакладкаВИнкубаторий"                                		, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИнвентаризацияАрендованныхБА"                             , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИнвентаризацияБА"                                         , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИсполнительныйЛистКонтрагента"                            , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_КорректировкаСтоимостиБиологическихАктивов"               , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ЛимитноЗаборнаяКарта"                                     , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_НачислениеДругихВыплат"                     				, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_НачислениеПоПаям"                                         , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОприходованиеБиологическихАктивов"                        , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОприходованиеНезавершенкиРастениеводства"                 , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОтражениеОтходовРастениеводства"                          , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОтчетОВыходеИнкубатория"                                  , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПередачаПая"                            					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПеремещениеБиологическихАктивов"                          , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПоступлениеБиологическихАктивов"                          , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПриплодИПривес"                       					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РасчетКормодней"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РеализацияБиологическихАктивов"                           , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РегистрацияНадояМолока"                                   , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СписаниеБиологическихАктивов"                             , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СправкаОДоходахПайщика"                                   , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СчетНаОплатуПокупателюБиологическихАктивов"               , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СчетНаОплатуПоставщикаБиологическихАктивов"               , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_УстановкаЦенБиологическихАктивов"                         , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_УчетАрендованныхБА"                                       , "Дата" , "БухгалтерскийУчет", "Организация");
	КонецЕсли;
	
	Если ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБЭМКЗУ() Тогда
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктЗачистки"                                           	, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктРаспределения"                        					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктРасчет310"                                        		, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктСписания"                                  			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктУничтоженияНегодныхОтходов"                  			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АктФасовки"                  								, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВедомостьОтвесов"                    						, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Взвешивание"                            					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Инвентаризация"                                 			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Корректировка"                                			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_КорректировкаСписком"                             		, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_КорректировкаУслуг"                                       , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ЛабораторныйАнализ"                            			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_НаблюдениеСостоянияЗерна"               					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОперативныеДвижения"               					    , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОтражениеВвозаВывозаСобственногоЗернаВРегламентированномУчете", "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Перемещение"                                     			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Переоформление"                     						, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Переработка"                                         		, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПриказНаВывоз"                        					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПриказНаПеремещение"                 						, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПриходИзПроизводства"                          			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РасчетУслуг"                                  			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РасчетУслугХранения"                            			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РасчетыСВладельцем"                          				, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РеестрТТНВвоз"                          					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РеестрТТНВвозЖД"                       					, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РеестрТТНВнутр"                           				, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РеестрТТНВывоз"                                  			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РеестрТТНВывозЖД"                             			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Рецепт"                                   				, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СвидетельствоОКачествеЗерна"               				, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СкладскаяКвитанция"               						, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СкладскаяКвитанцияДвойная"                         		, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СкладскаяКвитанцияПростая"                                , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ТТНВвоз"               									, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ТТНВвозЖД"                                       			, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ТТНВнутр"               									, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ТТНВывоз"               									, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ТТНВывозЖД"               								, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_УстановкаПараметровВидовКультур"                         	, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_УстановкаЦенНаУслуги"                                     , "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Форма117"                         						, "Дата" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Форма34Сводная"                                       	, "Дата" , "БухгалтерскийУчет", "Организация");
	КонецЕсли;

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_АрхивЗарплаты"                                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_БригадныйНаряд"                                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВводНачальныхОстатковТоплива"                             , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВводСведенийДляРасчетаСтраховогоСтажа"               		, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВводСведенийОБанковскихКарточкахРаботников"               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВводСведенийОПлановыхНачисленияхУдержаниях"               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВедомостьРеализация"                                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ВозвратНаРаботуОрганизаций"                               , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ДоговорНаВыполнениеРаботСФизЛицом"                        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ЗаменыРаботниковОрганизаций"                     			, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ЗарплатаКВыплатеОрганизаций"                      		, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ЗаявлениеРасчетВФСС"                                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИзменениеПараметровРасчетаИндексацииПоДолжностям"         , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИзменениеШтатногоРасписанияОрганизаций"               	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИнвентаризацияАрендованныхОС"                             , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИнвентаризацияМЦ"                            				, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИнвентаризацияОС"                                   		, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ИсполнительныйЛист"                                       , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_КадровоеПеремещениеОрганизаций"                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_КонвертацияВалюты"                                   		, "Дата" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_КорректировкаЗатрат"                      				, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_КорректировкаИспользованияРаботникамиРабочегоВремени"     , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_НачислениеЕдиновременныхПособийЗаСчетФСС"                 , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_НачислениеЗарплатыРаботникамОрганизаций"                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_НачислениеОтпускаРаботникамОрганизаций"                   , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_НачислениеПоБольничномуЛисту"                             , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РегистрацияПростояРаботниковОрганизаций"                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОплатаПоСреднемуЗаработку"                       			, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОплатаПраздничныхИВыходныхДнейОрганизаций"                , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ОтсутствиеНаРаботеОрганизаций"                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПередачаТоплива"                          				, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПланПосева"                                     			, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПодтверждениеВыплатФСС"                                  	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПриемНаРаботуВОрганизацию"                                , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПриходныйОрдерНаТовары"                                   , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПрочиеЗатраты"                                            , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля"                           , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ПутевойЛистТрактористаМашиниста"                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РаспределениеЗатрат"                                      , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РасходныйОрдерНаТовары"                      				, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РасчетКорректировкиЦены"                        			, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РеализацияКоммунальныхУслуг"                              , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_РегистрацияРазовыхНачисленийРаботниковОрганизаций"        , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СдельныйНаряд"                                          	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СливТоплива"                                        		, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_СправкаОДоходах"                                          , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_Сторнирование"                                  			, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_ТабельУчетаРабочегоВремениОрганизации"                    , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_УвольнениеИзОрганизаций"                                  , "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_УстановкаПоказателейВТС" 									, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИНАГРО_УчетАрендованныхОС"                                    	, "Дата" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.УдалитьИНАГРО_ВводЛюбогоРасчета"                                 , "Дата" , "БухгалтерскийУчет", "Организация");
	
	Если ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБСПУ() Тогда
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ВыходИнкубатория"                    			, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ЖивотныеОрганизации"                             , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ЗакладкаВИнкубаторий"                            , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_Кормодни"                              			, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_НадоиМолока"                                   	, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_РастенияОрганизации"    							, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_СписанныеКорма"                                  , "Период" , "БухгалтерскийУчет", "Организация");
	КонецЕсли;
	
	Если ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБЭМКЗУ() Тогда
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ВыпускПродукции"                    				, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ДвиженияПоПереработке"                           , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ЗатратыНаПроизводство"                           , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ЗатратыОрганизацийНУ"                            , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_КонтрольВвозаСобственногоЗерна"                  , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_КонтрольВывозаСобственногоЗерна"    				, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_КонтрольОтраженияВвозаВывозаСобственногоЗернаВРегламентированномУчете", "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_КонтрольПриказовНаВывоз"                    		, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ОперативныеОстатки"                              , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_Остатки"                             			, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_Остатки_Сводная"                            		, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_РасчетныйВыпускПродукции"                        , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_РасчетыПоУслугам"                                , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_Форма36"    										, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_Форма36Сводная"                                  , "Период" , "БухгалтерскийУчет", "Организация");
	КонецЕсли;
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ВедомостьДвижений"                  				, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ВзаиморасчетыПоНачислениямЗаСчетФСС"             , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ВыполненныеТехнологическиеОперации"              , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ВыпускПродукцииОрганизации"                    	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ЗакупкиОрганизаций"                				, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ЗатратыНаВыпуск"                      			, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ЗатратыОрганизаций"                          	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_МатериалыСписанныеНаТранспорт"          			, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ПлановыеЗатратыНаВыпуск"                         , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_РабочееВремяРаботниковОрганизаций"               , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_РазницаКоличества"								, "Период" , "БухгалтерскийУчет", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_РеализацияОрганизаций"                           , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ТоварыНаСкладах"                          		, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ИНАГРО_ТопливоВТС"										, "Период" , "БухгалтерскийУчет", "Организация");	
	
	// Идентификаторы	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.УдалитьОжидаемыйИПодтвержденныйНДСПриобретений"         , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.УдалитьОжидаемыйИПодтвержденныйНДСПродаж"             	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.УдалитьПриобретенияНалоговыйУчет"              			, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.УдалитьПродажиНалоговыйУчет"                    		, "Период" , "БухгалтерскийУчет", "Организация");

	Если ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБСПУ() Тогда
		//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_НормативнаяОценкаЗемли"                            , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПродукцияДотационная"                            	, "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СоответствиеБАиОС"                   				, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СтавкиНалогаДля4гр"			                  	, "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ЦеныБиологическихАктивов"                          , "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПлановыеУдержанияКонтрагентов"                 	, "Период" , "БухгалтерскийУчет", "Организация");
	КонецЕсли;
	
	Если ИНАГРО_ОбщийВызовСервераПовтИсп.ЕстьБЭМКЗУ() Тогда
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ДанныеПоКачествуЗерна"                            	, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ДанныеПоКачествуПартийЗерна"                       , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ДополнительныеРеквизитыМестХранения"			    , "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ДополнительныеРеквизитыОрганизации"                , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ЗначенияБазисов"                          			, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ИсключенияКНеСписыватьОтходыСВладельцев"           , "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ИспользуемыеНомераПроб"                           	, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_КонтрольВеса"                   					, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_НастройкиФормированияРеестровТТН"                  , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПараметрыУчетаЭлеватора"                           , "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_РезультатыНаблюденияСостоянияЗерна"			    , "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СпособРасчетаЗачетногоВеса"                        , "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СформированныеДокументы"                           , "Период" , "БухгалтерскийУчет", "");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_Форма49"                   						, "Период" , "БухгалтерскийУчет", "Организация");
		ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ЦеныНаУслуги"			                  			, "Период" , "БухгалтерскийУчет", "Организация");
	КонецЕсли;
		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ВзносыВФондыПоГруппам"                            	, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ВзносыВФондыРаботниковОрганизаций"                 , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ВидыРаботАвтотранспорта"                    		, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ВидыРаботРучнойТруд"                               , "Период" , "БухгалтерскийУчет", "Организация");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ВидыРаботСельхозтехники"                           , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ВидыРасчетовВзносовВФонды"  						, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ВоинскийУчет"  									, "Период" , "БухгалтерскийУчет", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_КоэффициентПовышенияОкладов"        				, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_НадбавкиПоШтатномуРасписаниюОрганизаций"           , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_НачальныеСведенияОСтажеРаботниковОрганизации"      , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПараметрыВыплатыЗПРаботников"                    	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПараметрыФиксированнойИндексации"                  , "Период" , "БухгалтерскийУчет", "Организация");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПлановыеНачисленияРаботниковОрганизаций"           , "Период" , "БухгалтерскийУчет", "Организация");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПлановыеУдержанияРаботниковОрганизаций"            , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПланПосева"					                    , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ПоказанияСпидометраИБака"							, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_РаботникиОрганизаций"                             	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_РазмерыЗаконодательноУстановленныхВыплат"          , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СведенияОВодителе"                      			, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_Сельхозтехника"                            		, "Период" , "БухгалтерскийУчет", "");	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СемейноеПоложениеФизЛиц"               			, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СоставКоммунальныхУслуг"                			, "Период" , "БухгалтерскийУчет", "");
	//ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СостояниеРаботниковОрганизаций"                    , "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СредняяЗППоВсемВидамЭкономическойДеятельности"     , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_СтруктураПлановойСебестоимости"                  	, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ТранспортныеСредства"                          	, "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_УчетнаяПолитика"                     				, "Период" , "БухгалтерскийУчет", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ШкалаВыслугиЛет"                                   , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ШкалаПочтовыхСборов"                               , "Период" , "БухгалтерскийУчет", "");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрСведений.ИНАГРО_ШтатноеРасписаниеОрганизаций"                      , "Период" , "БухгалтерскийУчет", "Организация");
	
КонецПроцедуры
