#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьТабличнуюЧасть(Параметры);
				
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоординатыПриИзменении(Элемент)
	
	Модифицированность = Истина;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьКоординаты(Команда)
	
	Если Модифицированность Тогда
		
		СтруктураВозврата = Новый Структура;
		СтруктураВозврата.Вставить("АдресКоординатыВХранилище", ПоместитьКоординатыВХранилище());	
		
		Оповестить("ВозвратКоординат", СтруктураВозврата, ЭтаФорма);
		
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьТабличнуюЧасть(Параметры)
	
	АдресКоординатыПосеваВХранилище = "";
	
	Параметры.Свойство("НомерРедактируемойСтроки",        НомерРедактируемойСтроки);
	Параметры.Свойство("АдресКоординатыПосеваВХранилище", АдресКоординатыПосеваВХранилище);
	
	Если АдресКоординатыПосеваВХранилище <> Неопределено Тогда  
		Таблица = ПолучитьИзВременногоХранилища(АдресКоординатыПосеваВХранилище);	
		ВходящаяТаблица.Загрузить(Таблица);
	КонецЕсли;

	Если ВходящаяТаблица.Количество() <> 0 Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТЗКоординаты.Широта,
			|	ТЗКоординаты.Долгота,
			|	ТЗКоординаты.НомерСтрокиПосева
			|
			|ПОМЕСТИТЬ ВТРезЗапроса
			|
			|ИЗ
			|	&ВходящаяТаблица КАК ТЗКоординаты
			|ГДЕ
			|	ТЗКоординаты.НомерСтрокиПосева = &НомерСтрокиПосева
			|";
		
		Запрос.УстановитьПараметр("НомерСтрокиПосева", НомерРедактируемойСтроки);
		Запрос.УстановитьПараметр("ВходящаяТаблица",   ВходящаяТаблица.Выгрузить());
		
		Запрос.Выполнить();
		
		Запрос.Текст = 
			"ВЫБРАТЬ  
			|	РЕзЗ.*
			|ИЗ 
			|	ВТРезЗапроса КАК РЕзЗ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			НовСтрока = Координаты.Добавить();			
			НовСтрока.Широта  = Выборка.Широта;
			НовСтрока.Долгота = Выборка.Долгота;
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПоместитьКоординатыВХранилище()

	ТаблицаКоординаты = Координаты.Выгрузить();

	Возврат ПоместитьВоВременноеХранилище(ТаблицаКоординаты, УникальныйИдентификатор);

КонецФункции

#КонецОбласти