#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СписокВыбора", СписокНоменклатуры);
	
	Номенклатура = СписокНоменклатуры.Получить(0).Значение;
	
	УстановитьПараметрыВыбораНоменклатуры();

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Номенклатура", Номенклатура);
		
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВыбораНоменклатуры()
	
	МассивНоменклатуры = Новый Массив;	
	
	Для Каждого Строка Из СписокНоменклатуры Цикл		
		МассивНоменклатуры.Добавить(Строка.Значение);
	КонецЦикла;
	
	ПараметрМассивНоменклатуры = Новый ПараметрВыбора("Отбор.Ссылка", МассивНоменклатуры);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(ПараметрМассивНоменклатуры);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.Номенклатура.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти
