
&НаСервере
Функция ПолучитьМакетСервер()
	Возврат ПолучитьОбщийМакет("скEDI_ИнформацияОВерсиях");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТаблицаДокументов.Очистить();
	МассивДокументов = Неопределено;
	Параметры.Свойство("МассивДокументов", МассивДокументов);
	Если ТипЗнч(МассивДокументов) = Тип("ФиксированныйМассив") Тогда
		Для Каждого ЭлементМассиваДокументов Из МассивДокументов Цикл
			НоваяСтрока = ТаблицаДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементМассиваДокументов);;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОбОбновленииВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Область.Текст = "Повторне затвердження" Тогда
		ОткрытьФорму("ОбщаяФорма.скEDI_ПовторноеУтверждение", , , Ложь);
	ИначеЕсли Область.Текст = "Повторное утверждение" Тогда
		ОткрытьФорму("ОбщаяФорма.скEDI_ПовторноеУтверждение", , , Ложь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере(РезультатыФункцииПечатьДокумента)
	ЕстьВложения = Ложь;
	ПечатнаяФорма.Очистить();
	ЭтоПерваяСтраница = Истина;
	СтрНачало = 1;
	ЕстьСтрокиКВыгрузке = Ложь;
	МассивДанныхДокументов = Новый Массив;
	Для Каждого СтрокаТаблицыДокументов Из ТаблицаДокументов Цикл
		ФормироватьСодержимое = Ложь;
		ИсккатьСодержимое = Ложь;
		Если ЗначениеЗаполнено(СтрокаТаблицыДокументов.ЭлектронныйДокумент) Тогда
			//Если СтрокаТаблицыДокументов.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") и ЗначениеЗаполнено(СтрокаТаблицыДокументов.Документ1С) Тогда
			Если СтрокаТаблицыДокументов.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан")
				и СтрокаТаблицыДокументов.ГдеСоздан = ПредопределенноеЗначение("Перечисление.скEDI_ГдеСоздан.ВДаннойИнформационнойБазе") Тогда
				ФормироватьСодержимое = Истина;
			Иначе
				ИсккатьСодержимое = Истина;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыДокументов.Документ1С) Тогда
			ФормироватьСодержимое = Истина;
		Иначе
			ИсккатьСодержимое = Истина;
		КонецЕсли;
		
		Если ФормироватьСодержимое Тогда
			СтруктураДанныхДокумента = Новый Структура;
			СтруктураДанныхДокумента.Вставить("Документ1С"                     , СтрокаТаблицыДокументов.Документ1С);
			СтруктураДанныхДокумента.Вставить("ЭлектронныйДокумент"            , СтрокаТаблицыДокументов.ЭлектронныйДокумент);
			СтруктураДанныхДокумента.Вставить("ВидЭлектронногоДокумента"       , СтрокаТаблицыДокументов.ВидЭлектронногоДокумента);
			СтруктураДанныхДокумента.Вставить("ВхИсх"                          , СтрокаТаблицыДокументов.ВхИсх);
			СтруктураДанныхДокумента.Вставить("ГдеСоздан"                      , СтрокаТаблицыДокументов.ГдеСоздан);
			СтруктураДанныхДокумента.Вставить("Состояние"                      , СтрокаТаблицыДокументов.Состояние);//ЭлектронногоДокумента);
			СтруктураДанныхДокумента.Вставить("СоответствиеЗначенийРеквизитов" , Неопределено);//Новый Соответствие);
			СтруктураДанныхДокумента.Вставить("ПараметрыСозданияДокументов"    , Неопределено);//Новый Структура);
			СтруктураДанныхДокумента.Вставить("ВидДокумента1С"                 , скEDI_НастройкиПодКонфигурацию.ПолучитьВидДокумента1С(СтрокаТаблицыДокументов.Документ1С));
			СтруктураДанныхДокумента.Вставить("Примечание"                     , "");//ПримечаниеЭлектронногоДокумента);
			
			СтруктураДанныхДокумента.Вставить("ТелоДокумента"        , "");
			СтруктураДанныхДокумента.Вставить("ИзображениеДокумента" , "");
			СтруктураДанныхДокумента.Вставить("ЕстьОшибки", Ложь);

			МассивДанныхДокументов.Добавить(СтруктураДанныхДокумента);
			ЕстьСтрокиКВыгрузке = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьСтрокиКВыгрузке Тогда
		Если РезультатыФункцииПечатьДокумента = Неопределено Тогда
			лПараметрыФормыНастройкиПодписейЭлектронныхДокументов = Неопределено;
		Иначе
			ФиксированноеСоответствиеДокументов = Новый ФиксированноеСоответствие(РезультатыФункцииПечатьДокумента);
			лПараметрыФормыНастройкиПодписейЭлектронныхДокументов = Новый Структура;
			лПараметрыФормыНастройкиПодписейЭлектронныхДокументов.Вставить("РезультатыФункцииПечатьДокумента", ФиксированноеСоответствиеДокументов);
		КонецЕсли;
		скEDI_ОбщегоНазначения.ВыгрузитьДокументВСоответствиеЗначенийВызовСервера(МассивДанныхДокументов, лПараметрыФормыНастройкиПодписейЭлектронныхДокументов);
	КонецЕсли;
	
	Для Каждого СтрокаТаблицыДокументов Из ТаблицаДокументов Цикл
		ФормироватьСодержимое = Ложь;
		ИсккатьСодержимое = Ложь;
		Если ЗначениеЗаполнено(СтрокаТаблицыДокументов.ЭлектронныйДокумент) Тогда
			//Если СтрокаТаблицыДокументов.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") и ЗначениеЗаполнено(СтрокаТаблицыДокументов.Документ1С) Тогда
			Если СтрокаТаблицыДокументов.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан")
				и СтрокаТаблицыДокументов.ГдеСоздан = ПредопределенноеЗначение("Перечисление.скEDI_ГдеСоздан.ВДаннойИнформационнойБазе") Тогда
				ФормироватьСодержимое = Истина;
			Иначе
				ИсккатьСодержимое = Истина;
			КонецЕсли;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТаблицыДокументов.Документ1С) Тогда
			ФормироватьСодержимое = Истина;
		Иначе
			ИсккатьСодержимое = Истина;
		КонецЕсли;
		
		ТелоДокумента = "";
		Если ИсккатьСодержимое Тогда
			СодержаниеЭлектронногоДокумента = скEDI_ОбщегоНазначения.ПолучитьПоследнееСодержаниеЭлектронногоДокумента(СтрокаТаблицыДокументов.ЭлектронныйДокумент);
		ИначеЕсли ФормироватьСодержимое Тогда
			Для Каждого ЭлементМассиваДанныхДокументов из МассивДанныхДокументов Цикл
				Если СтрокаТаблицыДокументов.ЭлектронныйДокумент = ЭлементМассиваДанныхДокументов.ЭлектронныйДокумент
					и СтрокаТаблицыДокументов.ВидЭлектронногоДокумента = ЭлементМассиваДанныхДокументов.ВидЭлектронногоДокумента
					и СтрокаТаблицыДокументов.Документ1С = ЭлементМассиваДанныхДокументов.Документ1С Тогда
					Если ЭлементМассиваДанныхДокументов.ЕстьОшибки = Ложь Тогда
						СодержаниеЭлектронногоДокумента = Новый Структура("Дата,ИмяФайла,НомерВерсии,ТелоДокумента,ИзображениеДокумента,ВложениеДокумента1,ИмяФайлаВложениеДокумента1,ВложениеДокумента2,ИмяФайлаВложениеДокумента2,ВложениеДокумента3,ИмяФайлаВложениеДокумента3,МассивВложенийДокумента4,ДокументДФС,ПолученоОтКонтрагента,ПолученоОтКонтрагентаСПомощью");
						СодержаниеЭлектронногоДокумента.Дата = ТекущаяДата();
						СодержаниеЭлектронногоДокумента.ИмяФайла =  "";
						СодержаниеЭлектронногоДокумента.НомерВерсии = -1;
						СодержаниеЭлектронногоДокумента.ТелоДокумента = ЭлементМассиваДанныхДокументов.ТелоДокумента;
						СодержаниеЭлектронногоДокумента.ИзображениеДокумента = ЭлементМассиваДанныхДокументов.ИзображениеДокумента;
						Замечание =  "";
						скEDI_ОбщегоНазначения.ПолучитьВложенияЭлектронногоДокумента(ЭлементМассиваДанныхДокументов.ЭлектронныйДокумент, СодержаниеЭлектронногоДокумента.ВложениеДокумента1, СодержаниеЭлектронногоДокумента.ИмяФайлаВложениеДокумента1, СодержаниеЭлектронногоДокумента.ВложениеДокумента2, СодержаниеЭлектронногоДокумента.ИмяФайлаВложениеДокумента2, СодержаниеЭлектронногоДокумента.ВложениеДокумента3, СодержаниеЭлектронногоДокумента.ИмяФайлаВложениеДокумента3, СодержаниеЭлектронногоДокумента.МассивВложенийДокумента4, Замечание);
						СодержаниеЭлектронногоДокумента.ДокументДФС = Ложь;
						СодержаниеЭлектронногоДокумента.ПолученоОтКонтрагента = Ложь;
						СодержаниеЭлектронногоДокумента.ПолученоОтКонтрагентаСПомощью = Ложь;
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Если ЗначениеЗаполнено(СодержаниеЭлектронногоДокумента) Тогда
			пОтображениеМассивКартинок = Неопределено;
			пДанныеДляОтображенияЭлектронногоДокументаСоответствие = Неопределено;
			скEDI_ОбщегоНазначения.ПолучитьСодержимоеПоЭлектронномуДокументу(СтрокаТаблицыДокументов.Организация, СтрокаТаблицыДокументов.ТипДокумента, СтрокаТаблицыДокументов.ЭлектронныйДокумент, СодержаниеЭлектронногоДокумента, Ложь, Истина, Истина, Неопределено, пОтображениеМассивКартинок, Неопределено, пДанныеДляОтображенияЭлектронногоДокументаСоответствие, "");

			Если ТипЗнч(пДанныеДляОтображенияЭлектронногоДокументаСоответствие) = Тип("Соответствие") Тогда
				КлючЭлементаСоответствия = 0;
				Пока Истина Цикл
					ДанныеДляОтображенияЭлектронногоДокумента = пДанныеДляОтображенияЭлектронногоДокументаСоответствие.Получить(КлючЭлементаСоответствия);
					Если ТипЗнч(ДанныеДляОтображенияЭлектронногоДокумента) = Тип("Структура") Тогда
						Если КлючЭлементаСоответствия >= 1 Тогда
							ЕстьВложения = Истина;
							Если не ОтображатьВложения Тогда
								Прервать;
							КонецЕсли;
						КонецЕсли;
						Если ДанныеДляОтображенияЭлектронногоДокумента.ЕстьКартинка Тогда
							пОтображениеМассивКартинок = ДанныеДляОтображенияЭлектронногоДокумента.ОтображениеМассивКартинок;
							пОтображениеМассивРазмеровКартинок = ДанныеДляОтображенияЭлектронногоДокумента.ОтображениеМассивРазмеровКартинок;
							скEDI_ОбщегоНазначения.ВывестиМассивКартинокPtnDrawНаПечатнуюФорму(пОтображениеМассивКартинок, пОтображениеМассивРазмеровКартинок, ПечатнаяФорма, ЭтоПерваяСтраница, СтрНачало);
						КонецЕсли;
						КлючЭлементаСоответствия = КлючЭлементаСоответствия + 1;
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаКлиенте()
	РезультатыФункцииПечатьДокумента = Неопределено;
	#Если ТолстыйКлиентОбычноеПриложение Тогда
		РезультатыФункцииПечатьДокумента = скEDI_НастройкиПодКонфигурациюКлиент.ПолучитьРезультатыФункцииПечатьДокумента(ТаблицаДокументов);
	#КонецЕсли
	ОбновитьНаСервере(РезультатыФункцииПечатьДокумента);
	Элементы.ФормаКомандаОтображатьВложениия.Доступность = ЕстьВложения;
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтображатьВложениия(Команда)
	ОтображатьВложения = Не ОтображатьВложения;
	Элементы.ФормаКомандаОтображатьВложениия.Пометка = ОтображатьВложения;
	ОбновитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНаКлиенте();
КонецПроцедуры
