
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеОтбора = Неопределено;
	Если НЕ Параметры.Свойство("ПолеОтбора", ПолеОтбора) Тогда
		Отказ = Истина;
		Возврат;		
	КонецЕсли;
	
	Если ПолеОтбора = "СверкаСУчетнымиДокументами" или ПолеОтбора = "СверкаСУчетнымиДокументамиДокументыНДС" Тогда
		СписокТекущий = Неопределено;
		Если Параметры.Свойство("СписокТекущий", СписокТекущий) Тогда
			Все = Ложь;
			Для Каждого СтрокаСписка из СписокТекущий Цикл
				Если СтрокаСписка.Значение = Неопределено Тогда
					Все = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			ДобавитьЗначениеВСписок("ПоСумме", Все, СписокТекущий, НСтр("ru = 'По сумме'; uk = 'По сумі'"));
			ДобавитьЗначениеВСписок("ПоДате", Все, СписокТекущий, НСтр("ru = 'По дате'; uk = 'По даті'"));
			ДобавитьЗначениеВСписок("ПоЕДРПОУ", Все, СписокТекущий, НСтр("ru = 'По ЕДРПОУ'; uk = 'По ЄДРПОУ'"));
			ДобавитьЗначениеВСписок("ПоКодуФилиала", Все, СписокТекущий, НСтр("ru = 'По коду филиала'; uk = 'По коду філії'"));
		Иначе
			Отказ = Истина;
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗначениеВСписок(Значение, ОтборПоВсем, СписокТекущий, Заголовок = "");
	Если ОтборПоВсем Тогда
		Отметка = Ложь;
	Иначе
		Отметка = СписокТекущий.НайтиПоЗначению(Значение) <> Неопределено;
	КонецЕсли;
	СписокДанныхДляВыбора.Добавить(Значение, Заголовок, Отметка);
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	СписокДляОтбора = Новый СписокЗначений;
	Если Все Тогда
		СписокДляОтбора.Добавить(Неопределено, НСтр("ru = 'Все'; uk = 'Всі'"));
	Иначе
		Для Каждого Элемент Из СписокДанныхДляВыбора Цикл
			Если Элемент.Пометка Тогда
				СписокДляОтбора.Добавить(Элемент.Значение, Элемент.Представление);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Закрыть(СписокДляОтбора);
КонецПроцедуры

&НаКлиенте
Процедура СписокДанныхДляВыбораПриИзменении(Элемент)
	ЕстьПомеченые = Ложь;
	НетНепомеченых = Истина;
	Для Каждого Элемент Из СписокДанныхДляВыбора Цикл
		Если Элемент.Пометка Тогда
			ЕстьПомеченые = Истина;
		Иначе
			НетНепомеченых = Ложь;
		КонецЕсли;
	КонецЦикла;
	Все = не ЕстьПомеченые;//НетНепомеченых или Не ЕстьПомеченые;
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора Цикл
		Элемент.Пометка = Истина;
	КонецЦикла;
	СписокДанныхДляВыбораПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеОтметки(Команда)
	Для Каждого Элемент Из СписокДанныхДляВыбора Цикл
		Элемент.Пометка = Ложь;
	КонецЦикла;
	СписокДанныхДляВыбораПриИзменении(Неопределено);
КонецПроцедуры
