#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособРаспределенияЗатратПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект   = Форма.Объект; 	

	ПропорциональноПрямойЗатрате = Объект.СпособРаспределенияЗатрат = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыРаспределенияЗатрат.ПропорциональноПрямойЗатрате");
	
	Элементы.СтатьиЗатрат.Доступность = ПропорциональноПрямойЗатрате;

КонецПроцедуры

#КонецОбласти