#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Корректировка списком
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Корректировка";
	КомандаПечати.Представление = НСтр("ru='Корректировка';uk='Коригування'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Корректировка""';uk='Реєстр документів ""Коригування""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры		

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета СчетЗаказа формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Корректировка") Тогда		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Корректировка", НСтр("ru='Корректировка';uk='Коригування'"), 
		ПечатьДокумента(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),, "Документ.ИНАГРО_Корректировкам.ПФ_MXL_Корректировка", ,Истина);
		
	КонецЕсли; 	

КонецПроцедуры

Функция ПечатьДокумента(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ЗапросШапка = Новый Запрос;	
	ЗапросШапка.Текст = 
		"ВЫБРАТЬ
		|	ИНАГРО_Корректировка.Организация КАК Организация,
		|	ИНАГРО_Корректировка.Номер КАК НомерДок,
		|	ИНАГРО_Корректировка.Дата КАК ДатаДок,
		|	ИНАГРО_Корректировка.Вес КАК Вес,
		|	ИНАГРО_Корректировка.ВесПоВлажности КАК ВесПоВлажности,
		|	ИНАГРО_Корректировка.ВесПоСорнойПримеси КАК ВесПоСорнойПримеси,
		|	ИНАГРО_Корректировка.ВидДвижения КАК ВидДвижения,
		|	ИНАГРО_Корректировка.ВидФасовки КАК ВидФасовки,
		|	ИНАГРО_Корректировка.ВидХранения КАК ВидХранения,
		|	ИНАГРО_Корректировка.ВидХранения1 КАК ВидХранения1,
		|	ИНАГРО_Корректировка.Владелец1 КАК Владелец1,
		|	ИНАГРО_Корректировка.Влажность КАК Влажность,
		|	ИНАГРО_Корректировка.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ИНАГРО_Корректировка.ДоговорКонтрагента1 КАК ДоговорКонтрагента1,
		|	ИНАГРО_Корректировка.Дополнительно КАК Дополнительно,
		|	ИНАГРО_Корректировка.ЗачетныйВес КАК ЗачетныйВес,
		|	ИНАГРО_Корректировка.ЗерноваяПримесь КАК ЗерноваяПримесь,
		|	ИНАГРО_Корректировка.Количество КАК Количество,
		|	ИНАГРО_Корректировка.Комментарий КАК Комментарий,
		|	ИНАГРО_Корректировка.Номенклатура КАК ТМЦ,
		|	ИНАГРО_Корректировка.НоменклатураНовая КАК ТМЦ1,
		|	ИНАГРО_Корректировка.Ответственный КАК Ответственный,
		|	ИНАГРО_Корректировка.Склад КАК Склад,
		|	ИНАГРО_Корректировка.Склад1 КАК Склад1,
		|	ИНАГРО_Корректировка.СорнаяПримесь КАК СорнаяПримесь,
		|	ИНАГРО_Корректировка.УбыльВесаПриСушке КАК УбыльВесаПриСушке,
		|	ИНАГРО_Корректировка.Урожай КАК Урожай,
		|	ИНАГРО_Корректировка.Урожай1 КАК Урожай1,
		|	ИНАГРО_Корректировка.Владелец.НаименованиеПолное КАК Владелец
		|ИЗ
		|	Документ.ИНАГРО_Корректировка КАК ИНАГРО_Корректировка
		|ГДЕ
		|	ИНАГРО_Корректировка.Ссылка = &Ссылка";			
		
	ТабДокумент = Новый ТабличныйДокумент;		
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_Корректировка_Корректировка"; 	
	
	ПервыйДокумент = Истина;  	
	
	Для каждого Ссылка Из МассивОбъектов Цикл	
		
		Макет = ПолучитьМакет("ПФ_MXL_Корректировка");
		
		КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
		Макет.КодЯзыкаМакета = КодЯзыкаПечать;		
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1; 	
		
		ЗапросШапка. УстановитьПараметр("Ссылка",Ссылка);
	
		
		Шапка = ЗапросШапка.Выполнить().Выбрать();
		Шапка.Следующий(); 	
				
		
		// Шапка
		ОбластьШапка = Макет.ПолучитьОбласть("Осн");
		ОбластьШапка.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьШапка);
		Ном = 1;
		
		Если Шапка.Дополнительно Тогда
			
			ОбластьДоп = Макет.ПолучитьОбласть("Доп");
			ОбластьДоп.Параметры.Владелец1 = Шапка.Владелец1.НаименованиеПолное;					
			ОбластьДоп.Параметры.ТМЦ1 = Шапка.ТМЦ1;
			ОбластьДоп.Параметры.ВидХранения1 = Шапка.ВидХранения1;
			ОбластьДоп.Параметры.Урожай1 = Шапка.Урожай1;
			ОбластьДоп.Параметры.Склад1 = Шапка.Склад1;
			ТабДокумент.Вывести(ОбластьДоп); 
			
		КонецЕсли; 
				
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
		НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции 

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецЕсли