
#Область СлужебныеПроцедурыИФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
    
    ДополнительныеПараметры = Новый Структура("ЦентнероПроцент,Граммы,ПодробныеХарактеристики");
    ЗаполнитьЗначенияСвойств(ДополнительныеПараметры,КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.ДополнительныеПараметры);
    Для каждого ЭлементНастроек Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
        Если ТипЗнч(ЭлементНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
            Если ЭлементНастроек.Значение.ДатаОкончания = Дата("00010101000000") Тогда
                ЭлементНастроек.Значение.ДатаОкончания = ТекущаяДата();      
            КонецЕсли; 
            Если ЭлементНастроек.Значение.ДатаНачала = Дата("00010101000000") Тогда
                ЭлементНастроек.Значение.ДатаНачала = Дата("00010102000000");
            КонецЕсли; 
    	    Прервать;
        КонецЕсли;
    КонецЦикла;
    
    Если НЕ КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта = "Основной" Тогда
        Если КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта = "Вариант1" Тогда
            ТекущийВариантОтчета = КомпоновщикНастроек.Настройки.Структура[0];
            Если ДополнительныеПараметры.ЦентнероПроцент Тогда
                ТекущийВариантОтчета.Настройки.Структура[1].Использование = Ложь;
                ТекущийВариантОтчета.Настройки.Структура[2].Использование = истина;
            Иначе
                ТекущийВариантОтчета.Настройки.Структура[1].Использование = Истина;
                ТекущийВариантОтчета.Настройки.Структура[2].Использование = Ложь;
            КонецЕсли;
        КонецЕсли; 
        Возврат;   
    КонецЕсли; 
       
    СтандартнаяОбработка = Ложь; 
    
    ВыборкаДопХарактеристикШапка = Новый ТаблицаЗначений;
    ВыборкаДопХарактеристикЗначения = Новый ТаблицаЗначений;
    ВыборкаЛабАнализов  = Новый ТаблицаЗначений;
    ЗаполнитьЗначенияСвойств(КомпоновщикНастроек.Настройки.Отбор.Элементы,КомпоновщикНастроек.ПользовательскиеНастройки.Элементы);
    КомпоновщикНастроекТЗ = Новый КомпоновщикНастроекКомпоновкиДанных;
    КомпоновщикНастроекТЗ.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
    ВО = СхемаКомпоновкиДанных.ВариантыНастроек.Найти("Основной");
    КомпоновщикНастроекТЗ.ЗагрузитьНастройки(Во.Настройки);
    НастройкиКомпоновщика = КомпоновщикНастроекТЗ.Настройки;
    
    
    Для каждого ЭлементПользовательскихНастроек Из КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
        Если ТипЗнч(ЭлементПользовательскихНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда        
            Для каждого ЭлементПараметраКомпоновщика Из НастройкиКомпоновщика.ПараметрыДанных.Элементы Цикл
                Если ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = ЭлементПараметраКомпоновщика.ИдентификаторПользовательскойНастройки Тогда
                    ЗаполнитьЗначенияСвойств(ЭлементПараметраКомпоновщика,ЭлементПользовательскихНастроек);
                КонецЕсли;     
            КонецЦикла;
            Продолжить;
        КонецЕсли; 
        Для каждого ЭлементОтбораКомпоновщика Из НастройкиКомпоновщика.Отбор.Элементы Цикл
            Если ЭлементПользовательскихНастроек.ИдентификаторПользовательскойНастройки = ЭлементОтбораКомпоновщика.ИдентификаторПользовательскойНастройки Тогда
                ЗаполнитьЗначенияСвойств(ЭлементОтбораКомпоновщика,ЭлементПользовательскихНастроек,,"ЛевоеЗначение");
            КонецЕсли;     
        КонецЦикла; 
    КонецЦикла; 
    
    
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки   = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, НастройкиКомпоновщика,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    	
    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ТЗ = Новый ТаблицаЗначений;
    ПроцессорВывода.УстановитьОбъект(ТЗ);
    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
    
    ВыборкаДопХарактеристикШапка = ТЗ.Скопировать(,"Наименование,ТипХарактеристики,Характеристика");
    ВыборкаДопХарактеристикШапка.Свернуть("Наименование,ТипХарактеристики,Характеристика");
    ВыборкаДопХарактеристикЗначения = ТЗ.Скопировать(,"ЛАСсылка,Характеристика,Значение,ВесХарактеристики");
    ВыборкаДопХарактеристикЗначения.Свернуть("ЛАСсылка,Характеристика,Значение,ВесХарактеристики");
    ВыборкаЛабАнализов = ТЗ.Скопировать(,"ЛАНомер,НомерТранспорта,ДокСсылка,НомерДок,НомерУдостоверения,СтанцияНазначения,ЛАДата,
                                          |Вес,Склад,Урожай,Влажность,СорнаяПримесь,ЗерноваяПримесь,ВесОбразцов,ЛАСсылка,День,
                                          |Владелец,Номенклатура");
    ВыборкаЛабАнализов.Свернуть("ЛАНомер,НомерТранспорта,НомерУдостоверения,ДокСсылка,НомерДок,СтанцияНазначения,ЛАДата,
                                          |Склад,Урожай,Влажность,Вес,Влажность,СорнаяПримесь,ЗерноваяПримесь,ВесОбразцов,ЛАСсылка,День,
                                          |Владелец,Номенклатура");
    
    Если ДополнительныеПараметры.ПодробныеХарактеристики  Тогда
        Форма49ВсеХарактеристики(ДокументРезультат,
                                 ВыборкаДопХарактеристикШапка,
                                 ВыборкаДопХарактеристикЗначения,
                                 ВыборкаЛабАнализов, 
                                 КомпоновщикНастроек.ПользовательскиеНастройки.Элементы,
                                 ДополнительныеПараметры.Граммы,ДополнительныеПараметры.ЦентнероПроцент)
    Иначе
        Форма49(ДокументРезультат,ВыборкаЛабАнализов, КомпоновщикНастроек.ПользовательскиеНастройки.Элементы,ДополнительныеПараметры.ЦентнероПроцент);		
    КонецЕсли;
        
КонецПроцедуры

// Простая форма без дополнительных характеристик,
// с центнеро процентами или без определяеться внутри процедуры
Процедура Форма49(ТабДок,ВыборкаЛабАнализов,НастройкиПользователя,ЦентнероПроцент)
    
    КодЯзыкаПечать = Локализация.КодЯзыкаИнтерфейса();
    Макет=ПолучитьМакет("Отчет");
    Макет.КодЯзыкаМакета=КодЯзыкаПечать;
    ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок");
    ОблПодЗаголовок=Макет.ПолучитьОбласть("ПодЗаголовок");
    
    ОблШапкаНомерДата=Макет.ПолучитьОбласть("Шапка | ОсновнаяНомерДата");
    
    ОблШапкаБазис=Макет.ПолучитьОбласть("Шапка | Базис");
    ОблШапкаЦПБазис=Макет.ПолучитьОбласть("Шапка | ЦПБазис");
    ОблШапкаДопХар=Макет.ПолучитьОбласть("Шапка | ДопХар");
    ОблШапкаЦПДопХар=Макет.ПолучитьОбласть("Шапка | ЦПДопХар");
    ОблШапкаВесОбразцов=Макет.ПолучитьОбласть("Шапка | ВесОбразцов");
    
    ОблДеталиНомерДата=Макет.ПолучитьОбласть("Детали | ОсновнаяНомерДата");
    
    ОблДеталиБазис=Макет.ПолучитьОбласть("Детали | Базис");
    ОблДеталиЦПБазис=Макет.ПолучитьОбласть("Детали | ЦПБазис");
    ОблДеталиДопХар=Макет.ПолучитьОбласть("Детали | ДопХар");
    ОблДеталиЦПДопХар=Макет.ПолучитьОбласть("Детали | ЦПДопХар");
    ОблДеталиВесОбразцов=Макет.ПолучитьОбласть("Детали | ВесОбразцов");
    
    ОблСтрокаНомерДата=Макет.ПолучитьОбласть("Строка | ОсновнаяномерДата");
    ОблИтогНомерДата=Макет.ПолучитьОбласть("Итог | ОсновнаяНомерДата");
    
    ОблИтогБазис=Макет.ПолучитьОбласть("Итог | Базис");
    ОблИтогЦПБазис=Макет.ПолучитьОбласть("Итог | ЦПБазис");	
    ОблИтогДопХар=Макет.ПолучитьОбласть("Итог | ДопХар");
    ОблИтогЦПДопХар=Макет.ПолучитьОбласть("Итог | ЦПДопХар");
    ОблИтогВесОбразцов=Макет.ПолучитьОбласть("Итог | ВесОбразцов");
    ОблРазрыв=Макет.ПолучитьОбласть("Разрыв");
    ТабДок.Очистить();
    
    //// ----Заголовок
    // Если ПериодС = '00010101000000' И ПериодПо = '00010101000000' Тогда
    //	ОблЗаголовок.Параметры.Период = НСтр("ru='Без периода';uk='Без періода'",КодЯзыкаПечать);
    // Иначе                    
    //	ОблЗаголовок.Параметры.Период = "за " + Формат(ПериодС, "ДЛФ=D") + " - " + Формат(ПериодПо, "ДЛФ=D");
    // КонецЕсли;	
        
    // -----ПодЗаголовок и фильтр для запроса
    Заг="";
    Для каждого ЭлементПользовательскихНастроек Из НастройкиПользователя Цикл
        Если ТипЗнч(ЭлементПользовательскихНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
            Если ЭлементПользовательскихНастроек.Значение.ДатаНачала = '00010101000000' И ЭлементПользовательскихНастроек.Значение.ДатаОкончания = '00010101000000' Тогда		
                ОблЗаголовок.Параметры.Период = НСтр("ru='Без периода';uk='Без періода'",КодЯзыкаПечать);
            Иначе
                ОблЗаголовок.Параметры.Период = "за " + Формат(ЭлементПользовательскихНастроек.Значение.ДатаНачала, "ДЛФ=D") + " - " + Формат(ЭлементПользовательскихНастроек.Значение.ДатаОкончания, "ДЛФ=D");
            КонецЕсли;
        Продолжить;
        КонецЕсли; 
       	// ----- ПодЗаголовок и фильтр для запроса
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Организации") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг = Заг +НСтр("ru=' Фирма: ';uk=' Фірма: '",КодЯзыкаПечать) + ЭлементПользовательскихНастроек.ПравоеЗначение;
             // ОблЗаголовок.Параметры.Организация=ЭлементПользовательскихНастроек.ПравоеЗначение; //Петренко
        КонецЕсли;
                
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Контрагенты") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=заг+НСтр("ru=' Владелец: ';uk=' Власник: '",КодЯзыкаПечать)+ ЭлементПользовательскихНастроек.ПравоеЗначение;				
        КонецЕсли;
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.ИНАГРО_ВидыКультур") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+НСтр("ru=' Вид культуры: ';uk=' Вид культури: '",КодЯзыкаПечать)+ ЭлементПользовательскихНастроек.ПравоеЗначение;				
        КонецЕсли;                                 
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Номенклатура") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Номенклатура: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;	
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.ИНАГРО_ВидыУрожая") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Урожай: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Склады") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Склад: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.ИНАГРО_МестаХранения") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Силос: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;
    КонецЦикла;
    ТабДок.Вывести(ОблЗаголовок);
    ОблПодЗаголовок.Параметры.заг = Заг;
    ТабДок.Вывести(ОблПодЗаголовок);
    НачальнаяВысотаШапки			= ТабДок.ВысотаТаблицы;	
    ТабДок.Вывести(ОблШапкаНомерДата);	
    
    ТаблицаХарактеристик=Новый ТаблицаЗначений;
    ТаблицаХарактеристик.Колонки.Добавить("Наименование");	
    ТаблицаХарактеристик.Колонки.Добавить("ЦентнероПроцент");
    ТаблицаХарактеристик.Колонки.Добавить("Вес");
    
    Если НЕ ЦентнероПроцент Тогда
        // выводяться только влажность, сорнаяпромесь и зерновая примесь
        ТабДок.Присоединить(ОблШапкаБазис);
    Иначе
        ТабДок.Присоединить(ОблШапкаЦПБазис);
    КонецЕсли;
    //
    НомКолонки = 14;
    НомКолонки_1 = НомКолонки + 1;
    НомКолонки_2 = НомКолонки + 2;
    НомКолонки_3 = НомКолонки + 3;
    ОблШапкаВесОбразцов.Параметры.НомКолонки_1 = НомКолонки_1;
    ОблШапкаВесОбразцов.Параметры.НомКолонки_2 = НомКолонки_2;
    ОблШапкаВесОбразцов.Параметры.НомКолонки_3 = НомКолонки_3;
    //
    ТабДок.Присоединить(ОблШапкаВесОбразцов);
    
    ВысотаШапки   					= ТабДок.ВысотаТаблицы;		
    ТабДок.ФиксацияСверху			= ВысотаШапки;
    
    Ном = 0;	
    ИтогВес=0;
    ИтогВесОбразцов=0;
    ВесПоВлажности=0;
    ВесПоСорнойПримеси=0;
    ВесПоЗерновойПримеси=0;
    ДатаЛабАнализа = Дата(1,1,1);
    Первая = Истина;
    Для Каждого ЛабАнализ Из ВыборкаЛабАнализов Цикл
        
        Если ДатаЛабАнализа < ЛабАнализ.День Тогда
            
            Если НЕ Первая Тогда
                ТабДок.ЗакончитьГруппуСтрок();
                
            КонецЕсли;
            Первая = Ложь;
            ОблСтрокаНомерДата.Параметры.Дата=Формат(ЛабАнализ.День,"ДФ=dd.MM.yyyy");
            //ОблСтрокаНомерДата.Параметры.Номер=ЛабАнализ.ЛАНомер;	
            СтрокиГрупировки = ВыборкаЛабАнализов.НайтиСтроки(Новый Структура("День",ЛабАнализ.День));
            Вес = 0;
            Для каждого Элемент Из СтрокиГрупировки Цикл
                 Вес = Вес + Элемент.Вес;
            КонецЦикла;                    
            
            ОблСтрокаНомерДата.Параметры.Вес=Вес;
            ТабДок.Вывести(ОблСтрокаНомерДата);
            
            ИтогВес=ИтогВес+Вес;
            ИтогВесОбразцов=ИтогВесОбразцов+ЛабАнализ.ВесОбразцов;
            ТабДок.НачатьГруппуСтрок();
            
            
        КонецЕсли; 
        ДатаЛабАнализа = ЛабАнализ.День;		
        //расшифровка
        
        ОблДеталиНомерДата.Параметры.ЛаСсылка=ЛабАнализ.ЛАСсылка;
        
        Ном = Ном + 1;
        ОблДеталиНомерДата.Параметры.Ном = Ном;
        ОблДеталиНомерДата.Параметры.Номер=ЛабАнализ.ЛАНомер;				
        ОблДеталиНомерДата.Параметры.Дата=Формат(ЛабАнализ.ЛАДата,"ДФ=dd.MM.yyyy");
        ОблДеталиНомерДата.Параметры.Вес=ЛабАнализ.Вес;
        ОблДеталиНомерДата.Параметры.Владелец=ЛабАнализ.Владелец;
        ОблДеталиНомерДата.Параметры.Номенклатура = ЛабАнализ.Номенклатура;
        КлассификаторЗерна = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(ЛабАнализ.Номенклатура,"КлассификаторЗерна");
        ОблДеталиНомерДата.Параметры.КодПоОДК = КлассификаторЗерна.Код;
        ОблДеталиНомерДата.Параметры.НомерВагона = СокрЛП(ЛабАнализ.НомерТранспорта);
        ОблДеталиНомерДата.Параметры.НомерУдостоверения = СокрЛП(ЛабАнализ.НомерУдостоверения);
        ОблДеталиНомерДата.Параметры.Сорт = СокрЛП(ЛабАнализ.ЛАСсылка.Сорт);
        ОблДеталиНомерДата.Параметры.Клас = СокрЛП(ЛабАнализ.ЛАСсылка.Класс);
        ТабДок.Вывести(ОблДеталиНомерДата);				
        
        ВесПоВлажности=ВесПоВлажности+ОКР(ЛабАнализ.Влажность*ЛабАнализ.Вес/100,2);
        ВесПоСорнойПримеси=ВесПоСорнойПримеси+ОКР(ЛабАнализ.СорнаяПримесь*ЛабАнализ.Вес/100,2);
        ВесПоЗерновойПримеси=ВесПоЗерновойПримеси+ОКР(ЛабАнализ.ЗерноваяПримесь*ЛабАнализ.Вес/100,2);
        
        Если НЕ ЦентнероПроцент Тогда
            ОблДеталиБазис.Параметры.Влажность=ЛабАнализ.Влажность;
            ОблДеталиБазис.Параметры.СорнаяПримесь=ЛабАнализ.СорнаяПримесь;
            ОблДеталиБазис.Параметры.ЗерноваяПримесь=ЛабАнализ.ЗерноваяПримесь;
            ОблДеталиБазис.Параметры.ЛаСсылка=ЛабАнализ.ЛАСсылка;
            ТабДок.Присоединить(ОблДеталиБазис);
        Иначе
            ОблДеталиЦПБазис.Параметры.Влажность=ЛабАнализ.Влажность;
            ОблДеталиЦПБазис.Параметры.СорнаяПримесь=ЛабАнализ.СорнаяПримесь;
            ОблДеталиЦПБазис.Параметры.ЗерноваяПримесь=ЛабАнализ.ЗерноваяПримесь;
            ОблДеталиЦПБазис.Параметры.ЦПВлажность=ОКР(ЛабАнализ.Влажность*ЛабАнализ.Вес/100,2);
            ОблДеталиЦПБазис.Параметры.ЦПСорнаяПримесь=ОКР(ЛабАнализ.СорнаяПримесь*ЛабАнализ.Вес/100,2);
            ОблДеталиЦПБазис.Параметры.ЦПЗерноваяПримесь=ОКР(ЛабАнализ.ЗерноваяПримесь*ЛабАнализ.Вес/100,2);
            ОблДеталиЦПБазис.Параметры.ЛаСсылка=ЛабАнализ.ЛАСсылка;
            ТабДок.Присоединить(ОблДеталиЦПБазис);
        КонецЕсли;
        
        НоваяСтрока=ТаблицаХарактеристик.Добавить();
        ОблДеталиВесОбразцов.Параметры.Силос = ЛабАнализ.ЛАСсылка.Силос;
        //ОблДеталиВесОбразцов.Параметры.ВесОбразцов=ЛабАнализ.ВесОбразцов;			
        ТабДок.Присоединить(ОблДеталиВесОбразцов);
        
    КонецЦикла;
    Если ВыборкаЛабАнализов.Количество()>0 Тогда
        ТабДок.ЗакончитьГруппуСтрок();
        
        
        ТабДок.Вывести(ОблРазрыв);   
        // вывод общего итога
        ОблИтогНомерДата.Параметры.Вес=ИтогВес;
        ТабДок.Вывести(ОблИтогНомерДата);
        //ОблИтогВесОбразцов.Параметры.ВесОбразцов=ИтогВесОбразцов;	
        
        Если Не ЦентнероПроцент Тогда
            ОблИтогБазис.Параметры.Влажность=?(ИтогВес>0,ОКР(ВесПоВлажности*100/ИтогВес,2),0);
            ОблИтогБазис.Параметры.СорнаяПримесь=?(ИтогВес>0,ОКР(ВесПоСорнойПримеси*100/ИтогВес,2),0);
            ОблИтогБазис.Параметры.ЗерноваяПримесь=?(ИтогВес>0,ОКР(ВесПоЗерновойПримеси*100/ИтогВес,2),0);
            ТабДок.Присоединить(ОблИтогБазис);
        Иначе
            ОблИтогЦПБазис.Параметры.Влажность=?(ИтогВес>0,ОКР(ВесПоВлажности*100/ИтогВес,2),0);
            ОблИтогЦПБазис.Параметры.СорнаяПримесь=?(ИтогВес>0,ОКР(ВесПоСорнойПримеси*100/ИтогВес,2),0);
            ОблИтогЦПБазис.Параметры.ЗерноваяПримесь=?(ИтогВес>0,ОКР(ВесПоЗерновойПримеси*100/ИтогВес,2),0);
            ОблИтогЦПБазис.Параметры.ЦПВлажность=ВесПоВлажности;
            ОблИтогЦПБазис.Параметры.ЦПСорнаяПримесь=ВесПоСорнойПримеси;
            ОблИтогЦПБазис.Параметры.ЦПЗерноваяПримесь=ВесПоЗерновойПримеси;
            
            ТабДок.Присоединить(ОблИтогЦПБазис);
        КонецЕсли;
        ТабДок.Присоединить(ОблИтогВесОбразцов);
    КонецЕсли; 
    ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    
    Для Кол = 3 По 12 Цикл
        ШиринаКолонки = 0;
        Для Стр = 1 По ТабДок.ВысотаТаблицы Цикл
            Область = ТабДок.Область("R"+Формат(Стр,"ЧГ=0")+"C"+Формат(Кол,"ЧГ=0"));
            ШиринаОбласти = Область.Отступ+СтрДлина(СокрЛП(Область.Текст));
            ШиринаКолонки = Макс(ШиринаКолонки, ШиринаОбласти + 3);
            Если ШиринаКолонки > 15 Тогда
                Область.ШиринаКолонки = 15;
            Иначе
                Область.ШиринаКолонки = ШиринаКолонки;
            КонецЕсли;
        Конеццикла;
    КонецЦикла;
    
КонецПроцедуры

// Форма где присутствуют все характеристики,
// с центнеро процентами или без определяеться внутри процедуры
Процедура Форма49ВсеХарактеристики(ТабДок,ВыборкаДопХарактеристикШапка,ВыборкаДопХарактеристикЗначения,ВыборкаЛабАнализов,НастройкиПользователя,Граммы,ЦентнероПроцент)
    КодЯзыкаПечать = Локализация.КодЯзыкаИнтерфейса();
    Макет=ПолучитьМакет("Отчет");
    Макет.КодЯзыкаМакета=КодЯзыкаПечать;
    ОблЗаголовок=Макет.ПолучитьОбласть("Заголовок");
    ОблПодЗаголовок=Макет.ПолучитьОбласть("ПодЗаголовок");
    ОблШапкаНомерДата=Макет.ПолучитьОбласть("Шапка | ОсновнаяНомерДата");
    ОблШапкаБазис=Макет.ПолучитьОбласть("Шапка | Базис");
    ОблШапкаЦПБазис=Макет.ПолучитьОбласть("Шапка | ЦПБазис");
    ОблШапкаДопХар=Макет.ПолучитьОбласть("Шапка | ДопХар");
    ОблШапкаЦПДопХар=Макет.ПолучитьОбласть("Шапка | ЦПДопХар");
    ОблШапкаВесОбразцов=Макет.ПолучитьОбласть("Шапка | ВесОбразцов");
    ОблДеталиНомерДата=Макет.ПолучитьОбласть("Детали | ОсновнаяНомерДата");
    ОблДеталиБазис=Макет.ПолучитьОбласть("Детали | Базис");
    ОблДеталиЦПБазис=Макет.ПолучитьОбласть("Детали | ЦПБазис");
    ОблДеталиДопХар=Макет.ПолучитьОбласть("Детали | ДопХар");
    ОблДеталиЦПДопХар=Макет.ПолучитьОбласть("Детали | ЦПДопХар");
    ОблДеталиВесОбразцов=Макет.ПолучитьОбласть("Детали | ВесОбразцов");
    ОблСтрокаНомерДата=Макет.ПолучитьОбласть("Строка | ОсновнаяномерДата");
    ОблРазрыв=Макет.ПолучитьОбласть("Разрыв");
    ОблИтогНомерДата=Макет.ПолучитьОбласть("Итог | ОсновнаяНомерДата");
    ОблИтогБазис=Макет.ПолучитьОбласть("Итог | Базис");
    ОблИтогЦПБазис=Макет.ПолучитьОбласть("Итог | ЦПБазис");	
    ОблИтогДопХар=Макет.ПолучитьОбласть("Итог | ДопХар");
    ОблИтогЦПДопХар=Макет.ПолучитьОбласть("Итог | ЦПДопХар");
    ОблИтогВесОбразцов=Макет.ПолучитьОбласть("Итог | ВесОбразцов");
    ОблРазрыв=Макет.ПолучитьОбласть("Разрыв");
    ТабДок.Очистить();
    
    // ---- Заголовок
    Организация = "";
    Заг="";
    Для каждого ЭлементПользовательскихНастроек Из НастройкиПользователя Цикл
        Если ТипЗнч(ЭлементПользовательскихНастроек) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
            Если ЭлементПользовательскихНастроек.Значение.ДатаНачала = '00010101000000' И ЭлементПользовательскихНастроек.Значение.ДатаОкончания = '00010101000000' Тогда		
                ОблЗаголовок.Параметры.Период = НСтр("ru='Без периода';uk='Без періода'",КодЯзыкаПечать);
            Иначе
                ОблЗаголовок.Параметры.Период = "за " + Формат(ЭлементПользовательскихНастроек.Значение.ДатаНачала, "ДЛФ=D") + " - " + Формат(ЭлементПользовательскихНастроек.Значение.ДатаОкончания, "ДЛФ=D");
            КонецЕсли;
        Продолжить;
        КонецЕсли; 
       	// ----- ПодЗаголовок и фильтр для запроса
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Организации") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг = Заг +НСтр("ru=' Фирма: ';uk=' Фірма: '",КодЯзыкаПечать) + ЭлементПользовательскихНастроек.ПравоеЗначение;
             // ОблЗаголовок.Параметры.Организация=ЭлементПользовательскихНастроек.ПравоеЗначение; //Петренко
        КонецЕсли;
                
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Контрагенты") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=заг+НСтр("ru=' Владелец: ';uk=' Власник: '",КодЯзыкаПечать)+ ЭлементПользовательскихНастроек.ПравоеЗначение;				
        КонецЕсли;
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.ИНАГРО_ВидыКультур") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+НСтр("ru=' Вид культуры: ';uk=' Вид культури: '",КодЯзыкаПечать)+ ЭлементПользовательскихНастроек.ПравоеЗначение;				
        КонецЕсли;                                 
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Номенклатура") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Номенклатура: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;	
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.ИНАГРО_ВидыУрожая") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Урожай: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.Склады") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Склад: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;
        Если ТипЗнч(ЭлементПользовательскихНастроек.ПравоеЗначение) = Тип("СправочникСсылка.ИНАГРО_МестаХранения") И ЭлементПользовательскихНастроек.Использование Тогда
            Заг=Заг+" Силос: " + ЭлементПользовательскихНастроек.ПравоеЗначение;		
        КонецЕсли;
    КонецЦикла; 
    ТабДок.Вывести(ОблЗаголовок);
    ОблПодЗаголовок.Параметры.заг = Заг;
    ТабДок.Вывести(ОблПодЗаголовок);

    ТабДок.Вывести(ОблШапкаНомерДата);
       //НачальнаяВысотаШапки = ТабДок.ВысотаТаблицы;
   	
    // выводяться все характеристики где в виде характеристики стоит галочка показывать в журнале лабораторных анализов	
    //Выборка=СформироватьЗапрос("Количество разных характеристик","",ФильтрДляДопХар);
    
    ТаблицаХарактеристик=Новый ТаблицаЗначений;
    ТаблицаХарактеристик.Колонки.Добавить("Характеристика");
    ТаблицаХарактеристик.Колонки.Добавить("Наименование");
    ТаблицаХарактеристик.Колонки.Добавить("Код");
    ТаблицаХарактеристик.Колонки.Добавить("ЦентнероПроцент");
    ТаблицаХарактеристик.Колонки.Добавить("Вес");
    ИмяПеречисления=Метаданные.Перечисления.ИНАГРО_ТипыХарактеристик.Имя;
    
    Для каждого Выборка Из ВыборкаДопХарактеристикШапка Цикл
        НоваяСтрока=ТаблицаХарактеристик.Добавить();
    	НоваяСтрока.Характеристика=Выборка.Характеристика;
    	НоваяСтрока.Наименование=Выборка.Наименование;
    	НоваяСтрока.Код=Выборка.Характеристика.Порядок;
    	НоваяСтрока.Вес=0;
    	НоваяСтрока.ЦентнероПроцент=0;
    КонецЦикла; 
    
    ТаблицаХарактеристик.Сортировать("Код Возр");
    НомКолонки = 11; //14;	
    Для Каждого Стр Из ТаблицаХарактеристик Цикл 
    	НомКолонки = НомКолонки + 1;
    	Если НЕ ЦентнероПроцент Тогда
    		// без центнеро процентов			
    		ОбластьШапкаДопХар = ПолучитьОбласть(Макет, "Шапка", Стр.Характеристика,ЦентнероПроцент);
    		ОбластьШапкаДопХар.Параметры.ВидХарРасшифровка = Стр.Характеристика;
    		ОбластьШапкаДопХар.Параметры.ВидХар=Стр.Наименование;
    		ОбластьШапкаДопХар.Параметры.НомКолонки=НомКолонки;
    		ТабДок.Присоединить(ОбластьШапкаДопХар);
    	Иначе
    		// с центнеро процентами
    		ОбластьШапкаЦПДопХар = ПолучитьОбласть(Макет, "Шапка", Стр.Характеристика,ЦентнероПроцент);
    		ОбластьШапкаЦПДопХар.Параметры.ВидХарРасшифровка=Стр.Характеристика;
    		ОбластьШапкаЦПДопХар.Параметры.ВидХар=Стр.Наименование;
    		ТабДок.Присоединить(ОбластьШапкаЦПДопХар);
    	КонецЕсли;
    КонецЦикла;
    //
    НомКолонки_1 = НомКолонки + 1;
    НомКолонки_2 = НомКолонки + 2;
    НомКолонки_3 = НомКолонки + 3;
    ОблШапкаВесОбразцов.Параметры.НомКолонки_1 = НомКолонки_1;
    ОблШапкаВесОбразцов.Параметры.НомКолонки_2 = НомКолонки_2;
    ОблШапкаВесОбразцов.Параметры.НомКолонки_3 = НомКолонки_3;
    //	
    ТабДок.Присоединить(ОблШапкаВесОбразцов);
    
    ВысотаШапки   					= ТабДок.ВысотаТаблицы;
    ТабДок.ФиксацияСверху			= ВысотаШапки;		
    //ТабДок.ПовторятьПриПечатиСтроки = ТабДок.Область("R" + НачальнаяВысотаШапки + ":R" + ВысотаШапки);	
    
    Ном = 0;
    ИтогВес=0;
    ИтогВесОбразцов=0;
    ДатаЛабАнализа = Дата(1,1,1);
    Первая = Истина;
    Для Каждого ЛабАнализ Из ВыборкаЛабАнализов Цикл
        Если ДатаЛабАнализа < ЛабАнализ.День Тогда
            
            Если НЕ Первая Тогда
                ТабДок.ЗакончитьГруппуСтрок();
                
            КонецЕсли;
            Первая = Ложь;
            СтрокиГрупировки = ВыборкаЛабАнализов.НайтиСтроки(Новый Структура("День",ЛабАнализ.День));
            Вес = 0;
            ВесОбразцов = 0;
            Для каждого Элемент Из СтрокиГрупировки Цикл
                 Вес = Вес + Элемент.Вес;
                 ВесОбразцов = ВесОбразцов + Элемент.ВесОбразцов;
            КонецЦикла; 
            ОблСтрокаНомерДата.Параметры.Дата=Формат(ЛабАнализ.День,"ДФ=dd.MM.yyyy");
            //ОблСтрокаНомерДата.Параметры.Номер=ЛабАнализ.ЛАНомер;			
            ОблСтрокаНомерДата.Параметры.Вес=Вес;
            ТабДок.Вывести(ОблСтрокаНомерДата);
            
            ИтогВес=ИтогВес+Вес;
            ИтогВесОбразцов=ИтогВесОбразцов+ ВесОбразцов;
            ТабДок.НачатьГруппуСтрок();
        КонецЕсли;
         ДатаЛабАнализа = ЛабАнализ.День;
        //ВыборкаДокументов=ВыборкаЛабАнализов.Выбрать();
        //Пока ВыборкаДокументов.Следующий() Цикл
    		
    		ОблДеталиНомерДата.Параметры.ЛаСсылка=ЛабАнализ.ЛАСсылка;
    		
    		Ном = Ном + 1;
    		ОблДеталиНомерДата.Параметры.Ном = Ном;
    		ОблДеталиНомерДата.Параметры.Номер=ЛабАнализ.ЛАНомер;				
    		ОблДеталиНомерДата.Параметры.Дата=Формат(ЛабАнализ.ЛАДата,"ДФ=dd.MM.yyyy");
    		ОблДеталиНомерДата.Параметры.Вес=ЛабАнализ.Вес;
    		ОблДеталиНомерДата.Параметры.Владелец=ЛабАнализ.Владелец;
    		ОблДеталиНомерДата.Параметры.Номенклатура=ЛабАнализ.Номенклатура;
    		КлассификаторЗерна = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(ЛабАнализ.Номенклатура,"КлассификаторЗерна");
    		ОблДеталиНомерДата.Параметры.КодПоОДК = КлассификаторЗерна.Код;
    		ОблДеталиНомерДата.Параметры.НомерВагона = СокрЛП(ЛабАнализ.ЛАСсылка.НомерТранспорта);
    		ОблДеталиНомерДата.Параметры.НомерУдостоверения = СокрЛП(ЛабАнализ.ЛАСсылка.НомерУдостоверения);
    		ОблДеталиНомерДата.Параметры.Сорт = СокрЛП(ЛабАнализ.ЛАСсылка.Сорт);
    		ОблДеталиНомерДата.Параметры.Клас = СокрЛП(ЛабАнализ.ЛАСсылка.Класс);			
    		ТабДок.Вывести(ОблДеталиНомерДата);
    		
    		Инд=0;                       
    		Если НЕ ЦентнероПроцент Тогда
    			Пока Инд<ТаблицаХарактеристик.Количество() Цикл					
    				ГруппаКлейковины = 0;
    				СтруктураПоиска=Новый Структура("ЛАСсылка",ЛабАнализ.ЛАСсылка);
                    ВыборкаХарПоЛабАнализу = ВыборкаДопХарактеристикЗначения.НайтиСтроки(СтруктураПоиска);
    				Для Каждого Элемент ИЗ ВыборкаХарПоЛабАнализу Цикл						
    					ОблДеталиДопХар = ПолучитьОбласть(Макет,"Детали",ТаблицаХарактеристик[Инд].Характеристика,ЦентнероПроцент);
    					Если ТаблицаХарактеристик[Инд].Наименование=Элемент.Характеристика.Наименование Тогда																					
    						// патлань 19.08.09 начало
    						Если Граммы и Элемент.весХарактеристики<> 0 тогда
    							ЗначениеХар = СокрЛП(Элемент.Значение)+"% / "+СокрЛП(Элемент.весХарактеристики)+"гр."; 
    						Иначе
    							ЗначениеХар = СокрЛП(Элемент.Значение);
    						КонецЕсли;
    						// патлань конец
    						ОблДеталиДопХар.Параметры.Значение = ЗначениеХар;							
    						Если ТаблицаХарактеристик[Инд].Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество Тогда
    							ГруппаКлейковины = ПолучитьГруппуКлейковины(Элемент.Значение);
    							ОблДеталиДопХар.Параметры.Группа = ГруппаКлейковины;
    						КонецЕсли;							
    						Попытка
    							ТаблицаХарактеристик[Инд].Вес=ОКР(ТаблицаХарактеристик[Инд].Вес+ЛабАнализ.Вес,2);
    							ТаблицаХарактеристик[Инд].ЦентнероПроцент=ОКР(ТаблицаХарактеристик[Инд].ЦентнероПроцент+Элемент.Значение*ЛабАнализ.Вес/100,2);
    						Исключение
    						КонецПопытки;
    						Прервать;
    					КонецЕсли;						
    				КонецЦикла;
                    //ВыборкаХарПоЛабАнализу.Сбросить();
    				Инд=Инд+1;
    				ОблДеталиДопХар.Параметры.ЛаСсылка=ЛабАнализ.ЛАСсылка;
    				ТабДок.Присоединить(ОблДеталиДопХар);
    				ОблДеталиДопХар.Параметры.Значение="";
    			КонецЦикла;	
    		Иначе
    			Пока Инд<ТаблицаХарактеристик.Количество() Цикл
    				СтруктураПоиска=Новый Структура("ЛАСсылка",ЛабАнализ.ЛАСсылка);	
                    ВыборкаХарПоЛабАнализу = ВыборкаДопХарактеристикЗначения.НайтиСтроки(СтруктураПоиска);
    				Для Каждого Элемент ИЗ ВыборкаХарПоЛабАнализу Цикл
    					Если ТаблицаХарактеристик[Инд].Наименование=Элемент.Характеристика.Наименование Тогда
    						ОблДеталиЦПДопХар.Параметры.Значение=СокрЛП(Элемент.Значение);
    						Попытка
    							ОблДеталиЦПДопХар.Параметры.ЦПЗначение=ОКР(Элемент.Значение*ЛабАнализ.Вес/100,2);
    							ТаблицаХарактеристик[Инд].Вес=ОКР(ТаблицаХарактеристик[Инд].Вес+ЛабАнализ.Вес,2);
    							ТаблицаХарактеристик[Инд].ЦентнероПроцент=ОКР(ТаблицаХарактеристик[Инд].ЦентнероПроцент+Элемент.Значение*ЛабАнализ.Вес/100,2);
    						Исключение
    						КонецПопытки;	
    					КонецЕсли;						
    				КонецЦикла;
                    //ВыборкаХарПоЛабАнализу.Сбросить();
    				Инд=Инд+1;
    				ОблДеталиЦПДопХар.Параметры.ЛаСсылка=ЛабАнализ.ЛАСсылка;
    				ТабДок.Присоединить(ОблДеталиЦПДопХар);
    				ОблДеталиЦПДопХар.Параметры.Значение="";
    				ОблДеталиЦПДопХар.Параметры.ЦПЗначение="";
    			КонецЦикла;	
    		КонецЕсли;
    		ОблДеталиВесОбразцов.Параметры.Силос = ЛабАнализ.ЛАСсылка.Силос;			
    		//ОблДеталиВесОбразцов.Параметры.ВесОбразцов=ЛабАнализ.ВесОбразцов;				
    		ТабДок.Присоединить(ОблДеталиВесОбразцов);
        //КонецЦикла;
        //ТабДок.ЗакончитьГруппуСтрок();
        
    КонецЦикла;	
    Если ВыборкаЛабАнализов.Количество()>0 Тогда
        ТабДок.ЗакончитьГруппуСтрок();
        
        
        ТабДок.Вывести(ОблРазрыв);
        ОблИтогНомерДата.Параметры.Вес=ИтогВес;
        Инд=0;                       
        ТабДок.Вывести(ОблИтогНомерДата);
        
        Если Не ЦентнероПроцент Тогда
            Для Каждого Стр из ТаблицаХарактеристик Цикл
                ОблИтогДопХар = ПолучитьОбласть(Макет,"Итог",стр.Характеристика,ЦентнероПроцент);
                ОблИтогДопХар.Параметры.Значение=?(ИтогВес>0,ОКР(Стр.ЦентнероПроцент*100/ИтогВес,2),0);
                ТабДок.Присоединить(ОблИтогДопХар);
            КонецЦикла;			
         Иначе
            Для Каждого Стр из ТаблицаХарактеристик Цикл
                
                ОблИтогЦПДопХар.Параметры.Значение=?(ИтогВес>0,ОКР(Стр.ЦентнероПроцент*100/ИтогВес,2),0);
                ОблИтогЦПДопХар.Параметры.ЦПЗначение=ОКР(Стр.ЦентнероПроцент,2);
                ТабДок.Присоединить(ОблИтогЦПДопХар);
                
            КонецЦикла;			
        КонецЕсли;
        ТабДок.Присоединить(ОблИтогВесОбразцов);
    КонецЕсли;
    //ОблИтогВесОбразцов.Параметры.ВесОбразцов=ИтогВесОбразцов;
        ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
    
    Для Кол = 3 По 12 Цикл
        ШиринаКолонки = 0;
        Для Стр = 1 По ТабДок.ВысотаТаблицы Цикл
            Область = ТабДок.Область("R"+Формат(Стр,"ЧГ=0")+"C"+Формат(Кол,"ЧГ=0"));
            ШиринаОбласти = Область.Отступ+СтрДлина(СокрЛП(Область.Текст));
            ШиринаКолонки = Макс(ШиринаКолонки, ШиринаОбласти + 3);
            Если ШиринаКолонки > 15 Тогда
                Область.ШиринаКолонки = 15;
            Иначе
                Область.ШиринаКолонки = ШиринаКолонки;
            КонецЕсли;
        Конеццикла;
    КонецЦикла;
    
КонецПроцедуры

Функция ПолучитьОбласть(Макет, Секция, Характеристика,ЦентнероПроцент)
	
	Если НЕ ЦентнероПроцент Тогда
		Если Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.СорнаяПримесь 
			ИЛИ Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ЗерноваяПримесь Тогда
			Область = Макет.ПолучитьОбласть(Секция + "| ОбщаяХар");
		ИначеЕсли Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидСорнойПримеси
			ИЛИ Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидЗерновойПримеси Тогда			
			Область = Макет.ПолучитьОбласть(Секция + "| ВложенаяХар");
		ИначеЕсли Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.КлейковинаКачество Тогда
			Область = Макет.ПолучитьОбласть(Секция + "| КлейковинаКачество");			
		Иначе			
			Область = Макет.ПолучитьОбласть(Секция + "| ДопХар");
		КонецЕсли;
	Иначе
		Если Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.СорнаяПримесь 
			ИЛИ Характеристика = ПланыВидовХарактеристик.ИНАГРО_ХарактеристикиВидовКультур.ЗерноваяПримесь Тогда
			Область = Макет.ПолучитьОбласть(Секция + "| ЦПОбщаяХар");
		ИначеЕсли Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидСорнойПримеси
			ИЛИ Характеристика.ТипХарактеристики = Перечисления.ИНАГРО_ТипыХарактеристик.ВидЗерновойПримеси Тогда			
			Область = Макет.ПолучитьОбласть(Секция + "| ЦПВложенаяХар");
		Иначе			
			Область = Макет.ПолучитьОбласть(Секция + "| ЦПДопХар");
		КонецЕсли;				
	КонецЕсли;
	
	Возврат Область;
	
КонецФункции

Функция ПолучитьГруппуКлейковины(КлейковинаКачество)
	
	Рез = "";
	Если КлейковинаКачество >= 45 И КлейковинаКачество <= 75 Тогда
		Рез = "I";
	ИначеЕсли КлейковинаКачество >= 80 И КлейковинаКачество <= 100 Тогда
		Рез = "II";
	ИначеЕсли КлейковинаКачество >= 105 И КлейковинаКачество <= 120 Тогда
		Рез = "III";		
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

#КонецОбласти