#Область ПрограммныйИнтерфейс

// Настраивает подключаемое оборудование в форме,
// устанавливает флаг ИспользоватьПодключаемоеОборудование в форме
// Параметры:
//   Форма - Форма, в которой необходимо настроить подключаемое оборудование
//
Процедура НастроитьПодключаемоеОборудование(Форма) Экспорт
	
	ТипыПодключенногоОборудования = ИНАГРО_МенеджерОборудованияСерверПовтИсп.ТипыПодключенногоОборудованияБезУдаленных();
	
	Форма.ИспользоватьПодключаемоеОборудование = ИспользоватьПодключаемоеОборудование(ТипыПодключенногоОборудования);
	
	ЕстьВесы = ТипыПодключенногоОборудования <> Неопределено
		И ТипыПодключенногоОборудования.Найти(Перечисления.ИНАГРО_ТипыПодключаемогоОборудования.ЭлектронныеВесы) <> Неопределено;
			
	// Кнопки взвешивания 	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF5",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF6",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF7",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);

	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF8",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF9",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF10",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF11",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы,
		"КнопкаF12",
		"Видимость",
		Форма.ИспользоватьПодключаемоеОборудование И ЕстьВесы);

КонецПроцедуры

// Проверяет, что включена ф.о "Использовать подключаемое оборудование",
// настроено ли оборудование и авторизовался пользователь,
// а не внешний пользователь.
Функция ИспользоватьПодключаемоеОборудование(ТипыПодключенногоОборудования = Неопределено) Экспорт
	
	ИспользоватьПодключаемоеОборудование = ПолучитьФункциональнуюОпцию("ИНАГРО_ИспользоватьПодключаемоеОборудование");
	ПользовательАвторизовался 			 = ТипЗнч(Пользователи.АвторизованныйПользователь()) = Тип("СправочникСсылка.Пользователи");
	
	Если ТипыПодключенногоОборудования = Неопределено Тогда
		ТипыПодключенногоОборудования = ИНАГРО_МенеджерОборудованияСерверПовтИсп.ТипыПодключенногоОборудованияБезУдаленных();
	КонецЕсли;
	
	Возврат
		ИспользоватьПодключаемоеОборудование
		И ПользовательАвторизовался
		И ТипыПодключенногоОборудования <> Неопределено
		И ТипыПодключенногоОборудования.Количество() > 0;
												 
КонецФункции

#КонецОбласти