
Функция ЕстьДоступРедактироватьНастройку(Настройка) Экспорт
	Пользователь = скEDI_НастройкиПодКонфигурацию.ПолучитьТекущегоПользователя();
	
	Если Настройка = ПланыВидовХарактеристик.скEDI_НастройкиПользователей.ТолькоДоступныеПодписи Тогда	
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура УстановитьЗначениеНастройки(Пользователь, Настройка, ЗначениеНастройки) Экспорт
	МенеджерЗаписи = РегистрыСведений.скEDI_НастройкиПользователей.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пользователь = Пользователь;
	МенеджерЗаписи.Настройка = Настройка;
	МенеджерЗаписи.ЗначениеНастройки = ЗначениеНастройки;
	МенеджерЗаписи.Записать(Истина);
КонецПроцедуры

Процедура УстановитьЗначениеНастройкиТекущегоПользователя(Настройка, ЗначениеНастройки) Экспорт
	Пользователь = скEDI_НастройкиПодКонфигурацию.ПолучитьТекущегоПользователя();
	УстановитьЗначениеНастройки(Пользователь, Настройка, ЗначениеНастройки);
КонецПроцедуры

Функция ПолучитьЗначениеНастройки(Пользователь, Настройка) Экспорт
	Если ЗначениеЗаполнено(Настройка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	скEDI_НастройкиПользователей.ЗначениеНастройки КАК ЗначениеНастройки
		               |ИЗ
		               |	РегистрСведений.скEDI_НастройкиПользователей КАК скEDI_НастройкиПользователей
		               |ГДЕ
		               |	скEDI_НастройкиПользователей.Пользователь = &Пользователь
		               |	И скEDI_НастройкиПользователей.Настройка = &Настройка";
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Запрос.УстановитьПараметр("Настройка", Настройка);
		
		ВыборкаРезультатаЗапроса = Запрос.Выполнить().Выбрать();
		Если ВыборкаРезультатаЗапроса.Следующий() Тогда
			Возврат ВыборкаРезультатаЗапроса.ЗначениеНастройки;
		Иначе
			Возврат ПолучитьЗначениеНастройкиПоУмолчанию(Настройка);
		КонецЕсли;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ПолучитьЗначениеНастройкиТекущегоПользователя(Настройка) Экспорт
	Пользователь = скEDI_НастройкиПодКонфигурацию.ПолучитьТекущегоПользователя();
	Возврат ПолучитьЗначениеНастройки(Пользователь, Настройка);
КонецФункции

Функция ПолучитьЗначениеНастройкиПоУмолчанию(Настройка)
	Если Настройка = ПланыВидовХарактеристик.скEDI_НастройкиПользователей.ТолькоДоступныеПодписи Тогда
		Возврат Ложь;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции