#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	ГруппаИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор.Элементы, , ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаИ, "Дата", НачалоДня(Параметры.Дата), ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаИ, "Дата", КонецДня(Параметры.Дата),  ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);

КонецПроцедуры

#КонецОбласти
