#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ВыполнитьАнализСообщенияОбмена")
Процедура СМС_ВыполнитьАнализСообщенияОбмена(ПараметрыАнализа) Экспорт	ЧтениеСообщения = Неопределено;
	
	Если ЗначениеЗаполнено(УзелОбменаЗагрузкаДанных) Тогда
		УзелОбменаЗагрузкаДанныхОбъект = УзелОбменаЗагрузкаДанных.ПолучитьОбъект();
	КонецЕсли;
	
	Попытка
		
		УстановитьФлагОшибки(Ложь);
		
		ИспользоватьТранзакции = Ложь;
		
		ПолеСтрокаСообщенияОбОшибке = "";
		ПолеСостояниеОбменаДанными = Неопределено;
		ПолеРезультатВыполненияОбмена = Неопределено;
		ПолеВерсияФорматаВходящегоСообщенияОбмена = Неопределено;
		ЕстьКорректировкаИнформацииОРегистрацииОбъекта = Ложь;
		ЕстьИнформацияОРегистрацииОбъекта = Ложь;
		ГлобальныйСтекНеЗаписанныхОбъектов = Новый Соответствие;
		СоответствиеПравилКонвертации = Новый Соответствие;
		
		ИнициализироватьВедениеПротоколаОбмена();
		
		ИнициализироватьМенеджерыИСообщения();
		
		// дата начала анализа
		СостояниеОбменаДанными().ДатаНачала = ТекущаяДатаСеанса();
		
		// Обнуляем значение модальной переменной.
		ПолеТаблицаДанныхЗаголовкаПакета = Неопределено;
		
		#Вставка
		ИмяПрофиляБезопасности = ИнициализироватьОбработки();
		#КонецВставки
		
		НачатьЧтениеСообщения(ЧтениеСообщения, Истина);
		Попытка
			
			// Зачитываем данные из сообщения обмена.
			ПроизвестиЧтениеДанныхВРежимеАнализа(ЧтениеСообщения, ПараметрыАнализа);
			
			Если ФлагОшибки() Тогда
				ВызватьИсключение НСтр("ru='Возникли ошибки при анализе данных.';uk='Виникли помилки при аналізі даних.'");
			КонецЕсли;
			
			// Формируем временную таблицу данных.
			ТаблицаДанныхЗаголовкаПакетаВременная = ТаблицаДанныхЗаголовкаПакета().Скопировать(, "ТипИсточникаСтрокой, ТипПриемникаСтрокой, ПоляПоиска, ПоляТаблицы");
			ТаблицаДанныхЗаголовкаПакетаВременная.Свернуть("ТипИсточникаСтрокой, ТипПриемникаСтрокой, ПоляПоиска, ПоляТаблицы");
			
			// Сворачиваем таблицу данных заголовка пакета.
			ТаблицаДанныхЗаголовкаПакета().Свернуть(
				"ТипОбъектаСтрокой, ТипИсточникаСтрокой, ТипПриемникаСтрокой, СинхронизироватьПоИдентификатору, ЭтоКлассификатор, ЭтоУдалениеОбъекта, ИспользоватьПредварительныйПросмотр",
				"КоличествоОбъектовВИсточнике");
			//
			ТаблицаДанныхЗаголовкаПакета().Колонки.Добавить("ПоляПоиска",  одОписаниеТипа("Строка"));
			ТаблицаДанныхЗаголовкаПакета().Колонки.Добавить("ПоляТаблицы", одОписаниеТипа("Строка"));
			
			Для Каждого СтрокаТаблицы Из ТаблицаДанныхЗаголовкаПакета() Цикл
				
				Отбор = Новый Структура;
				Отбор.Вставить("ТипИсточникаСтрокой", СтрокаТаблицы.ТипИсточникаСтрокой);
				Отбор.Вставить("ТипПриемникаСтрокой", СтрокаТаблицы.ТипПриемникаСтрокой);
				
				СтрокиВременнойТаблицы = ТаблицаДанныхЗаголовкаПакетаВременная.НайтиСтроки(Отбор);
				
				СтрокаТаблицы.ПоляПоиска  = СтрокиВременнойТаблицы[0].ПоляПоиска;
				СтрокаТаблицы.ПоляТаблицы = СтрокиВременнойТаблицы[0].ПоляТаблицы;
				
			КонецЦикла;
			
			ВыполнитьОбработчикПослеЗагрузкиДанных();
			
			ЗакончитьЧтениеСообщения(ЧтениеСообщения);
			
		Исключение
			ПрерватьЧтениеСообщения(ЧтениеСообщения);
			ВызватьИсключение;
		КонецПопытки;
		
	Исключение
		Если ЧтениеСообщения <> Неопределено
			И ЧтениеСообщения.СообщениеБылоПринятоРанее Тогда
			ЗаписатьВПротоколВыполнения(174,,,,,,
				Перечисления.РезультатыВыполненияОбмена.Предупреждение_СообщениеОбменаБылоРанееПринято);
		Иначе
			ЗаписатьВПротоколВыполнения(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецЕсли;
		
	КонецПопытки;
	
	ЗавершитьВедениеПротоколаОбмена();
	
	// дата окончания анализа
	СостояниеОбменаДанными().ДатаОкончания = ТекущаяДатаСеанса();
	
	// Фиксируем завершение анализа данных в РС.
	ЗафиксироватьЗавершениеЗагрузкиДанных();
	
	// Сбрасываем модальные переменные перед помещением обработки в платформенный кэш.
	ПолеДокументыДляОтложенногоПроведения = Неопределено;
	ПолеОбъектыДляОтложеннойЗаписи = Неопределено;
	СоответствиеДокументовДляОтложенногоПроведения = Неопределено;
	ПолеСоответствиеТиповДанныхДляЗагрузки = Неопределено;
	ГлобальныйСтекНеЗаписанныхОбъектов = Неопределено;
	СоответствиеПравилКонвертации = Неопределено;
	ФайлОбмена = Неопределено;
	
КонецПроцедуры	

#КонецЕсли