
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	Настройки.ПараметрыДанных.Элементы.Найти("ПереключательКачества").Значение = ПереключательКачества;
	Настройки.ПараметрыДанных.Элементы.Найти("ПереключательКачества").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьВыше").Значение = ВлажностьВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьНеВыше").Значение = ВлажностьНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ВлажностьНеВыше").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьВыше").Значение = СорнаяПримесьВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьНеВыше").Значение = СорнаяПримесьНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("СорнаяПримесьНеВыше").Использование = Истина;

	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиВыше").Значение = ЗначениеОтбораПоВлажностиВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиНеВыше").Значение = ЗначениеОтбораПоВлажностиНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоВлажностиНеВыше").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиВыше").Значение = ЗначениеОтбораПоСорнойПримесиВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиВыше").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиНеВыше").Значение = ЗначениеОтбораПоСорнойПримесиНеВыше;
	Настройки.ПараметрыДанных.Элементы.Найти("ЗначениеОтбораПоСорнойПримесиНеВыше").Использование = Истина;
	
	Настройки.ПараметрыДанных.Элементы.Найти("Чистить").Значение = Чистить;
	Настройки.ПараметрыДанных.Элементы.Найти("Чистить").Использование = Истина;
	 	
	Настройки.ПараметрыДанных.Элементы.Найти("Сушить").Значение = Сушить;
	Настройки.ПараметрыДанных.Элементы.Найти("Сушить").Использование = Истина;
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
