#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	Если ДанныеЗаполнения <> Неопределено И ТипДанныхЗаполнения <> Тип("Структура")
		И Метаданные().ВводитсяНаОсновании.Содержит(ДанныеЗаполнения.Метаданные()) Тогда
		ЗаполнитьПоДокументуОснованию(ДанныеЗаполнения);
	КонецЕсли;
	
	ИНАГРО_ЭлеваторЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции	

Процедура ЗаполнитьПоДокументуОснованию(Основание)
	
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ИНАГРО_ЛабораторныйАнализ") Тогда
		
		Организация        = Основание.Организация;
		Владелец           = Основание.Владелец;
		ДоговорКонтрагента = Основание.ДоговорКонтрагента;
		Склад              = Основание.Склад;
		ВидХранения        = Основание.ВидХранения;
		Номенклатура       = Основание.Номенклатура;
		Урожай             = Основание.Урожай;
		ЛабораторныйАнализ = Основание.Ссылка;
		НомерАнализа       = Основание.Номер;
		Влажность          = Основание.Влажность;
		СорнаяПримесь      = Основание.СорнаяПримесь;
		ЗерноваяПримесь    = Основание.ЗерноваяПримесь;
		ФизическийВес      = Основание.МассаПартии;
		НомерТранспорта    = Основание.НомерТранспорта;
		Откуда             = Основание.СтанцияОтправления;
		Куда               = Основание.СтанцияНазначения;
		Примечание         = Основание.Комментарий;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли