#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);

	ЗапросПоТС = Новый Запрос();
	
	ЗапросПоТС.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИНАГРО_ПоказанияСпидометраИБакаСрезПоследних.ПоказанияБака
		|ИЗ
		|	РегистрСведений.ИНАГРО_ПоказанияСпидометраИБака.СрезПоследних(&ДатаСреза, ОсновноеСредство = &ОсновноеСредство) КАК ИНАГРО_ПоказанияСпидометраИБакаСрезПоследних";
		
	ЗапросПоТС.УстановитьПараметр("ДатаСреза",        Дата);
	ЗапросПоТС.УстановитьПараметр("ОсновноеСредство", ОсновноеСредство);
	
	Показания = ЗапросПоТС.Выполнить().Выбрать();
	
	Пока Показания.Следующий() Цикл
		ПоказанияБака = Показания.ПоказанияБака;
	КонецЦикла;	
	
	Движение = Движения.ИНАГРО_ПоказанияСпидометраИБака.Добавить();
	Движение.Период              = Дата;
	Движение.ОсновноеСредство    = ОсновноеСредство;
	Движение.ПоказанияСпидометра = ПоказанияСпидометра;
	Движение.ПоказанияБака       = ПоказанияБака;	
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект); 

КонецПроцедуры   

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли