//added by Al
Функция ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, ЭтоИсходящий = Ложь)

	Если СМС_СлужебныйСервер.РолиДоступны("скEDI_Пользователь_Свой") И Не 
		 СМС_СлужебныйСервер.РолиДоступны("скEDI_Администратор,скEDI_Оператор,скEDI_Пользователь,ПолныеПрава") Тогда
		 
		Док1С = Документ.Документ1С;
		ДокЭДО = Документ.ЭлектронныйДокумент;

		Если скEDI_ОбщегоНазначенияПовтИсп.СМС_ОпределитьДокументНакладнаяНаСервере(Документ.ВидЭлектронногоДокумента) Тогда

			Если ЗначениеЗаполнено(Док1С) Тогда

				Если ЭтоИсходящий Тогда 
					//разрешим выбирать подписывать и отправлять только те документы, которые пришли по обмену
					Возврат ЗначениеЗаполнено(Док1С.КлючДляОбмена);
				Иначе

					Если Док1С.Контрагент.КодПоЕДРПОУ = ДокЭДО.ЕДРПОУКонтрагента И ?(ЭтоИсходящий, Истина,
						Док1С.ДатаВходящегоДокумента = ДокЭДО.ДатаДокумента И Док1С.НомерВходящегоДокумента
						= ДокЭДО.НомерДокумента) И Док1С.СуммаДокумента = ДокЭДО.СуммаДокумента И
						//разрешим выбирать только те документы, которые пришли по обмену
					ЗначениеЗаполнено(Док1С.КлючДляОбмена) Тогда

						Возврат Истина;

					КонецЕсли;

				КонецЕсли;

			КонецЕсли;

		Иначе
			Возврат Истина;
		КонецЕсли;

	Иначе
		Возврат Истина;
	КонецЕсли;

	Возврат Ложь;

КонецФункции
//added by Al

&Вместо("ПолучитьДоступныеКоманды")
Функция СМС_ПолучитьДоступныеКоманды(МассивДокументов) Экспорт

	Результат = Новый Структура;

	Результат.Вставить("Подписать", Ложь);
	Результат.Вставить("ПодписатьИОтправить", Ложь);
	Результат.Вставить("ПодписатьИОтправитьТолькоСсылку", Ложь);
	Результат.Вставить("ОтправитьНаДоподписание", Ложь);
	Результат.Вставить("ПодписатьИОтправитьВДФС", Ложь);
	Результат.Вставить("Подтвердить", Ложь);
	Результат.Вставить("Отклонить", Ложь);
	Результат.Вставить("Отозвать", Ложь);
	Результат.Вставить("ПовторнаяОтправка", Ложь);
	Результат.Вставить("СоздатьДокумент1С", Ложь);
	Результат.Вставить("ПровестиДокумент1С", Ложь);
	Результат.Вставить("СоздатьНовыйЭлектронныйДокумент", Ложь);
	Результат.Вставить("СнятьПодписи", Ложь);
	Результат.Вставить("Проверить", Ложь);
	Результат.Вставить("ЭкспортДокументов", Ложь);
	Результат.Вставить("ОтправитьЗапросОСостоянииРегистрации", Ложь);
	Результат.Вставить("СформироватьНовыйВариантЭлектронногоДокумента", Ложь);
	Результат.Вставить("ОтредактироватьДокумент", Ложь);
	//Дата,ВидЭлектронногоДокумента,ТипДокумента,Документ1С,ЭлектронныйДокумент,ВхИсх,ГдеСоздан,Состояние,СостояниеРегистрацияВДФС,ЕстьФинальнаяКвитанцияДФС,ВидДокумента1С,СоответствиеДокументов,НеобходимоПроведениеДокумента1С,Документ1СПроведен,Обработано,ДатаОбработки,РегистрируетсяВЕРННПокупателем,ЭтоОсновнойВариант,ОшибкаШифрованияПриОтправке
	//added by Al
	Результат.Вставить("ВыбратьУчетныйДокумент", Ложь);
	//added by Al

	ЭтоПервыйДокумент = Истина;
	Для Каждого Документ Из МассивДокументов Цикл
		Подписать = Ложь;
		ПодписатьИОтправить = Ложь;
		ПодписатьИОтправитьТолькоСсылку = Ложь;
		ОтправитьНаДоподписание = Ложь;
		ПодписатьИОтправитьВДФС = Ложь;
		Подтвердить = Ложь;
		Отклонить = Ложь;
		Отозвать = Ложь;
		ПовторнаяОтправка = Ложь;
		СоздатьДокумент1С = Ложь;
		ПровестиДокумент1С = Ложь;
		СоздатьНовыйЭлектронныйДокумент = Ложь;
		СнятьПодписи = Ложь;
		Проверить = Ложь;
		ЭкспортДокументов = Ложь;
		ОтправитьЗапросОСостоянииРегистрации = Ложь;
		СформироватьНовыйВариантЭлектронногоДокумента = Ложь;
		ОтредактироватьДокумент = Ложь;
		//added by Al
		ВыбратьУчетныйДокумент = Ложь;

		Если СМС_СлужебныйСервер.РолиДОступны("скEDI_Пользователь_Просмотр_Свой") Тогда
			ЭкспортДокументов = Истина;
			Продолжить;
		КонецЕсли;	
		//added by Al

		Если Документ.ТипДокумента = ПредопределенноеЗначение(
			"Перечисление.скEDI_ТипыЭлектронныхДокументов.НалоговаяНакладная") Тогда
			Если Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Исходящий") Тогда
				Если Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПустаяСсылка") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//ПодписатьИОтправитьВДФС = Истина;
					Проверить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ЕстьТолькоДокумент1С") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//ПодписатьИОтправитьВДФС = Истина;
					Проверить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//ПодписатьИОтправитьВДФС = Истина;
					Проверить = Истина;
					//СоздатьНовыйЭлектронныйДокумент = Истина;
					//СнятьПодписи = Истина;
				//ИначеЕсли Документ.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Тогда
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
					= ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//ПодписатьИОтправитьВДФС = Истина;
					СоздатьНовыйЭлектронныйДокумент = Истина;
					СнятьПодписи = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
					ПодписатьИОтправить = Истина;
					//ПодписатьИОтправитьВДФС = Истина;
					СоздатьНовыйЭлектронныйДокумент = Истина;
					СнятьПодписи = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Отправлен") Тогда
					//Отозвать = Истина;
					//ПодписатьИОтправитьВДФС = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоСообщениеОДоставке") Тогда
					//ПодписатьИОтправитьВДФС = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждение") Тогда
					//ПодписатьИОтправитьВДФС = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Тогда
				//	ПодписатьИОтправитьВДФС = Истина;
					СоздатьНовыйЭлектронныйДокумент = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждениеОтДФС") Тогда
					ПодписатьИОтправить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленКонтрагентуДляРегистрацииВЕРПН") Тогда
					//Отозвать = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонениеОтДФС") Тогда
					СоздатьНовыйЭлектронныйДокумент = Истина;
				КонецЕсли;
				Если Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ПустаяСсылка")
					Или Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ОтправленВДФС") Тогда

					Если Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Тогда
						Если Документ.ЭтоОсновнойВариант Тогда
							СформироватьНовыйВариантЭлектронногоДокумента = Истина;
						КонецЕсли;
					Иначе
						ПодписатьИОтправитьВДФС = Истина;
					КонецЕсли;
				ИначеЕсли Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ПолученоОтклонениеОтДФС") Тогда
					Если Документ.ЭтоОсновнойВариант Тогда
						СформироватьНовыйВариантЭлектронногоДокумента = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Входящий") Тогда
				Если Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
					Подписать = Истина;
					Подтвердить = Истина;
					Отклонить = Истина;
					Проверить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
					= ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда
					Подписать = Истина;
					Подтвердить = Истина;
					Отклонить = Истина;
					СнятьПодписи = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
					Подтвердить = Истина;
					Отклонить = Истина;
					СнятьПодписи = Истина;
				КонецЕсли;
			КонецЕсли;
			ОтправитьЗапросОСостоянииРегистрации = Истина;
			Проверить = Истина;
		ИначеЕсли Документ.ТипДокумента = ПредопределенноеЗначение(
			"Перечисление.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной") Тогда
			Если Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Исходящий") Тогда
				Если Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПустаяСсылка") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
					Проверить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ЕстьТолькоДокумент1С") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
					Проверить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
					//СнятьПодписи = Истина;
					//СоздатьНовыйЭлектронныйДокумент = Истина;
					Проверить = Истина;
				//ИначеЕсли Документ.Состояние = ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Тогда
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
					= ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда
					Подписать = Истина;
					ПодписатьИОтправить = Истина;
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
					СоздатьНовыйЭлектронныйДокумент = Истина;
					СнятьПодписи = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
					ПодписатьИОтправить = Истина;
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
					СоздатьНовыйЭлектронныйДокумент = Истина;
					СнятьПодписи = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Отправлен") Тогда
					//Отозвать = Истина;
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоСообщениеОДоставке") Тогда
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждение") Тогда
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Тогда
					//Если не Документ.РегистрируетсяВЕРННПокупателем Тогда
					//	//ПодписатьИОтправитьВДФС = Истина;
					//КонецЕсли;
					СоздатьНовыйЭлектронныйДокумент = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждениеОтДФС") Тогда
					Если Не Документ.РегистрируетсяВЕРННПокупателем Тогда
						ПодписатьИОтправить = Истина;
					КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонениеОтДФС") Тогда
					СоздатьНовыйЭлектронныйДокумент = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленКонтрагентуДляРегистрацииВЕРПН") Тогда
					//Отозвать = Истина;
				КонецЕсли;
				Если Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ПустаяСсылка")
					Или Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ОтправленВДФС") Тогда

					Если Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Тогда
						Если Документ.ЭтоОсновнойВариант Тогда
							СформироватьНовыйВариантЭлектронногоДокумента = Истина;
						КонецЕсли;
					Иначе
						Если Не Документ.РегистрируетсяВЕРННПокупателем Тогда
							ПодписатьИОтправитьВДФС = Истина;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ПолученоОтклонениеОтДФС") Тогда
					Если Документ.ЭтоОсновнойВариант Тогда
						СформироватьНовыйВариантЭлектронногоДокумента = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Входящий") Тогда
				Если Документ.РегистрируетсяВЕРННПокупателем Тогда
					Если Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
						Подписать = Истина;
						//Подтвердить = Истина;
						Отклонить = Истина;
						//ПодписатьИОтправитьВДФС = Истина;
						Проверить = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
						= ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда
						Подписать = Истина;
						Отклонить = Истина;
						//ПодписатьИОтправитьВДФС = Истина;
						СнятьПодписи = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
						Отклонить = Истина;
						//ПодписатьИОтправитьВДФС = Истина;
						СнятьПодписи = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждениеОтДФС") Тогда
						ПодписатьИОтправить = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонениеОтДФС") Тогда
						ПодписатьИОтправить = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждениеОтДФС_РегистрацияОстановлена") Тогда
						ПодписатьИОтправить = Истина;
					КонецЕсли;
					Если (Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ПустаяСсылка")
						Или Документ.СостояниеРегистрацияВДФС = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументовРегистрацияВДФС.ОтправленВДФС"))
						И Документ.Состояние <> ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленоОтклонение") Тогда
						ПодписатьИОтправитьВДФС = Истина;
					КонецЕсли;
				Иначе
					Если Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
						Подписать = Истина;
						Подтвердить = Истина;
						Отклонить = Истина;
						Проверить = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
						= ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда
						Подписать = Истина;
						Подтвердить = Истина;
						Отклонить = Истина;
						//СнятьПодписи = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
						Подтвердить = Истина;
						Отклонить = Истина;
						//СнятьПодписи = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			ОтправитьЗапросОСостоянииРегистрации = Истина;
			Проверить = Истина;
		ИначеЕсли Документ.ТипДокумента = ПредопределенноеЗначение(
			"Перечисление.скEDI_ТипыЭлектронныхДокументов.ПервичныйДокумент") Тогда
			Если Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Исходящий") Тогда
				Если Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПустаяСсылка") Тогда
					//mod by Al
					//Подписать = Истина;
					//ОтправитьНаДоподписание = Истина;
					//ПодписатьИОтправить = Истина;
					ОтправитьНаДоподписание = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, Истина);
					ПодписатьИОтправить = ОтправитьНаДоподписание;
					Подписать = ПодписатьИОтправить;
					//mod by Al
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ЕстьТолькоДокумент1С") Тогда
					//mod by Al
					//Подписать = Истина;
					//ОтправитьНаДоподписание = Истина;
					//ПодписатьИОтправить = Истина;
					ОтправитьНаДоподписание = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, Истина);
					ПодписатьИОтправить = ОтправитьНаДоподписание;
					Подписать = ПодписатьИОтправить;
					//mod by Al
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") Тогда
					//mod by Al
					//Подписать = Истина;
					//ОтправитьНаДоподписание = Истина;
					//ПодписатьИОтправить = Истина;
					ОтправитьНаДоподписание = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, Истина);
					ПодписатьИОтправить = ОтправитьНаДоподписание;
					Подписать = ПодписатьИОтправить;
					//mod by Al
					//СнятьПодписи = Истина;
					//СоздатьНовыйЭлектронныйДокумент = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
					= ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда

					Если Документ.ГдеСоздан = ПредопределенноеЗначение(
						"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//Подтвердить = Истина;
						//Отклонить = Истина;
						//ОтредактироватьДокумент = Истина;
						//СнятьПодписи = Истина;
						ОтправитьНаДоподписание = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ,
							Истина);
						Подтвердить = ОтправитьНаДоподписание;
						Подписать = Подтвердить;
						Отклонить = Подписать;
						ОтредактироватьДокумент = Подписать;
						СнятьПодписи = Подписать;

						ВыбратьУчетныйДокумент = Истина;
						//mod by Al

					Иначе
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//ПодписатьИОтправить = Истина;
						ОтправитьНаДоподписание = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ,
							Истина);
						ПодписатьИОтправить = ОтправитьНаДоподписание;
						Подписать = ПодписатьИОтправить;										
						//mod by Al				
						//СоздатьНовыйЭлектронныйДокумент = Истина;
						СнятьПодписи = Истина;
					КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
					Если Документ.ГдеСоздан = ПредопределенноеЗначение(
						"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
						//Подписать = Истина;
						//mod by Al
						//Подтвердить = Истина;
						//Отклонить = Истина;
						//ОтредактироватьДокумент = Истина;
						//СнятьПодписи = Истина;
						Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
						Отклонить = Подтвердить;
						ОтредактироватьДокумент = Подтвердить;
						ВыбратьУчетныйДокумент = Истина;
						//mod by Al
					Иначе
						//mod by Al
						//ПодписатьИОтправить = Истина;
						ПодписатьИОтправить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, Истина);	
						//mod by Al
						//СоздатьНовыйЭлектронныйДокумент = Истина;
						СнятьПодписи = Истина;
					КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Отправлен") Тогда
					Отозвать = Истина;
					ПовторнаяОтправка = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоСообщениеОДоставке") Тогда
					Отозвать = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Тогда
					СоздатьНовыйЭлектронныйДокумент = Истина;
					Если Документ.ЭтоОсновнойВариант Тогда
						СформироватьНовыйВариантЭлектронногоДокумента = Истина;
					КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ДокументОтозван") Тогда
					СоздатьНовыйЭлектронныйДокумент = Истина;
					Если Документ.ЭтоОсновнойВариант Тогда
						СформироватьНовыйВариантЭлектронногоДокумента = Истина;
					КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
					Если Документ.ГдеСоздан = ПредопределенноеЗначение(
						"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//Подтвердить = Истина;
						//Отклонить = Истина;
						//ОтредактироватьДокумент = Истина;
						Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
						Подписать = Подтвердить;
						ОтправитьНаДоподписание = Подтвердить;
						Отклонить = Подтвердить;

						ВыбратьУчетныйДокумент = Истина;
						//mod by Al
					КонецЕсли;
				КонецЕсли;
				Если ПодписатьИОтправить Тогда
					Если Документ.ОшибкаШифрованияПриОтправке Тогда
						ПодписатьИОтправитьТолькоСсылку = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Входящий") Тогда
				Если Документ.ГдеСоздан = ПредопределенноеЗначение(
					"Перечисление.скEDI_ГдеСоздан.ВДаннойИнформационнойБазе") Тогда
					Если Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПустаяСсылка") Тогда
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//ПодписатьИОтправить = Истина;
						ПодписатьИОтправить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, Истина);
						Подписать = ПодписатьИОтправить;
						ОтправитьНаДоподписание = ПодписатьИОтправить;
						//mod by Al
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ЕстьТолькоДокумент1С") Тогда
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//ПодписатьИОтправить = Истина;
						ПодписатьИОтправить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, Истина);
						Подписать = ПодписатьИОтправить;
						ОтправитьНаДоподписание = ПодписатьИОтправить;
						//mod by Al
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") Тогда
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//ПодписатьИОтправить = Истина;
						ПодписатьИОтправить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ, Истина);
						Подписать = ПодписатьИОтправить;
						ОтправитьНаДоподписание = ПодписатьИОтправить;
						//mod by Al
						//СнятьПодписи = Истина;
						//СоздатьНовыйЭлектронныйДокумент = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
						= ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда

						Если Документ.ГдеСоздан = ПредопределенноеЗначение(
							"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
							//mod by Al
							//Подписать = Истина;
							//ОтправитьНаДоподписание = Истина;
							//Подтвердить = Истина;
							//Отклонить = Истина;
							//СнятьПодписи = Истина;
							Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
							Подписать = Подтвердить;
							ОтправитьНаДоподписание = Подтвердить;
							Отклонить = Подтвердить;
							СнятьПодписи = Подтвердить;
							ВыбратьУчетныйДокумент = Истина;
							//mod by Al
						Иначе
							//mod by Al
							//Подписать = Истина;
							//ОтправитьНаДоподписание = Истина;
							//ПодписатьИОтправить = Истина;
							ПодписатьИОтправить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ,
								Истина);
							Подписать = ПодписатьИОтправить;
							ОтправитьНаДоподписание = ПодписатьИОтправить;
							//mod by Al
							//СоздатьНовыйЭлектронныйДокумент = Истина;
							СнятьПодписи = Истина;
						КонецЕсли;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
						Если Документ.ГдеСоздан = ПредопределенноеЗначение(
							"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
							//Подписать = Истина;
							//mod by Al
							//Подтвердить = Истина;
							//Отклонить = Истина;
							//СнятьПодписи = Истина;
							Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
							Отклонить = Подтвердить;
							СнятьПодписи = Подтвердить;

							ВыбратьУчетныйДокумент = Истина;
							//mod by Al
						Иначе
							//mod by Al
							//ПодписатьИОтправить = Истина;
							////СоздатьНовыйЭлектронныйДокумент = Истина;
							//СнятьПодписи = Истина;
							ПодписатьИОтправить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ,
								Истина);
							СнятьПодписи = ПодписатьИОтправить;
							//mod by Al
						КонецЕсли;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Отправлен") Тогда
						Отозвать = Истина;
						ПовторнаяОтправка = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоСообщениеОДоставке") Тогда
						Отозвать = Истина;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Тогда
						СоздатьНовыйЭлектронныйДокумент = Истина;
						Если Документ.ЭтоОсновнойВариант Тогда
							СформироватьНовыйВариантЭлектронногоДокумента = Истина;
						КонецЕсли;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ДокументОтозван") Тогда
						СоздатьНовыйЭлектронныйДокумент = Истина;
						Если Документ.ЭтоОсновнойВариант Тогда
							СформироватьНовыйВариантЭлектронногоДокумента = Истина;
						КонецЕсли;
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
						Если Документ.ГдеСоздан = ПредопределенноеЗначение(
							"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
							//mod by Al
							//Подписать = Истина;
							//ОтправитьНаДоподписание = Истина;
							//Подтвердить = Истина;
							//Отклонить = Истина;
							Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
							Подписать = Подтвердить;
							ОтправитьНаДоподписание = Подтвердить;
							Отклонить = Подтвердить;

							ВыбратьУчетныйДокумент = Истина;
							//mod by Al
						КонецЕсли;
					КонецЕсли;
					Если ПодписатьИОтправить Тогда
						Если Документ.ОшибкаШифрованияПриОтправке Тогда
							ПодписатьИОтправитьТолькоСсылку = Истина;
						КонецЕсли;
					КонецЕсли;

				Иначе
					Если Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//Подтвердить = Истина;
						//Отклонить = Истина;
						//ОтредактироватьДокумент = Истина;
						Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
						Подписать = Подтвердить;
						ОтправитьНаДоподписание = Подтвердить;
						Отклонить = Подтвердить;
						ОтредактироватьДокумент = Подтвердить;

						ВыбратьУчетныйДокумент = Истина;
						//mod by Al
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
						= ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда
						
						//mod by Al
						//Подписать = Истина;
						//ОтправитьНаДоподписание = Истина;
						//Подтвердить = Истина;
						//Отклонить = Истина;
						//ОтредактироватьДокумент = Истина;
						//СнятьПодписи = Истина;
						Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
						Подписать = Подтвердить;
						ОтправитьНаДоподписание = Подтвердить;
						Отклонить = Подтвердить;
						ОтредактироватьДокумент = Подтвердить;
						СнятьПодписи = Подтвердить;

						ВыбратьУчетныйДокумент = Истина;
						//mod by Al
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
						//mod by Al
						//Подтвердить = Истина;
						//Отклонить = Истина;
						//ОтредактироватьДокумент = Истина;
						//СнятьПодписи = Истина;
						Подтвердить = ПроверитьНаСоответствиеЭлектронногоДокументаИДокумента1С(Документ);
						Отклонить = Подтвердить;
						ОтредактироватьДокумент = Подтвердить;
						СнятьПодписи = Подтвердить;

						ВыбратьУчетныйДокумент = Истина;
						//mod by Al
					ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленоОтклонение")
						Или Документ.Состояние = ПредопределенноеЗначение(
						"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленоПодтверждение") Тогда

						ПовторнаяОтправка = Истина;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли Документ.ТипДокумента = ПредопределенноеЗначение(
			"Перечисление.скEDI_ТипыЭлектронныхДокументов.ДокументСВложениями") Тогда
			Если Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Исходящий") Тогда
				Если Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПустаяСсылка") Тогда
					Подписать = Истина;
					ОтправитьНаДоподписание = Истина;
					ПодписатьИОтправить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ЕстьТолькоДокумент1С") Тогда
					Подписать = Истина;
					ОтправитьНаДоподписание = Истина;
					ПодписатьИОтправить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Создан") Тогда
					Подписать = Истина;
					ОтправитьНаДоподписание = Истина;
					ПодписатьИОтправить = Истина;
					//СнятьПодписи = Истина;
					//СоздатьНовыйЭлектронныйДокумент = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
					= ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда

					Если Документ.ГдеСоздан = ПредопределенноеЗначение(
						"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
						Подписать = Истина;
						ОтправитьНаДоподписание = Истина;
						Подтвердить = Истина;
						Отклонить = Истина;
						СнятьПодписи = Истина;
					Иначе
						Подписать = Истина;
						ОтправитьНаДоподписание = Истина;
						ПодписатьИОтправить = Истина;
						//СоздатьНовыйЭлектронныйДокумент = Истина;
						СнятьПодписи = Истина;
					КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
					Если Документ.ГдеСоздан = ПредопределенноеЗначение(
						"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
						//Подписать = Истина;
						Подтвердить = Истина;
						Отклонить = Истина;
						СнятьПодписи = Истина;
					Иначе
						ПодписатьИОтправить = Истина;
						//СоздатьНовыйЭлектронныйДокумент = Истина;
						СнятьПодписи = Истина;
					КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Отправлен") Тогда
					Отозвать = Истина;
					ПовторнаяОтправка = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоСообщениеОДоставке") Тогда
					Отозвать = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Тогда
					СоздатьНовыйЭлектронныйДокумент = Истина;
					//Если Документ.ЭтоОсновнойВариант Тогда
					//	СформироватьНовыйВариантЭлектронногоДокумента = Истина;
					//КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ДокументОтозван") Тогда
					СоздатьНовыйЭлектронныйДокумент = Истина;
					//Если Документ.ЭтоОсновнойВариант Тогда
					//	СформироватьНовыйВариантЭлектронногоДокумента = Истина;
					//КонецЕсли;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
					Если Документ.ГдеСоздан = ПредопределенноеЗначение(
						"Перечисление.скEDI_ГдеСоздан.ПолученОтКонтрагента") Тогда
						Подписать = Истина;
						ОтправитьНаДоподписание = Истина;
						Подтвердить = Истина;
						Отклонить = Истина;
					КонецЕсли;
				КонецЕсли;
				Если ПодписатьИОтправить Тогда
					Если Документ.ОшибкаШифрованияПриОтправке Тогда
						ПодписатьИОтправитьТолькоСсылку = Истина;
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Документ.ВхИсх = ПредопределенноеЗначение("Перечисление.скEDI_ВхИсхЭлектронныйДокумент.Входящий") Тогда
				Если Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен") Тогда
					Подписать = Истина;
					ОтправитьНаДоподписание = Истина;
					Подтвердить = Истина;
					Отклонить = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
					= ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
					Или Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью") Тогда

					Подписать = Истина;
					ОтправитьНаДоподписание = Истина;
					Подтвердить = Истина;
					Отклонить = Истина;
					СнятьПодписи = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Тогда
					Подтвердить = Истина;
					Отклонить = Истина;
					СнятьПодписи = Истина;
				ИначеЕсли Документ.Состояние = ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленоОтклонение") Или Документ.Состояние
					= ПредопределенноеЗначение(
					"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленоПодтверждение") Тогда

					ПовторнаяОтправка = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если Документ.СоответствиеДокументов = ПредопределенноеЗначение(
			"Перечисление.скEDI_СоответствиеДокументов1СиЭлектронныхДокументов.ЕстьЭлектронныйДокументНетДокумент1С") Тогда
			СоздатьДокумент1С = Истина;
		КонецЕсли;
		Если Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично") Или Документ.Состояние
			= ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьБухгалтеру")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьДиректору")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПодписанЧастично_НаПодписьПечатью")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.Подписан") Или Документ.Состояние
			= ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Отправлен")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоСообщениеОДоставке") Или Документ.Состояние
			= ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждение")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонение") Или Документ.Состояние
			= ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.Получен")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленоПодтверждение") Или Документ.Состояние
			= ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленоОтклонение")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтозванОтправителем") Или Документ.Состояние
			= ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ДокументОтозван")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленВДФС") Или Документ.Состояние
			= ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоКвитанциюОтДФС")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоПодтверждениеОтДФС") Или Документ.Состояние
			= ПредопределенноеЗначение("Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученоОтклонениеОтДФС")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ПолученОтКонтрагентаЗарегистрированыйВЕРПН")
			Или Документ.Состояние = ПредопределенноеЗначение(
			"Перечисление.скEDI_СостоянияЭлектронныхДокументов.ОтправленКонтрагентуДляРегистрацииВЕРПН") Тогда

			ЭкспортДокументов = Истина;
		КонецЕсли;
		Если Документ.НеобходимоПроведениеДокумента1С Тогда
			ПровестиДокумент1С = Истина;
		КонецЕсли;

		Если ЭтоПервыйДокумент Тогда
			Результат.Подписать = Подписать;
			Результат.ПодписатьИОтправить = ПодписатьИОтправить;
			Результат.ПодписатьИОтправитьТолькоСсылку = ПодписатьИОтправитьТолькоСсылку;
			Результат.ОтправитьНаДоподписание = ОтправитьНаДоподписание;
			Результат.ПодписатьИОтправитьВДФС = ПодписатьИОтправитьВДФС;
			Результат.Подтвердить = Подтвердить;
			//added by Al
			Результат.ВыбратьУчетныйДокумент = ВыбратьУчетныйДокумент;
			//added by Al
			Результат.Отклонить = Отклонить;
			Результат.Отозвать = Отозвать;
			Результат.ПовторнаяОтправка = ПовторнаяОтправка;
			Результат.СоздатьДокумент1С = СоздатьДокумент1С;
			Результат.ПровестиДокумент1С = ПровестиДокумент1С;
			Результат.СоздатьНовыйЭлектронныйДокумент = СоздатьНовыйЭлектронныйДокумент;
			Результат.СнятьПодписи = СнятьПодписи;
			Результат.Проверить = Проверить;
			Результат.ЭкспортДокументов = ЭкспортДокументов;
			Результат.ОтправитьЗапросОСостоянииРегистрации = ОтправитьЗапросОСостоянииРегистрации;
			Результат.СформироватьНовыйВариантЭлектронногоДокумента = СформироватьНовыйВариантЭлектронногоДокумента;
			Результат.ОтредактироватьДокумент = ОтредактироватьДокумент;
		Иначе
			Если Не Подписать Тогда
				Результат.Подписать = Ложь;
			КонецЕсли;
			Если Не ПодписатьИОтправить Тогда
				Результат.ПодписатьИОтправить = Ложь;
			КонецЕсли;
			Если Не ПодписатьИОтправитьТолькоСсылку Тогда
				Результат.ПодписатьИОтправитьТолькоСсылку = Ложь;
			КонецЕсли;
			Если Не ОтправитьНаДоподписание Тогда
				Результат.ОтправитьНаДоподписание = Ложь;
			КонецЕсли;
			Если Не ПодписатьИОтправитьВДФС Тогда
				Результат.ПодписатьИОтправитьВДФС = Ложь;
			КонецЕсли;
			Если Не Подтвердить Тогда
				Результат.Подтвердить = Ложь;
			КонецЕсли;
			//added by Al
			Если Не ВыбратьУчетныйДокумент Тогда
				Результат.ВыбратьУчетныйДокумент = Ложь;
			КонецЕсли;
			//added by Al
			Если Не Отклонить Тогда
				Результат.Отклонить = Ложь;
			КонецЕсли;
			Если Не Отозвать Тогда
				Результат.Отозвать = Ложь;
			КонецЕсли;
			Если Не ПовторнаяОтправка Тогда
				Результат.ПовторнаяОтправка = Ложь;
			КонецЕсли;
			Если Не СоздатьДокумент1С Тогда
				Результат.СоздатьДокумент1С = Ложь;
			КонецЕсли;
			Если Не ПровестиДокумент1С Тогда
				Результат.ПровестиДокумент1С = Ложь;
			КонецЕсли;
			Результат.СоздатьНовыйЭлектронныйДокумент = Ложь;
			Если Не СнятьПодписи Тогда
				Результат.СнятьПодписи = Ложь;
			КонецЕсли;
			Если Не Проверить Тогда
				Результат.Проверить = Ложь;
			КонецЕсли;
			Если Не ЭкспортДокументов Тогда
				Результат.ЭкспортДокументов = Ложь;
			КонецЕсли;
			Если Не ОтправитьЗапросОСостоянииРегистрации Тогда
				Результат.ОтправитьЗапросОСостоянииРегистрации = Ложь;
			КонецЕсли;
			Если Не СформироватьНовыйВариантЭлектронногоДокумента Тогда
				Результат.СформироватьНовыйВариантЭлектронногоДокумента = Ложь;
			КонецЕсли;
			Результат.ОтредактироватьДокумент = Ложь;
		КонецЕсли;
		ЭтоПервыйДокумент = Ложь;
	КонецЦикла;

	Возврат Результат;

КонецФункции