#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьДобавленныеКолонкиНабораЗаписей();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗаполнитьДобавленныеКолонкиНабораЗаписей();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьДобавленныеКолонкиНабораЗаписей();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийНабораЗаписей

&НаКлиенте
Процедура НаборЗаписейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	
	ЗаполнитьДобавленныеКолонкиНабораЗаписей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказательНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	СписокДоступныхВозможностейИзменнения = Новый СписокЗначений;
	СписокДоступныхВозможностейИзменнения.Добавить(ПредопределенноеЗначение("Перечисление.ИНАГРО_ИзменениеПоказателейСхемМотивации.ВводитсяПриРасчете"));
	СписокДоступныхВозможностейИзменнения.Добавить(ПредопределенноеЗначение("Перечисление.ИНАГРО_ИзменениеПоказателейСхемМотивации.ВиденНоНеРедактируетсяПриРасчете"));
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ВозможностьИзменения", СписокДоступныхВозможностейИзменнения);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",         ПараметрыОтбора);
	ПараметрыФормы.Вставить("ТекущаяСтрока", ТекущиеДанные.Показатель);	
	
	ОткрытьФорму("Справочник.ИНАГРО_ПоказателиСхемМотивации.ФормаВыбора", ПараметрыФормы, Элемент);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиНабораЗаписей()
	
	Для Каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл
		ВидПоказателя = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаНабораЗаписей.Показатель, "ВидПоказателя");
		Если ВидПоказателя <> Неопределено Тогда
			СтрокаНабораЗаписей.ВидПоказателя = ВидПоказателя;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти