#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект; 	
	
	ВестиСправочникАвтомобилей = ИНАГРО_Элеватор.ПолучитьПараметрУчетаЭлеватора(ТекущаяДата(), "ВестиСправочникАвтомобилей", Ложь);
	
	Элементы.НомерПрицепа.КнопкаВыпадающегоСписка    = ВестиСправочникАвтомобилей;
	Элементы.НомерТранспорта.КнопкаВыпадающегоСписка = ВестиСправочникАвтомобилей;
	Элементы.НомерПрицепа.КнопкаВыбора               = ВестиСправочникАвтомобилей;
	Элементы.НомерТранспорта.КнопкаВыбора            = ВестиСправочникАвтомобилей;
			
КонецПроцедуры

#КонецОбласти

