#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Печать
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Печать";
	КомандаПечати.Представление = НСтр("ru = 'Реестр ЖД накладных на ввоз'; uk = 'Реєстр ЖД накладних на ввезення'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	
	// Акт приема
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктПриема";
	КомандаПечати.Представление = НСтр("ru = 'Акт приема';uk = 'Акт прийому'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Реестр товарно-транспортных накладных (ввоз) (железнодорожная)""';uk='Реєстр документів ""Реєстр товарно-транспортних накладних (ввезення) (залізнична)""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
		
КонецПроцедуры		

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета СчетЗаказа формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Печать") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Печать", НСтр("ru = 'Реестр ЖД накладных на ввоз'; uk = 'Реєстр ЖД накладних на ввезення'"), 
		ПечатьФорма1(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_РеестрТТНВвозЖД.ПФ_MXL_Реестр", ,Истина);
		
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктПриема") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "АктПриема", НСтр("ru = 'Акт приема';uk = 'Акт прийому'"), 
		ПечатьАктПриема(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_РеестрТТНВвозЖД.ПФ_MXL_АктПриема", ,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьФорма1(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_РеестрТТНВвозЖД_ПФ_MXL_Реестр";
	
	Макет = ПолучитьМакет("ПФ_MXL_Реестр");
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИНАГРО_РеестрТТНВвозЖД.Ссылка КАК Ссылка,
		|	ИНАГРО_РеестрТТНВвозЖД.ВерсияДанных КАК ВерсияДанных,
		|	ИНАГРО_РеестрТТНВвозЖД.ПометкаУдаления КАК ПометкаУдаления,
		|	ИНАГРО_РеестрТТНВвозЖД.Номер КАК Номер,
		|	ИНАГРО_РеестрТТНВвозЖД.Дата КАК Дата,
		|	ИНАГРО_РеестрТТНВвозЖД.Проведен КАК Проведен,
		|	ИНАГРО_РеестрТТНВвозЖД.Авто КАК Авто,
		|	ИНАГРО_РеестрТТНВвозЖД.ВидХранения КАК ВидХранения,
		|	ИНАГРО_РеестрТТНВвозЖД.Владелец КАК Владелец,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьДата КАК ДоверенностьДата,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьНомер КАК ДоверенностьНомер,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьСерия КАК ДоверенностьСерия,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьЧерез КАК ДоверенностьЧерез,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ИНАГРО_РеестрТТНВвозЖД.ДокументПодтверждающийПолномочия КАК ДокументПодтверждающийПолномочия,
		|	ИНАГРО_РеестрТТНВвозЖД.Комментарий КАК Комментарий,
		|	ИНАГРО_РеестрТТНВвозЖД.МестоХранения КАК МестоХранения,
		|	ИНАГРО_РеестрТТНВвозЖД.Номенклатура КАК Номенклатура,
		|	ИНАГРО_РеестрТТНВвозЖД.ОписаниеДвиженияФормы36 КАК ОписаниеДвиженияФормы36,
		|	ИНАГРО_РеестрТТНВвозЖД.Организация КАК Организация,
		|	ИНАГРО_РеестрТТНВвозЖД.Ответственный КАК Ответственный,
		|	ИНАГРО_РеестрТТНВвозЖД.ОтражатьВБухгалтерскомУчете КАК ОтражатьВБухгалтерскомУчете,
		|	ИНАГРО_РеестрТТНВвозЖД.Получил КАК Получил,
		|	ИНАГРО_РеестрТТНВвозЖД.ПолучилПоДругомуДокументу КАК ПолучилПоДругомуДокументу,
		|	ИНАГРО_РеестрТТНВвозЖД.ПунктНазначения КАК ПунктНазначения,
		|	ИНАГРО_РеестрТТНВвозЖД.ПунктОтправления КАК ПунктОтправления,
		|	ИНАГРО_РеестрТТНВвозЖД.Склад КАК Склад,
		|	ИНАГРО_РеестрТТНВвозЖД.СчетУчетаБУ КАК СчетУчетаБУ,
		|	ИНАГРО_РеестрТТНВвозЖД.СчетУчетаВТаблице КАК СчетУчетаВТаблице,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьМасличность КАК УдалитьМасличность,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьНеРасчитыватьОстатки КАК УдалитьНеРасчитыватьОстатки,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьРодительскийДокумент КАК УдалитьРодительскийДокумент,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьСтоимостьПогрузки КАК УдалитьСтоимостьПогрузки,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьТолькоЗарегистрировать КАК УдалитьТолькоЗарегистрировать,
		|	ИНАГРО_РеестрТТНВвозЖД.Урожай КАК Урожай,
		|	ИНАГРО_РеестрТТНВвозЖД.ФизическийВес КАК ФизическийВес,
		|	ИНАГРО_РеестрТТНВвозЖД.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное
		|ИЗ
		|	Документ.ИНАГРО_РеестрТТНВвозЖД КАК ИНАГРО_РеестрТТНВвозЖД
		|ГДЕ
		|	ИНАГРО_РеестрТТНВвозЖД.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Ссылка КАК Ссылка,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерСтроки КАК НомерСтроки,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Брутто КАК Брутто,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Влажность КАК Влажность,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Влажность1 КАК Влажность1,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЗачетныйВес КАК ЗачетныйВес,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЗерноваяПримесь КАК ЗерноваяПримесь,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЗерноваяПримесь1 КАК ЗерноваяПримесь1,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Номенклатура КАК Номенклатура,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерАнализа КАК НомерАнализа,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерВагона КАК НомерВагона,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерТТН КАК НомерТТН,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Остаток КАК Остаток,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.СорнаяПримесь КАК СорнаяПримесь,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.СорнаяПримесь1 КАК СорнаяПримесь1,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.СчетУчетаБУ КАК СчетУчетаБУ,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Тара КАК Тара,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ТТН КАК ТТН,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ФизическийВес КАК ФизическийВес,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.УдалитьКачество КАК УдалитьКачество,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.УдалитьКоеффициент КАК УдалитьКоеффициент,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Масличность КАК Масличность,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.УдалитьХарактеристикаНоменклатуры КАК УдалитьХарактеристикаНоменклатуры
		|ИЗ
		|	Документ.ИНАГРО_РеестрТТНВвозЖД.СписокТТН КАК ИНАГРО_РеестрТТНВвозЖДСписокТТН
		|ГДЕ
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = МассивРезультатов[0].Выбрать();
	
	ВыборкаТЧ    = МассивРезультатов[1].Выгрузить();
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		
		Шапка.Параметры.Фирма           = ВыборкаШапка.ОрганизацияНаименованиеПолное;
		Шапка.Параметры.НомерДок        = ВыборкаШапка.Номер;
		Шапка.Параметры.ДатаДок         = Формат(ВыборкаШапка.Дата, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		Шапка.Параметры.Владелец        = ВыборкаШапка.Владелец;
		ИНАГРО_Элеватор.ПолучитьНаименованияКонтрагента(Шапка.Параметры.Владелец);
		Шапка.Параметры.ВидХранения     = ВыборкаШапка.ВидХранения;
		Шапка.Параметры.Куда            = ВыборкаШапка.ПунктОтправления;
		Шапка.Параметры.Склад           = ВыборкаШапка.Склад;
		Шапка.Параметры.Урожай          = ВыборкаШапка.Урожай;
		Шапка.Параметры.ПунктНазначения = ВыборкаШапка.ПунктНазначения;
		
		ТабДокумент.Вывести(Шапка);
		
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ФизВес = 0;
		ЗачВес = 0;
		
		ТабТЧ = ВыборкаТЧ.Скопировать(Новый Структура("Ссылка",ВыборкаШапка.Ссылка));
		
		Для Каждого Стр Из ТабТЧ Цикл
			ОблСтрока.Параметры.Заполнить(Стр);
			ФизВес = ФизВес + Стр.ФизическийВес;
			ЗачВес = ЗачВес + Стр.ЗачетныйВес;
			ТабДокумент.Вывести(ОблСтрока);
		КонецЦикла;
		
		ОблДно = Макет.ПолучитьОбласть("Дно");
		ОблДно.Параметры.ИтогФизВес = ФизВес;
		ОблДно.Параметры.ИтогЗачВес = ЗачВес;
		ТабДокумент.Вывести(ОблДно);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьАктПриема(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_РеестрТТНВвозЖД_ПФ_MXL_АктПриема";
	
	Макет = ПолучитьМакет("ПФ_MXL_АктПриема");
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИНАГРО_РеестрТТНВвозЖД.Ссылка КАК Ссылка,
		|	ИНАГРО_РеестрТТНВвозЖД.ВерсияДанных КАК ВерсияДанных,
		|	ИНАГРО_РеестрТТНВвозЖД.ПометкаУдаления КАК ПометкаУдаления,
		|	ИНАГРО_РеестрТТНВвозЖД.Номер КАК Номер,
		|	ИНАГРО_РеестрТТНВвозЖД.Дата КАК Дата,
		|	ИНАГРО_РеестрТТНВвозЖД.Проведен КАК Проведен,
		|	ИНАГРО_РеестрТТНВвозЖД.Авто КАК Авто,
		|	ИНАГРО_РеестрТТНВвозЖД.ВидХранения КАК ВидХранения,
		|	ИНАГРО_РеестрТТНВвозЖД.Владелец КАК Владелец,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьДата КАК ДоверенностьДата,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьНомер КАК ДоверенностьНомер,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьСерия КАК ДоверенностьСерия,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоверенностьЧерез КАК ДоверенностьЧерез,
		|	ИНАГРО_РеестрТТНВвозЖД.ДоговорКонтрагента КАК ДоговорКонтрагента,
		|	ИНАГРО_РеестрТТНВвозЖД.ДокументПодтверждающийПолномочия КАК ДокументПодтверждающийПолномочия,
		|	ИНАГРО_РеестрТТНВвозЖД.Комментарий КАК Комментарий,
		|	ИНАГРО_РеестрТТНВвозЖД.МестоХранения КАК МестоХранения,
		|	ИНАГРО_РеестрТТНВвозЖД.Номенклатура КАК Номенклатура,
		|	ИНАГРО_РеестрТТНВвозЖД.ОписаниеДвиженияФормы36 КАК ОписаниеДвиженияФормы36,
		|	ИНАГРО_РеестрТТНВвозЖД.Организация КАК Организация,
		|	ИНАГРО_РеестрТТНВвозЖД.Ответственный КАК Ответственный,
		|	ИНАГРО_РеестрТТНВвозЖД.ОтражатьВБухгалтерскомУчете КАК ОтражатьВБухгалтерскомУчете,
		|	ИНАГРО_РеестрТТНВвозЖД.Получил КАК Получил,
		|	ИНАГРО_РеестрТТНВвозЖД.ПолучилПоДругомуДокументу КАК ПолучилПоДругомуДокументу,
		|	ИНАГРО_РеестрТТНВвозЖД.ПунктНазначения КАК ПунктНазначения,
		|	ИНАГРО_РеестрТТНВвозЖД.ПунктОтправления КАК ПунктОтправления,
		|	ИНАГРО_РеестрТТНВвозЖД.Склад КАК Склад,
		|	ИНАГРО_РеестрТТНВвозЖД.СчетУчетаБУ КАК СчетУчетаБУ,
		|	ИНАГРО_РеестрТТНВвозЖД.СчетУчетаВТаблице КАК СчетУчетаВТаблице,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьМасличность КАК УдалитьМасличность,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьНеРасчитыватьОстатки КАК УдалитьНеРасчитыватьОстатки,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьРодительскийДокумент КАК УдалитьРодительскийДокумент,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьСтоимостьПогрузки КАК УдалитьСтоимостьПогрузки,
		|	ИНАГРО_РеестрТТНВвозЖД.УдалитьТолькоЗарегистрировать КАК УдалитьТолькоЗарегистрировать,
		|	ИНАГРО_РеестрТТНВвозЖД.Урожай КАК Урожай,
		|	ИНАГРО_РеестрТТНВвозЖД.ФизическийВес КАК ФизическийВес,
		|	ИНАГРО_РеестрТТНВвозЖД.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ИНАГРО_РеестрТТНВвозЖД.Организация.Наименование КАК ОрганизацияНаименование,
		|	ИНАГРО_РеестрТТНВвозЖД.Номенклатура.Наименование КАК НоменклатураНаименование,
		|	ИНАГРО_РеестрТТНВвозЖД.Номенклатура.НаименованиеПолное КАК НоменклатураНаименованиеПолное
		|ИЗ
		|	Документ.ИНАГРО_РеестрТТНВвозЖД КАК ИНАГРО_РеестрТТНВвозЖД
		|ГДЕ
		|	ИНАГРО_РеестрТТНВвозЖД.Ссылка В(&МассивОбъектов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Ссылка КАК Ссылка,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерСтроки КАК НомерСтроки,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Брутто КАК Брутто,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Влажность КАК Влажность,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Влажность1 КАК Влажность1,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЗачетныйВес КАК ЗачетныйВес,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЗерноваяПримесь КАК ЗерноваяПримесь,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЗерноваяПримесь1 КАК ЗерноваяПримесь1,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Номенклатура КАК Номенклатура,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерАнализа КАК НомерАнализа,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерВагона КАК НомерВагона,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.НомерТТН КАК НомерТТН,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Остаток КАК Остаток,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.СорнаяПримесь КАК СорнаяПримесь,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.СорнаяПримесь1 КАК СорнаяПримесь1,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.СчетУчетаБУ КАК СчетУчетаБУ,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Тара КАК Тара,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ТТН КАК ТТН,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.ФизическийВес КАК ФизическийВес,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.УдалитьКачество КАК УдалитьКачество,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.УдалитьКоеффициент КАК УдалитьКоеффициент,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Масличность КАК Масличность,
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.УдалитьХарактеристикаНоменклатуры КАК УдалитьХарактеристикаНоменклатуры
		|ИЗ
		|	Документ.ИНАГРО_РеестрТТНВвозЖД.СписокТТН КАК ИНАГРО_РеестрТТНВвозЖДСписокТТН
		|ГДЕ
		|	ИНАГРО_РеестрТТНВвозЖДСписокТТН.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаШапка = МассивРезультатов[0].Выбрать();
	
	ВыборкаТЧ    = МассивРезультатов[1].Выгрузить();
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(ВыборкаШапка.Организация, ВыборкаШапка.Дата);
		
		//Шапка
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.НаименованиеОрганизации = ?(ВыборкаШапка.ОрганизацияНаименованиеПолное = "",ВыборкаШапка.ОрганизацияНаименование,ВыборкаШапка.ОрганизацияНаименованиеПолное);
		ОблШапка.Параметры.НомерДок                = ВыборкаШапка.Номер;
		ОблШапка.Параметры.ДатаДок                 = Формат(ВыборкаШапка.Дата, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		ОблШапка.Параметры.Номенклатура            = ВыборкаШапка.НоменклатураНаименованиеПолное;
		ТабДокумент.Вывести(ОблШапка);
		
		ТабТЧ = ВыборкаТЧ.Скопировать(Новый Структура("Ссылка",ВыборкаШапка.Ссылка));
		
		ФизВес = 0;
		ЗачВес = 0;
		Для Каждого Стр Из ТабТЧ Цикл
			ОблСтрока = Макет.ПолучитьОбласть("Строка");
			ОблСтрока.Параметры.Заполнить(Стр);
			ФизВес = ФизВес + Стр.ФизическийВес;
			ЗачВес = ЗачВес + Стр.ЗачетныйВес;
			ТабДокумент.Вывести(ОблСтрока);
		КонецЦикла;
		
		//Дно
		ОблДно = Макет.ПолучитьОбласть("Дно");
		ОблДно.Параметры.ИтогФизВес = ФизВес; 
		ОБлДно.Параметры.ИтогЗачВес = ЗачВес;
		
		ТабДокумент.Вывести(ОблДно);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецЕсли