
&НаСервере
Процедура ВывестиОписаниеОбновленийНаСервере()
	МакетИнформацияОбОбновлениях = ПолучитьМакетСервер();
	ИнформацияОбОбновлении.Очистить();
	ИнформацияОбОбновлении.Вывести(МакетИнформацияОбОбновлениях);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОписаниеОбновлений(Команда)
	ВывестиОписаниеОбновленийНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетСервер()
	Возврат ПолучитьОбщийМакет("скEDI_ИнформацияОВерсиях");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лпИнформацияОбОбновлении = Новый ТабличныйДокумент;
	Параметры.Свойство("ИнформацияОбОбновлении", лпИнформацияОбОбновлении);
	Если ТипЗнч(лпИнформацияОбОбновлении) = Тип("ТабличныйДокумент") Тогда
		ИнформацияОбОбновлении.Вывести(лпИнформацияОбОбновлении);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИнформацияОбОбновленииВыбор(Элемент, Область, СтандартнаяОбработка)
	Если Область.Текст = "Повторне затвердження" Тогда
		ОткрытьФорму("ОбщаяФорма.скEDI_ПовторноеУтверждение", , , Ложь);
	ИначеЕсли Область.Текст = "Повторное утверждение" Тогда
		ОткрытьФорму("ОбщаяФорма.скEDI_ПовторноеУтверждение", , , Ложь);
	КонецЕсли;
КонецПроцедуры
