
&НаСервере
Процедура ВывестиОписаниеОбновленийНаСервере()
	МакетИнформацияОбОбновлениях = ПолучитьМакетСервер();
	ИнформацияОбОбновлении.Очистить();
	ИнформацияОбОбновлении.Вывести(МакетИнформацияОбОбновлениях);
КонецПроцедуры

&НаКлиенте
Процедура ВывестиОписаниеОбновлений(Команда)
	ВывестиОписаниеОбновленийНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьМакетСервер()
	Возврат ПолучитьОбщийМакет("скEDI_ИнформацияОВерсиях");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лпИнформацияОбОбновлении = Новый ТабличныйДокумент;
	Параметры.Свойство("ИнформацияОбОбновлении", лпИнформацияОбОбновлении);
	Если ТипЗнч(лпИнформацияОбОбновлении) = Тип("ТабличныйДокумент") Тогда
		ИнформацияОбОбновлении.Вывести(лпИнформацияОбОбновлении);
	КонецЕсли;
КонецПроцедуры
