#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Квитанция
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Квитанция";
	КомандаПечати.Представление = НСтр("ru = 'Квитанция на взвешивание';uk = 'Квитанція на зважування'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Товарно-транспортная накладная (железнодорожная) (ввоз)""';uk='Реєстр документів ""Товарно-транспортна накладна (залізнична) (ввезення)""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;

КонецПроцедуры		

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета СчетЗаказа формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Квитанция") Тогда
		
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Квитанция", НСтр("ru = 'Квитанция на взвешивание';uk = 'Квитанція на зважування'"), 
		ПечатьКвитанция(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_ТТНВвозЖД.ПФ_MXL_Квитанция", ,Истина);
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьКвитанция(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_РеестрТТНВвозЖД_ПФ_MXL_Квитанция";
	
	Макет = ПолучитьМакет("ПФ_MXL_Квитанция");
	
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ПервыйДокумент = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИНАГРО_ТТНВвозЖД.Ссылка,
		|	ИНАГРО_ТТНВвозЖД.ВерсияДанных,
		|	ИНАГРО_ТТНВвозЖД.ПометкаУдаления,
		|	ИНАГРО_ТТНВвозЖД.Номер,
		|	ИНАГРО_ТТНВвозЖД.Дата,
		|	ИНАГРО_ТТНВвозЖД.Проведен,
		|	ИНАГРО_ТТНВвозЖД.Вес,
		|	ИНАГРО_ТТНВвозЖД.ВесБрутто,
		|	ИНАГРО_ТТНВвозЖД.ВесНетто,
		|	ИНАГРО_ТТНВвозЖД.Весовщик,
		|	ИНАГРО_ТТНВвозЖД.ВесТары,
		|	ИНАГРО_ТТНВвозЖД.ВидЖурнала,
		|	ИНАГРО_ТТНВвозЖД.ВидХранения,
		|	ИНАГРО_ТТНВвозЖД.Владелец,
		|	ИНАГРО_ТТНВвозЖД.Влажность,
		|	ИНАГРО_ТТНВвозЖД.ВремяВыбытия,
		|	ИНАГРО_ТТНВвозЖД.ВремяПрибытия,
		|	ИНАГРО_ТТНВвозЖД.ДоговорКонтрагента,
		|	ИНАГРО_ТТНВвозЖД.ЗачетныйВес,
		|	ИНАГРО_ТТНВвозЖД.ЗерноваяПримесь,
		|	ИНАГРО_ТТНВвозЖД.Комментарий,
		|	ИНАГРО_ТТНВвозЖД.ЛабораторныйАнализ,
		|	ИНАГРО_ТТНВвозЖД.МестоХранения,
		|	ИНАГРО_ТТНВвозЖД.Номенклатура,
		|	ИНАГРО_ТТНВвозЖД.НомерАнализа,
		|	ИНАГРО_ТТНВвозЖД.НомерВагона,
		|	ИНАГРО_ТТНВвозЖД.НомерЖурнала,
		|	ИНАГРО_ТТНВвозЖД.НомерНакладной,
		|	ИНАГРО_ТТНВвозЖД.ОписаниеДвиженияФормы36,
		|	ИНАГРО_ТТНВвозЖД.Организация,
		|	ИНАГРО_ТТНВвозЖД.Ответственный,
		|	ИНАГРО_ТТНВвозЖД.Склад,
		|	ИНАГРО_ТТНВвозЖД.СорнаяПримесь,
		|	ИНАГРО_ТТНВвозЖД.ТипЖурнала,
		|	ИНАГРО_ТТНВвозЖД.Транспорт,
		|	ИНАГРО_ТТНВвозЖД.УдалитьЕдиницаИзмерения,
		|	ИНАГРО_ТТНВвозЖД.УдалитьЖурналВесовщика,
		|	ИНАГРО_ТТНВвозЖД.УдалитьОтражатьВБухгалтерскомУчете,
		|	ИНАГРО_ТТНВвозЖД.Урожай,
		|	ИНАГРО_ТТНВвозЖД.Организация.НаименованиеПолное
		|ИЗ
		|	Документ.ИНАГРО_ТТНВвозЖД КАК ИНАГРО_ТТНВвозЖД
		|ГДЕ
		|	ИНАГРО_ТТНВвозЖД.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		//Шапка
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.Заполнить(Выборка);
		ИНАГРО_Элеватор.ПолучитьНаименованияКонтрагента(ОблШапка.Параметры.Владелец);
		ОблШапка.Параметры.Организация = Выборка.ОрганизацияНаименованиеПолное;
		ВремяНачалаДня = ИНАГРО_Элеватор.ПолучитьПараметрУчетаЭлеватора(Выборка.Дата, "ВремяНачалаДня", 0);
		Если ВремяНачалаДня <> 0 Тогда
			Облшапка.Параметры.Дата = Формат(Выборка.ВремяВыбытия, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		Иначе
			Облшапка.Параметры.Дата = Формат(Выборка.Дата, "ДФ='дд ММММ гггг';Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
		КонецЕсли;
		ОблШапка.Параметры.ВесПрописью = ИНАГРО_Элеватор.ВернутьВесПрописью(КодЯзыкаПечать,Выборка.Вес);
		ТабДокумент.Вывести(ОблШапка);
		
		//Дно
		ОблДно = Макет.ПолучитьОбласть("Дно");
		ТабДокумент.Вывести(ОблДно);
		//Разделитель
		ОблРазделитель = Макет.ПолучитьОбласть("Разделитель");
		ТабДокумент.Вывести(ОблРазделитель);
		
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецЕсли