
Процедура ОткрытьФормуЗагрузкиНастроекПоШаблону(ПараметрыОткрытия, Владелец) Экспорт
	ОткрытьФорму("Справочник.скEDI_ВидыЭлектронныхДокументов.Форма.ФормаЗагрузкиНастроекПоШаблону", ПараметрыОткрытия, Владелец,,,, Новый ОписаниеОповещения("ПриЗакрытииФормыЗагрузкиНастроекПоШаблону", ПолучитьФорму("ОбщаяФорма.скEDI_ФормаНастроек"),ПараметрыОткрытия));
КонецПроцедуры

Процедура ОткрытьФормуНастроекСозданияДокументов(ПараметрыОткрытия, Владелец) Экспорт
	ОткрытьФорму("ОбщаяФорма.скEDI_ФормаНастроекСозданияДокументов", ПараметрыОткрытия,,,,,Новый ОписаниеОповещения("ПослеЗакрытияФормыНастроекСозданияДокументов", Владелец));
КонецПроцедуры

Процедура ОткрытьФормуВыбораОрганизацииEDIПриОбработкеСертификатов(ПараметрыОткрытия, СтруктураДополнительныхПараметров) Экспорт
	СписокОрганизацийЕДРПОУ = Новый СписокЗначений;
	ПараметрыОткрытия.Свойство("СписокОрганизацийЕДРПОУ", СписокОрганизацийЕДРПОУ);
	Если СписокОрганизацийЕДРПОУ.Количество() > 0 Тогда
		СписокОрганизацийЕДРПОУ.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораОрганизацииEDI", скEDI_ОбщегоНазначенияКлиент, СтруктураДополнительныхПараметров),"По данной Организации будет настроен электронный документооборот");
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьФормуВыбораФайловСертификатов(лДиалогВыбораФайлов, СтруктураПараметров) Экспорт
	лДиалогВыбораФайлов.Показать(Новый ОписаниеОповещения("ЗагрузитьСертификатыИзФайла_ПослеВыбораФайлов", скEDI_ОбщегоНазначенияКлиент, СтруктураПараметров));
КонецПроцедуры

Процедура ОткрытьФормуВыбораЕДРПОУизСпискаДляЗагрузкиСертификатов(лСписокВыбора, лТекЭлемент, СтруктураПараметров) Экспорт
	лСписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ЗагрузитьСертификатыИзИнтернета_ПослеВыбораЕДРПОУ", скEDI_ОбщегоНазначенияКлиент, СтруктураПараметров), НСтр("ru = 'Искать сертификаты по ЕДРПОУ'; uk = 'Шукати сертифікати по ЄДРПОУ'"), лТекЭлемент);
КонецПроцедуры

Процедура Вопрос_УдалитьНастройку(ТекстВопроса, Владелец) Экспорт
	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопросаУдалениеНастройки", Владелец), ТекстВопроса, РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

Процедура ВыбратьФайлФаксимиле(АдресВХранилище, ВыбраноеИмяФайла, УникальныйИдентификатор, Владелец) Экспорт
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = НСтр("ru = 'Файлы изображений'; uk = 'Файли зображень'") + " (*.png)|*.png";
	ДиалогВыбора.Заголовок =НСтр("ru = 'Выберите файл факсимиле; uk = 'Виберіть файл факсиміле'");
	ДиалогВыбора.ПредварительныйПросмотр     = Истина;
	ДиалогВыбора.ИндексФильтра               = 0;
	ДиалогВыбора.ПолноеИмяФайла              = "";
	ДиалогВыбора.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбора.МножественныйВыбор          = Ложь;

	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПомещенияФайлаФаксимиле", Владелец), АдресВХранилище, ДиалогВыбора, , УникальныйИдентификатор);	
КонецПроцедуры

Процедура ОткрытьФормуНастройкиПараметровПодписиДокументов(ПараметрыОткрытия, Владелец, ИмяМетода) Экспорт
	КлючОткрытойФормы = скEDI_ОбщегоНазначения.ПолучитьЗначениеПараметраСеанса("скEDI_КлючОткрытойФормыНастройкиПодписи");
	Если ЗначениеЗаполнено(КлючОткрытойФормы) Тогда
		ОткрытаяФормаНастройкиПодписей = ПолучитьФорму("ОбщаяФорма.скEDI_ФормаНастройкиПодписейЭлектронныхДокументов", , , КлючОткрытойФормы);
		Если ОткрытаяФормаНастройкиПодписей.Открыта() Тогда
			ОткрытаяФормаНастройкиПодписей.Закрыть();
		КонецЕсли;
	КонецЕсли;
	КлючНовойФормы = Новый УникальныйИдентификатор;
	скEDI_ОбщегоНазначения.УстановитьЗначениеПараметраСеанса("скEDI_КлючОткрытойФормыНастройкиПодписи", КлючНовойФормы);
	ОткрытьФорму("ОбщаяФорма.скEDI_ФормаНастройкиПодписейЭлектронныхДокументов", ПараметрыОткрытия, , КлючНовойФормы, , , Новый ОписаниеОповещения(ИмяМетода, Владелец));
КонецПроцедуры

Процедура скEDI_ПоказатьВводСтроки(ИмяМетода, Строка, Подсказка,Владелец, СтруктураДополнительныхПараметров) Экспорт 	
	ПоказатьВводСтроки(Новый ОписаниеОповещения(ИмяМетода, Владелец,СтруктураДополнительныхПараметров), Строка, Подсказка,,Истина); 	
КонецПроцедуры	

Процедура ВыбратьВложеныйФайл(АдресВХранилище, ВыбраноеИмяФайла, УникальныйИдентификатор, Владелец) Экспорт
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеПомещенияВложеногоФайла", Владелец), АдресВХранилище, ВыбраноеИмяФайла, , УникальныйИдентификатор);	
КонецПроцедуры
	
Процедура ПоказатьСписокВыбораВидаРегЗадания(ИмяМетода,СписокВыбора ,Владелец, СтруктураДополнительныхПараметров) Экспорт 	
	СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения(ИмяМетода, Владелец,СтруктураДополнительныхПараметров), НСтр("ru = 'Выберите вид операции регламентного задания'; uk = 'Виберіть вид операції регламентного завдання'"));
КонецПроцедуры	
	
Процедура ПоказатьДокумент1С(Документ1С) Экспорт
	ПоказатьЗначение(, Документ1С);
КонецПроцедуры

Процедура ПоказатьКвитанцию(Квитанция) Экспорт
	ПоказатьЗначение(, Квитанция);
КонецПроцедуры


Процедура ОткрытьСписокНастроекОтображенияРабочегоСтола(СписокНастроек, Владелец) Экспорт
	Если СписокНастроек.Количество() > 0 Тогда
		СписокНастроек.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораНастроекОтображения", Владелец), НСтр("ru = 'Выберите настройку отображения рабочего стола'; uk = 'Виберіть налаштування відображення робочого стола'"));
	КонецЕсли;	
КонецПроцедуры

Процедура ОткрытьФормуСохраненияПодписанныхДокументов(Владелец, Параметры) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.скEDI_ФормаДляЭкспортаДокументаСПодписями", Параметры, Владелец, ,,, Новый ОписаниеОповещения("ЭкспортДанныхДокументаДокумента", Владелец)); 	
	
КонецПроцедуры

Процедура ПолучитьФормуВыбораДанныхДляОтбора(ПараметрыФормы, Владелец) Экспорт
	
	ПолеОтбора = Неопределено;
	Если НЕ ПараметрыФормы.Свойство("ПолеОтбора", ПолеОтбора) Тогда
		Возврат;		
	КонецЕсли;

	ОткрытьФорму("ОбщаяФорма.скEDI_ФормаВыбораДанныхДляОтборов", ПараметрыФормы, Владелец, ,,, Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораДанныхДляОтборов", Владелец, ПолеОтбора)); 
	
КонецПроцедуры

Процедура ПолучитьФормуВыбораДанныхДляОтбораИли(ПараметрыФормы, Владелец) Экспорт
	
	ПолеОтбора = Неопределено;
	Если НЕ ПараметрыФормы.Свойство("ПолеОтбора", ПолеОтбора) Тогда
		Возврат;		
	КонецЕсли;

	ОткрытьФорму("ОбщаяФорма.скEDI_ФормаВыбораДанныхДляОтборовИли", ПараметрыФормы, Владелец, ,,, Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораДанныхДляОтборов", Владелец, ПолеОтбора)); 
	
КонецПроцедуры

Процедура ПоказатьПредупреждение_83(ТекстПредупреждение, ТаймАут = 0, Заголовок = "") Экспорт 
	ПоказатьПредупреждение(, ТекстПредупреждение, ТаймАут, Заголовок);
КонецПроцедуры

Процедура ОткрытьФормуВыбораШаблонаДокумента(Параметры, Владелец) Экспорт
	ОткрытьФорму("ОбщаяФорма.скEDI_ФормаВыбораШаблонаДокумента", Параметры, Владелец, ,,, Новый ОписаниеОповещения("ВыборШаблонаДокумента", Владелец)); 	
КонецПроцедуры

Процедура ОткрытьФормуКонструктораЗапроса(КонструкторЗапроса, Владелец) Экспорт
	КонструкторЗапроса.Показать(Новый ОписаниеОповещения("ПослеРедактированияТекстаЗапроса", Владелец));
КонецПроцедуры

Процедура ПоказатьВопросБезМодальности(ИмяМетодаОповещения, МодульОповещения, ПараметрыОповещения = Неопределено, ТекстВопроса, РежимДиалогаОтвета) Экспорт 
	ПоказатьВопрос(Новый ОписаниеОповещения(ИмяМетодаОповещения, МодульОповещения, ПараметрыОповещения), ТекстВопроса, РежимДиалогаОтвета);			
КонецПроцедуры

Процедура ПоказатьДиалогРасписания(Диалог, ИмяМетодаОповещения, МодульОповещения) Экспорт 
	Диалог.Показать(Новый ОписаниеОповещения(ИмяМетодаОповещения, МодульОповещения));	
КонецПроцедуры

Процедура ОткрытьФормуНастройкиРабочегоСтола(ПараметрыФормы, Владелец) Экспорт
	ОткрытьФорму("ОбщаяФорма.скEDI_ФормаНастроекРабочегоСтола", ПараметрыФормы, Владелец, ,,, Новый ОписаниеОповещения("ПослеЗакрытияФормыНастройкиРабочегоСтола", Владелец));
КонецПроцедуры

Процедура ПоказатьОтметкуЭлементовСпискаЗначений(Заголовок, ИмяМетода, СписокВыбора, Владелец, СтруктураДополнительныхПараметров = Неопределено) Экспорт
	СписокВыбора.ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения(ИмяМетода, Владелец, СтруктураДополнительныхПараметров), Заголовок);
КонецПроцедуры	
	
Процедура ПоказатьВыборЭлементаСпискаЗначений(Заголовок, ИмяМетода, СписокВыбора, Владелец, СтруктураДополнительныхПараметров = Неопределено) Экспорт
	СписокВыбора.ПоказатьВыборЭлемента(Новый ОписаниеОповещения(ИмяМетода, Владелец, СтруктураДополнительныхПараметров), Заголовок);
КонецПроцедуры	
	
Процедура ОткрытьФормуНастройкиОтправкиСсылкиНаДокумент(ПараметрыОткрытия, Владелец, ИмяМетода) Экспорт
	ОткрытьФорму("ОбщаяФорма.скEDI_НастройкаОтправкиСсылкиНаДокумент", ПараметрыОткрытия,,,,,Новый ОписаниеОповещения(ИмяМетода, Владелец));
КонецПроцедуры
	
Процедура ОткрытьФормуНастройкиКонтактныеДанныеКонтрагентов(ПараметрыОткрытия, Владелец, ИмяМетода) Экспорт
	ОткрытьФорму("РегистрСведений.скEDI_КонтактныеДанныеКонтрагентов.ФормаЗаписи", ПараметрыОткрытия,,,,,Новый ОписаниеОповещения(ИмяМетода, Владелец));
КонецПроцедуры

Процедура ОткрытьФормуВыбораФайловВложений(лДиалогВыбораФайлов, Владелец) Экспорт
	лДиалогВыбораФайлов.Показать(Новый ОписаниеОповещения("ПослеВыбораФайловДобавитьВложение", Владелец));
КонецПроцедуры

Процедура ПоказатьДиалогВыбораФайлов(лДиалогВыбораФайлов, ИмяМетодаОповещения, МодульОповещения) Экспорт
	лДиалогВыбораФайлов.Показать(Новый ОписаниеОповещения(ИмяМетодаОповещения, МодульОповещения));
КонецПроцедуры

Процедура ВызватьМетодНачатьПомещениеФайлов(ПомещаемыеФайлы, УникальныйИдентификатор, ИмяМетодаОповещения, МодульОповещения) Экспорт
	ОП = Новый ОписаниеОповещения(ИмяМетодаОповещения, МодульОповещения);
	НачатьПомещениеФайлов(ОП, ПомещаемыеФайлы, , Ложь, УникальныйИдентификатор);	
КонецПроцедуры

Процедура ВызватьМетодНачатьПомещениеФайла(ВыбраноеИмяФайла, УникальныйИдентификатор, ИмяМетодаОповещения, МодульОповещения) Экспорт
	ОП = Новый ОписаниеОповещения(ИмяМетодаОповещения, МодульОповещения);
	НачатьПомещениеФайла(ОП, , ВыбраноеИмяФайла, Ложь, УникальныйИдентификатор);	
КонецПроцедуры
