#Область СлужебныеПроцедурыИФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	БухгалтерККУ = "";
    Мастер = "";
    ЗавСклада = "";
	// Получаем необходимую СКД.
	НеобходимаяСКД = Неопределено;
	Если ЭтотОбъект.ВидФормы = "РеестрДвиженийЗернаПоВладельцам" Тогда
		НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("РеестрДвиженийЗернаПоВладельцам");
	ИначеЕсли ЭтотОбъект.ВидФормы = "Форма37Усушка" Тогда
		НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("Форма37Усушка");
    ИначеЕсли ЭтотОбъект.ВидФормы = "Форма37Общая" Тогда
        НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("Форма37Общая"); 
	ИначеЕсли ЭтотОбъект.ВидФормы = "Форма37" Тогда
		НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("Форма37");  
	ИначеЕсли ЭтотОбъект.ВидФормы = "Форма37_2021" Тогда
		НеобходимаяСКД = ЭтотОбъект.ПолучитьМакет("Форма37_2021");  
	КонецЕсли;
    
    Если ЗначениеЗаполнено(Организация) Тогда
        Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(Организация,ПериодОтчета.ДатаОкончания);
        Если Руководители <> Неопределено Тогда
            БухгалтерККУ = Руководители.БухгалтерККУ;                
            Мастер       = Руководители.СтаршийМастер;
        КонецЕсли; 
		ЄДРПОУ       = Организация.КодПоЕДРПОУ;
    КонецЕсли; 
    
    Если ЗначениеЗаполнено(Склад) Тогда
	    Если ЭтотОбъект.ВидФормы = "Форма37_2021" Тогда
			ЗавСклада = РегистрыСведений.ОтветственныеЛица.ПолучитьПоследнее(,Новый Структура("СтруктурнаяЕдиница",Склад)).ФизическоеЛицо;
		 	ДанныеФИО = Новый Структура("ФизическоеЛицо", ЗавСклада);
			ФИОСрез = РегистрыСведений.ФИОФизическихЛиц.ПолучитьПоследнее(ПериодОтчета.ДатаОкончания, ДанныеФИО);
			ЗавСклада = СокрЛ(ФИОСрез.Имя) + " " + ВРег(СокрЛП(ФИОСрез.Фамилия));
		Иначе
	        ЗавСклада = РегистрыСведений.ОтветственныеЛица.ПолучитьПоследнее(,Новый Структура("СтруктурнаяЕдиница",Склад)).ФизическоеЛицо;
	        ЗавСклада = ЗавСклада.Наименование;
   		КонецЕсли; 
   КонецЕсли; 
    // Устанавливаем выбранную СКД как основную.
	СхемаКомпоновкиДанных = НеобходимаяСКД;
	
	// Загружаем настройки выбранной СКД в компоновщик настроек.
    КомпоновщикНастроек.ЗагрузитьНастройки(НеобходимаяСКД.НастройкиПоУмолчанию);
    
    Настройки                 = КомпоновщикНастроек.Настройки;
    ПользовательскиеНастройки = КомпоновщикНастроек.ПользовательскиеНастройки;
    
    Для каждого ПараметрНастроек Из Настройки.ПараметрыДанных.Элементы Цикл
        ПараметрПользНастроек = ПользовательскиеНастройки.Элементы.Найти(ПараметрНастроек.ИдентификаторПользовательскойНастройки);           
    	Если НЕ ПараметрПользНастроек = Неопределено Тогда
            Если Строка(ПараметрНастроек.Параметр) =  "БухгалтерККУ"  Тогда
                 ПараметрПользНастроек.Значение      =  БухгалтерККУ 
            ИначеЕсли Строка(ПараметрНастроек.Параметр) = "Мастер" Тогда
                 ПараметрПользНастроек.Значение      =  Мастер
            ИначеЕсли Строка(ПараметрНастроек.Параметр) = "ЗавСкладом" Тогда
                 ПараметрПользНастроек.Значение      = ЗавСклада
            ИначеЕсли Строка(ПараметрНастроек.Параметр) = "ЄДРПОУ" Тогда
                 ПараметрПользНастроек.Значение      = ЄДРПОУ
            ИначеЕсли Строка(ПараметрНастроек.Параметр) = "Склад" Тогда
                Если ЗначениеЗаполнено(Склад) Тогда
                    ПараметрПользНастроек.Значение  = Склад.Наименование;
                Иначе	
                    ПараметрПользНастроек.Значение  = "";
                КонецЕсли; 
                
            ИначеЕсли   ЗначениеЗаполнено(ЭтотОбъект[Строка(ПараметрНастроек.Параметр)])  Тогда
                ПараметрПользНастроек.Использование = Истина;
                ПараметрПользНастроек.Значение      = ЭтотОбъект[Строка(ПараметрНастроек.Параметр)];
            Иначе	
                ПараметрПользНастроек.Использование = Ложь;
            КонецЕсли; 
         КонецЕсли; 
    КонецЦикла; 
    
    Для каждого ОтборНастройки Из Настройки.Отбор.Элементы Цикл
        ПользовательскийПараметр = ПользовательскиеНастройки.Элементы.Найти(ОтборНастройки.ИдентификаторПользовательскойНастройки);
        Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
            Если ЗначениеЗаполнено(ЭтотОбъект[Строка(ОтборНастройки.ЛевоеЗначение)]) Тогда
                ПользовательскийПараметр.ВидСравнения   = ОтборНастройки.ВидСравнения;
                ПользовательскийПараметр.ПравоеЗначение = ЭтотОбъект[Строка(ОтборНастройки.ЛевоеЗначение)];
                ПользовательскийПараметр.Использование  = Истина;
            Иначе
                ПользовательскийПараметр.Использование  = Ложь;
            КонецЕсли; 
        КонецЕсли;
    КонецЦикла; 
    
    Если НЕ ЭтотОбъект.ВидФормы = "Форма37Общая" И НЕ ЭтотОбъект.ВидФормы = "Форма37_2021" Тогда
        Для каждого ЭлПользовательскихНастроек Из ПользовательскиеНастройки.Элементы Цикл
            Если ТипЗнч(ЭлПользовательскихНастроек) = Тип("ГруппировкаКомпоновкиДанных") Тогда
                 ЭлПользовательскихНастроек.Использование = ПоказыватьДокументы;
            КонецЕсли; 
        КонецЦикла; 
    КонецЕсли;

    КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
    	
     //Выводим поле "Условное списание"
	 //Если ЭтотОбъект.ВидФормы = "РеестрДвиженийЗернаПоВладельцам" Тогда
	 //    Если УсловноеСписание = Истина Тогда	
	 //        КомпоновщикНастроек.Настройки.Выбор.Элементы[5].Использование = Истина;
	 //    Иначе
	 //        КомпоновщикНастроек.Настройки.Выбор.Элементы[5].Использование = Ложь;
	 //    КонецЕсли;
	 //КонецЕсли;
	
КонецПроцедуры

#КонецОбласти