#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЭтотОбъект[0].Контрагент) И ЗначениеЗаполнено(ЭтотОбъект[0].ДоговорКонтрагента) Тогда
		ЭтотОбъект[0].Контрагент = БухгалтерскийУчетПереопределяемый.ПолучитьКонтрагентаПоДоговору(ЭтотОбъект[0].ДоговорКонтрагента);
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ПустоеЗначениеДоговора = БухгалтерскийУчетПереопределяемый.ПолучитьПустоеЗначениеДоговора();

	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.ДоговорКонтрагента) И Запись.ДоговорКонтрагента <> ПустоеЗначениеДоговора Тогда
			Запись.ДоговорКонтрагента = ПустоеЗначениеДоговора;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли