#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
						
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Ввод новых документов ""Анализ ввоза и вывоза собственного зерна (элеватор)"" запрещен!';uk='Введення нових документів ""Аналіз ввезення та вивезення власного зерна (елеватор)"" заборонене!'");
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
			
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

#КонецОбласти