#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
						
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Ввод новых документов ""Перенос остатков со счета 2311 на 2312"" запрещен. 
		|Для переноса остатков со счета 2311 на 2312 используйте документ ""Корректировка затрат""!';uk='Введення нових документів ""Перенесення залишків з рахунку 2311 на 2312"" заборонене.
		|Для перенесення залишків з рахунку 2311 на 2312 використовуйте документ ""Коригування витрат""!'");
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
			
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

#КонецОбласти