#Если Клиент Тогда 
	// Функция возвращает форму рабочего стола при открытии задачи бизнес процесса.
	Функция ПолучитьФормуРабочегоСтола(ФормаВладелец=неопределено ,КлючУникальности=неопределено) Экспорт 
		//Если ФормаВладелец=неопределено тогда 
		//	ФормаВладелец = Обработки.ИНАГРО_ПанельБизнесОпераций.ПолучитьФорму("ОсновнаяФорма");
		//КонецЕсли;
		Если ЭтотОбъект.ТипФормы = 1 Тогда 
			ИмяОбработки = Лев(ОбработкаВСоставеКонфигурации,(Найти(ОбработкаВСоставеКонфигурации,"(")-1));
			ИмяФормы = Лев(ФормаВСоставеКонфигурации,(Найти(ФормаВСоставеКонфигурации,"(")-1));
			если КлючУникальности=Неопределено Тогда 
				ФормаРабочегоСтола = Обработки[ИмяОбработки].ПолучитьФорму(ИмяФормы,ФормаВладелец);
			иначе 
				ФормаРабочегоСтола = Обработки[ИмяОбработки].ПолучитьФорму(ИмяФормы,ФормаВладелец,КлючУникальности);
			КонецЕсли;
			Возврат ФормаРабочегоСтола;
			
		ИначеЕсли ЭтотОбъект.ТипФормы = 2 Тогда
			ОбъектВнешняяОбработка = ВнешниеОбработки.Создать(ВнешняяОбработка);
			ИмяФормы = Лев(ВнешняяФорма,(Найти(ВнешняяФорма,"(")-1));
			если КлючУникальности=Неопределено Тогда 
				ФормаРабочегоСтола = ОбъектВнешняяОбработка.ПолучитьФорму(ИмяФормы,ФормаВладелец);
			иначе 
				ФормаРабочегоСтола = ОбъектВнешняяОбработка.ПолучитьФорму(ИмяФормы,ФормаВладелец,КлючУникальности);
			КонецЕсли;
			
			Возврат ФормаРабочегоСтола;
		ИначеЕсли ЭтотОбъект.ТипФормы = 3 Тогда
			
		КонецЕсли;
	КонецФункции
#КонецЕсли


