#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ИНАГРО_Элеватор.ПолучитьПараметрУчетаЭлеватора(ТекущаяДата(), "ВестиСправочникАвтомобилей", Ложь) Тогда
		НомерПрицепа    = Справочники.ИНАГРО_ТранспортныеСредства.ПустаяСсылка();
		НомерТранспорта = Справочники.ИНАГРО_ТранспортныеСредства.ПустаяСсылка();			
	Иначе
		НомерПрицепа    = "";
		НомерТранспорта = "";
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли