#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

&НаСервере
Процедура МаркаМодельТСПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.ДлиннаТС) Тогда
		Объект.ДлиннаТС = Объект.МаркаМодельТС.ДлиннаТС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ШиринаТС) Тогда
		Объект.ШиринаТС = Объект.МаркаМодельТС.ШиринаТС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВысотаТС) Тогда
		Объект.ВысотаТС = Объект.МаркаМодельТС.ВысотаТС;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ВесТранспорта) Тогда
		Объект.ВесТранспорта = Объект.МаркаМодельТС.ВесТранспорта;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркаМодельТСПриИзменении(Элемент)
	МаркаМодельТСПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти 
