
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	лМассивТолькоПросмотр = Неопределено;
	Если Параметры.Свойство("МассивТолькоПросмотр", лМассивТолькоПросмотр) Тогда
		Если ТипЗнч(лМассивТолькоПросмотр) = Тип("ФиксированныйМассив") или ТипЗнч(лМассивТолькоПросмотр) = Тип("Массив") Тогда
			Для Каждого ЭлементМассива Из лМассивТолькоПросмотр Цикл
				Элементы[ЭлементМассива].ТолькоПросмотр = Истина;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	Если Записать() Тогда
		Результат = Новый Структура;
		Результат.Вставить("ЕДРПОУКонтрагента", Запись.ЕДРПОУКонтрагента);
		Результат.Вставить("ЭлектроннаяПочта", Запись.ЭлектроннаяПочта);
		Результат.Вставить("Контрагент", Запись.Контрагент);
		Результат.Вставить("Комментарий", Запись.Комментарий);
		Результат.Вставить("ОтправлятьСсылкуНаДокументАвтоматически", Запись.ОтправлятьСсылкуНаДокументАвтоматически);
		Закрыть(Новый ФиксированнаяСтруктура(Результат));
	КонецЕсли;
КонецПроцедуры

Функция Проверить(Значение, ОбязательныйСимвол, ЗапретныеСимволы)
	ОбязательныйСимвол = ВРег(ОбязательныйСимвол);
	ЗапретныеСимволы = ВРег(ЗапретныеСимволы);
	ОбязательныйСимволНайден = Ложь;
	Для Н = 1 по СтрДлина(Значение) Цикл
		ТекСимвол = ВРег(Сред(Значение, Н, 1));
		Если ОбязательныйСимволНайден Тогда
			Если ТекСимвол = ОбязательныйСимвол Тогда
				Возврат Ложь;
			КонецЕсли;
		Иначе
			Если ТекСимвол = ОбязательныйСимвол Тогда
				ОбязательныйСимволНайден = Истина;
			КонецЕсли;
		КонецЕсли;
		Если Найти(ЗапретныеСимволы, ТекСимвол) > 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Если ОбязательныйСимволНайден Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ЗначениеЗаполнено(Запись.ЭлектроннаяПочта) Тогда
		Если Не Проверить(Запись.ЭлектроннаяПочта, "@", "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦШЩЪЫЬЭЮЯҐЄІЇ") Тогда
			Сообщить(НСтр("ru = 'Адрес электронной почты не корректный.'; uk = 'Адреса електронної пошти не коректна.'"));
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
