#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("ДатаОкончания") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Параметры.ДатаОкончания);
	КонецЕсли;	
	Если Параметры.Свойство("ВидПеревозки") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("ВидПеревозки",  Параметры.ВидПеревозки);
	КонецЕсли;

	УстановленРежимВыбора = Параметры.РежимВыбора;

	Если УстановленРежимВыбора Тогда
		ЭтаФорма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 
	        
#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

	Если УстановленРежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		ОповеститьОВыборе(Элемент.ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСписокВыборНажатие(Команда)

	Если УстановленРежимВыбора Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ОповеститьОВыборе(ТекущиеДанные);
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

#КонецОбласти