// Выполняет движения по списанию топлива документа ИНАГРО_ПутевойЛистТрактористаМашиниста.
//
//  Параметры:
//		ДокОбъект                 - ДокументОбъект
//		СтруктураШапкиДокумента   - Структура - структура реквизитов шапки документа
//		ТаблицаПоПутевымЛистам    - ТаблицаЗначений
//		ТаблицаТопливо            - ТаблицаЗначений
//		ТаблицаПоВыпускуПродукции - ТаблицаЗначений
//		ТаблицаТопливоСливТоплива - ТаблицаЗначений
//      Отказ                     - Булево - если Истина, отказ от проведения документа
//      Заголовок                 - Строка - заголовок для сообщений об ошибках проведения
//
Процедура ИНАГРО_ДвиженияПоТопливу(ДокОбъект,СтруктураШапкиДокумента,ТаблицаПоПутевымЛистам,ТаблицаТопливо,ТаблицаПоВыпускуПродукции,ТаблицаТопливоСливТоплива,Отказ,Заголовок) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Обр.ИНАГРО_ДвиженияПоТопливу(ДокОбъект, СтруктураШапкиДокумента, ТаблицаПоПутевымЛистам, ТаблицаТопливо, ТаблицаПоВыпускуПродукции, ТаблицаТопливоСливТоплива, Отказ, Заголовок);
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

// Делает движения по регистру ИНАГРО_МатериалыСписанныеНаТранспорт.
//
//  Параметры:
//		Движения       		    - КоллекцияДвижений - коллекция движений документа
//		ТаблицаПоТоварам	    - ТаблицаЗначений - таблица по которой выполняются движения
//		СтруктураШапкиДокумента	- Структура - структура реквизитов шапки документа
//
Процедура ИНАГРО_ДвижениеПоМатериаламСписаннымНаТранспорт(Движения, ТаблицаПоТоварам, СтруктураШапкиДокумента) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Обр.ИНАГРО_ДвижениеПоМатериаламСписаннымНаТранспорт(Движения, ТаблицаПоТоварам, СтруктураШапкиДокумента);
	КонецЕсли;
КонецПроцедуры

// Подготавливает таблицу выпуска продукции автотранспорт по операциям
//
//  Параметры:
//		СтруктураШапкиДокумента	- Структура - структура реквизитов шапки документа
//
//	Возвращаемое значение:
//  	ТаблицаЗначений         - таблица выпуска продукции автотранспорт по операциям
//
Функция ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииАвтотранспортПоОперациям(СтруктураШапкиДокумента) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииАвтотранспортПоОперациям(СтруктураШапкиДокумента);
	КонецЕсли;
КонецФункции

// Подготавливает таблицу выпуска продукции сельхозтехника по операциям
//
//  Параметры:
//		СтруктураШапкиДокумента	- Структура - структура реквизитов шапки документа
//
//	Возвращаемое значение:
//  	ТаблицаЗначений         - таблица выпуска продукции автотранспорт по операциям
//
Функция ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииСельхозтехникаПоОперациям(СтруктураШапкиДокумента) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьТаблицуВыпускаПродукцииСельхозтехникаПоОперациям(СтруктураШапкиДокумента);
	КонецЕсли;
КонецФункции

// Выгружает результат запроса в таблицу значений, добавляет ей необходимые колонки для проведения.
//
//  Параметры: 
//  	РезультатЗапросаПоПутевымЛистам - результат запроса по табличной части "ПутевыеЛисты"
// 	 СтруктураШапкиДокумента	        - Структура - структура реквизитов шапки документа
//
//  Возвращаемое значение:
//  	ТаблицаЗначений                 - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_АТ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_АТ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента);
	КонецЕсли;
КонецФункции

// Выгружает результат запроса в таблицу значений, добавляет ей необходимые колонки для проведения.
//
//  Параметры: 
//  	РезультатЗапросаПоПутевымЛистам - результат запроса по табличной части "ПутевыеЛисты"
// 		СтруктураШапкиДокумента	        - Структура - структура реквизитов шапки документа
//      Отказ                           - Булево - если Истина, отказ от проведения документа
//
//  Возвращаемое значение:
//  	ТаблицаЗначений                 - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_ТМ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента, Отказ) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьТаблицуПутевыеЛисты_ТМ(РезультатЗапросаПоПутевымЛистам, СтруктураШапкиДокумента, Отказ);
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецФункции

// Формирует выборку путевых листов для ЗП АТ.
//
//  Параметры:
//		СсылкаНаОбъект   - ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля
//
//  Возвращаемое значение:
//  	Выборка          - выборка по результату запроса
//
Функция ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_АТ(СсылкаНаОбъект) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_АТ(СсылкаНаОбъект);
	КонецЕсли;
КонецФункции

// Формирует выборку путевых листов для ЗП ТМ.
//
//  Параметры:
//		СсылкаНаОбъект   - ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста
//
//  Возвращаемое значение:
//  	Выборка          - выборка по результату запроса
//
Функция ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_ТМ(СсылкаНаОбъект) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьВыборкуПутевыеЛистыДляЗП_ТМ(СсылкаНаОбъект);
	КонецЕсли;
КонецФункции

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
//  Параметры:
//		ЭтотОбъект                - ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля, ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста
//  	РезультатЗапросаПоТопливу - результат запроса по табличной части "Топливо"
//  	СтруктураШапкиДокумента   - Структура - структура реквизитов шапки документа
//		СливТоплива               - Булево
//
//  Возвращаемое значение:
//  	ТаблицаЗначений           - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуТопливо(ЭтотОбъект, РезультатЗапросаПоТопливу, СтруктураШапкиДокумента, СливТоплива = 0) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьТаблицуТопливо(ЭтотОбъект, РезультатЗапросаПоТопливу, СтруктураШапкиДокумента, СливТоплива);
	КонецЕсли;
КонецФункции

// Выгружает результат запроса в табличную часть, добавляет ей необходимые колонки для проведения.
//
//  Параметры:
//		ЭтотОбъект                               - ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля, ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста
//  	РезультатЗапросаПоТопливоИзрасходованное - результат запроса по табличной части "ТопливоИзрасходованно"
//  	СтруктураШапкиДокумента                  - Структура - структура реквизитов шапки документа
//
//  Возвращаемое значение:
//  	ТаблицаЗначений                          - таблица значений с необходимыми колонками для проведения
//
Функция ИНАГРО_ПодготовитьТаблицуТопливоИзрасходованное(ЭтотОбъект, РезультатЗапросаПоТопливоИзрасходованное, СтруктураШапкиДокумента) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПодготовитьТаблицуТопливоИзрасходованное(ЭтотОбъект, РезультатЗапросаПоТопливоИзрасходованное, СтруктураШапкиДокумента);
	КонецЕсли;
КонецФункции

// Возвращает коэффициент перерасчета топлива.
//
//  Параметры:
//		ТранспортноеСредство - СправочникСсылка.ИНАГРО_МоделиТС
//  	Топливо              - СправочникСсылка.Номенклатура
//
//  Возвращаемое значение:
//  	Число                - коэффициент пересчета в основное топливо
//      Неопределено
//
Функция ПолучитьКоэффициентПересчетаВОсновноеТопливо(ТранспортноеСредство, Топливо) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ПолучитьКоэффициентПересчетаВОсновноеТопливо(ТранспортноеСредство, Топливо);
	КонецЕсли;
КонецФункции

// Определяет расценки технологической операции на дату.
//
//  Параметры:
//		ДатаРасценок            - Дата
//  	АвтомобильМодель        - СправочникСсылка.ОсновныеСредства
//  	ТехнологическаяОперация - СправочникСсылка.ИНАГРО_ТехнологическиеОперации
//  	Прицеп                  - СправочникСсылка.ИНАГРО_МоделиТС
//  	Организация             - СправочникСсылка.Организации
//
//  Возвращаемое значение:
//  	Структура                - структура расценок
//
Функция ИНАГРО_ПолучитьСтруктуруРасценок(ДатаРасценок,АвтомобильМодель = Неопределено,ТехнологическаяОперация = Неопределено,Прицеп = Неопределено,Организация = Неопределено) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПолучитьСтруктуруРасценок(ДатаРасценок, АвтомобильМодель, ТехнологическаяОперация, Прицеп, Организация);
	КонецЕсли;
КонецФункции

// Определяет расценки технологической операции на дату для сельскохозяйственной техники.  
//
//  Параметры:
//		ДатаРасценок            - Дата
//  	МаркаСельхозтехники     - СправочникСсылка.ОсновныеСредства
//  	ТехнологическаяОперация - СправочникСсылка.ИНАГРО_ТехнологическиеОперации
//  	МаркаАгрегата           - СправочникСсылка.ИНАГРО_МоделиТС
//  	Организация             - СправочникСсылка.Организации
//
//  Возвращаемое значение:
//  	Структура                - структура расценок
//
Функция ИНАГРО_ПолучитьСтруктуруРасценокВидыРаботСХТехники(ДатаРасценок,МаркаСельхозтехники = Неопределено,ТехнологическаяОперация = Неопределено,МаркаАгрегата = Неопределено,Организация = Неопределено) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_ПолучитьСтруктуруРасценокВидыРаботСХТехники(ДатаРасценок, МаркаСельхозтехники, ТехнологическаяОперация, МаркаАгрегата, Организация);
	КонецЕсли;
КонецФункции

// Возвращает показатели спидометра и бака для ТС на заданную дату, за исключением данных 
// внесенных документом источником, в случае повторного вызова после проведения.
//
//  Параметры:
//		Дата             - Дата
//  	ОсновноеСредство - СправочникСсылка.ОсновныеСредства
//  	Документ         - ДокументСсылка.ИНАГРО_ВводНачальныхОстатковТоплива,
//                         ДокументСсылка.ИНАГРО_ПередачаТоплива,
//                         ДокументСсылка.ИНАГРО_ПутевойЛистГрузовогоАвтомобиля,
//                         ДокументСсылка.ИНАГРО_ПутевойЛистТрактористаМашиниста,
//                         ДокументСсылка.ИНАГРО_СливТоплива
//
//  Возвращаемое значение:
//  	Структура        - структура показаний спидометра и бака
//
Функция ПолучитьПоказанияСпидометраИБака(Дата, ОсновноеСредство, Документ) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ПолучитьПоказанияСпидометраИБака(Дата, ОсновноеСредство, Документ);
	КонецЕсли;
КонецФункции

// Возвращает нормы расхода топлива.
//
//  Параметры:
//  	ДатаНорм      - дата, на которую определяются нормы.
//  	Авто		  - ОС, для которого определяются нормы.
//  Возвращаемое значение:
//  	Структура
//
Функция ИНАГРО_НормыРасходаТоплива(ДатаНорм, Авто) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_ТранспортСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ИНАГРО_НормыРасходаТоплива(ДатаНорм, Авто);
	КонецЕсли;
КонецФункции

