#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НеПроводитьДокументамиРеестрТТНВывозПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьСистемуКонтроляКачестваПартийЗернаПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура НеСписыватьОтходыСВладельцевПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособНачисленияОплатыЗаОчисткуСушкуПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВестиМониторингПодозрительныхСобытийПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидВесаДляКонтроляПревышенияНадОстаткамиВПриказеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
		
	Элементы = Форма.Элементы;
	Запись   = Форма.Запись;	
	
	Элементы.ВыставлятьУслугиОчисткиСушкиПоФактическимПоказателям.Доступность = Запись.ИспользоватьСистемуКонтроляКачестваПартийЗерна;
	Элементы.СтепеньКонтроляВесаТары.Доступность							  = Запись.ВестиМониторингПодозрительныхСобытий;
	Элементы.СтепеньКонтроляИзмененияВесаНакладной.Доступность				  = Запись.ВестиМониторингПодозрительныхСобытий;
	Элементы.СтепеньКонтроляОткрытияДокументов.Доступность					  = Запись.ВестиМониторингПодозрительныхСобытий;		
	Элементы.УровеньКонтроляПревышенияВесаВПриказеНадОстатками.Доступность 	  = ЗначениеЗаполнено(Запись.ВидВесаДляКонтроляПревышенияВПриказеНадОстатками);
	Элементы.ФормироватьРеестрыТТНВывозДляОтходов3Кат.Доступность 			  = Запись.НеПроводитьДокументамиРеестрТТНВывоз;
	Элементы.ВладелецДляОтходов.Доступность								      = Запись.НеСписыватьОтходыСВладельцев;
	Элементы.ГруппаИсключения.Видимость	    		         				  = Запись.НеСписыватьОтходыСВладельцев;		
	Элементы.СпособРасчетаВесаНаОчисткуСушкуДляУслуг.Видимость				  = НЕ Запись.СпособНачисленияОплатыЗаОчисткуСушку = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку.БезУчетаТехнологическогоЦикла");
	
	Если Запись.СпособНачисленияОплатыЗаОчисткуСушку = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку.СначалаЧистимПотомСушим") Тогда
		Элементы.СпособРасчетаВесаНаОчисткуСушкуДляУслуг.Заголовок = НСтр("ru='Способ расчета веса на сушку:';uk='Спосіб розрахунку ваги на сушіння:'");
	ИначеЕсли Запись.СпособНачисленияОплатыЗаОчисткуСушку = ПредопределенноеЗначение("Перечисление.ИНАГРО_СпособыНачисленияОплатыЗаОчисткуСушку.СначалаСушимПотомЧистим") Тогда
		Элементы.СпособРасчетаВесаНаОчисткуСушкуДляУслуг.Заголовок = НСтр("ru='Способ расчета веса на очистку:';uk='Спосіб розрахунку ваги на очищення:'");
	КонецЕсли;
			
КонецПроцедуры

#КонецОбласти