// ИНАГРО ++

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Функция возвращает коэффициент единицы измерения
// Параметры:
// Номенклатура - СправочникСсылка.Номенклатура - указываем номенклатуру.
// ЕдиницаИзмерения - СправочникСсылка.КлассификаторЕдиницИзмерения - указываем единицу измерения.
// Возвращаемое значение:
// Коэффициент - коэффициент единицы измерения
//
Функция ПолучитьКоэффициентЕдиницыИзмерения(Номенклатура, ЕдиницаИзмерения) Экспорт
	
	ЕдиницаИзмеренияНоменклатуры = Номенклатура.ЕдиницыИзмерения.Найти(ЕдиницаИзмерения, "ЕдиницаИзмерения");									  
	
	Если ЕдиницаИзмеренияНоменклатуры = Неопределено Тогда
		Коэффициент	= 1;
	Иначе
		Коэффициент = ЕдиницаИзмеренияНоменклатуры.Коэффициент;	
	КонецЕсли;

	Если Коэффициент = 0 Тогда
		Коэффициент = 1;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции  

#КонецОбласти

#КонецЕсли

// ИНАГРО --
