
Функция БП_ДанныеФизЛица(Организация, ФизЛицо, Дата) Экспорт
	ИДКонфигурации  = скEDI_НастройкиПодКонфигурацию.ИДКонфигурации();
	
	ДанныеФизЛица = Неопределено;
	
	Если ИДКонфигурации = "БП"
		ИЛИ ИДКонфигурации = "УТП"
		ИЛИ ИДКонфигурации = "УПП" Тогда
		Выполнить("ДанныеФизЛица = ОбщегоНазначения.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "БП20" Тогда
		Выполнить("ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "УНФ" Тогда
		Выполнить("ДанныеФизЛица = Справочники.ФизическиеЛица.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "УТ30"
		ИЛИ ИДКонфигурации = "УТ31" 
		//ИЛИ ИДКонфигурации = "FlyDoc" 
		Тогда
		Выполнить("ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, ФизЛицо, Дата);");
	ИначеЕсли ИДКонфигурации = "BASУТ" ИЛИ ИДКонфигурации = "BASКУП" ИЛИ ИДКонфигурации = "BASERP" Тогда
		
		ДанныеФИО = Неопределено;
		
		Выполнить("ДанныеФИО = ФизическиеЛицаУТ.ФамилияИмяОтчество(ФизЛицо, Дата);");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтветственныеЛицаОрганизаций.Должность
		|ИЗ
		|	Справочник.ОтветственныеЛицаОрганизаций КАК ОтветственныеЛицаОрганизаций
		|ГДЕ
		|	ОтветственныеЛицаОрганизаций.ФизическоеЛицо = &ФЛ";
		
		Запрос.УстановитьПараметр("ФЛ", ФизЛицо);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
				
		ДанныеФизЛица = Новый Структура;
		ДанныеФизЛица.Вставить("Должность", Выборка.Должность);
		ДанныеФизЛица.Вставить("Фамилия", ДанныеФИО.Фамилия);
		ДанныеФизЛица.Вставить("Имя", ДанныеФИО.Имя);
		ДанныеФизЛица.Вставить("Отчество", ДанныеФИО.Отчество);
	//ИначеЕсли ИДКонфигурации = "УТ" Тогда
	КонецЕсли;
	Возврат ДанныеФизЛица;
КонецФункции

Функция БП_ПолучитьФИО(Организация, ФизЛицо, Дата) Экспорт
	ДанныеФизЛица = БП_ДанныеФизЛица(Организация, ФизЛицо, Дата);
	ФИОФизЛица = ?(ДанныеФизЛица.Фамилия = Неопределено, "", ДанныеФизЛица.Фамилия + " ") + 
						?(ДанныеФизЛица.Имя = Неопределено, "", ДанныеФизЛица.Имя + " ") +
						?(ДанныеФизЛица.Отчество = Неопределено, "", ДанныеФизЛица.Отчество);
	Возврат СокрЛП(ФИОФизЛица);
КонецФункции

Функция БП_ПолучитьДолжность(Организация, ФизЛицо, Дата) Экспорт
	ДанныеФизЛица = БП_ДанныеФизЛица(Организация, ФизЛицо, Дата);
	ДолжностьФизЛица = СокрЛП(ДанныеФизЛица.Должность);
	Возврат ДолжностьФизЛица;
КонецФункции

Функция БП_ПолучитьДолжностьФИО(Организация, ФизЛицо, Дата) Экспорт
	ДанныеФизЛица = БП_ДанныеФизЛица(Организация, ФизЛицо, Дата);
	ДолжностьФизЛица = СокрЛП(ДанныеФизЛица.Должность);
	
	ДолжностьФИОФизЛица = ?(ЗначениеЗаполнено(ДолжностьФизЛица), ДолжностьФизЛица + " ", "") + 
						?(ДанныеФизЛица.Фамилия = Неопределено, "", ДанныеФизЛица.Фамилия + " ") + 
						?(ДанныеФизЛица.Имя = Неопределено, "", ДанныеФизЛица.Имя + " ") +
						?(ДанныеФизЛица.Отчество = Неопределено, "", ДанныеФизЛица.Отчество);
	Возврат СокрЛП(ДолжностьФИОФизЛица);
КонецФункции

