#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура устанавливает счета учета
//
// Параметры:
// Объект - СправочникСсылка - объект контактной информации
//
Процедура УстановитьСчетаУчета(Объект) Экспорт
	
	ИспользуемыеКлассыСчетовРасходов = УчетнаяПолитика.ИспользуемыеКлассыСчетовРасходов(Объект.Организация, Объект.Дата);
		
	СчетУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетУчетаПрочий(Объект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетЗатратКурсоваяРазницаПокупкаПродажаВалюты);
	Объект.СчетЗатратКурсоваяРазница	  = СчетУчета.СчетУчетаБУ;
	Объект.Субконто1ЗатратКурсоваяРазница = СчетУчета.Субконто1;
	Объект.Субконто2ЗатратКурсоваяРазница = СчетУчета.Субконто2;
	Объект.Субконто3ЗатратКурсоваяРазница = СчетУчета.Субконто3;	
	Если НЕ ЗначениеЗаполнено(Объект.СчетЗатратКурсоваяРазница) Тогда
		Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8 Тогда
			Объект.СчетЗатратКурсоваяРазница = ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе
			Объект.СчетЗатратКурсоваяРазница = ПланыСчетов.Хозрасчетный.ЗатратыОтОперационнойКурсовойРазницы;
		КонецЕсли;
	КонецЕсли;
	
	СчетУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетУчетаПрочий(Объект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетДоходовКурсоваяРазницаПокупкаПродажаВалюты);
	Объект.СчетДоходовКурсоваяРазница	   = СчетУчета.СчетУчетаБУ;
	Объект.Субконто1ДоходовКурсоваяРазница = СчетУчета.Субконто1;
	Объект.Субконто2ДоходовКурсоваяРазница = СчетУчета.Субконто2;
	Объект.Субконто3ДоходовКурсоваяРазница = СчетУчета.Субконто3;	
	Если НЕ ЗначениеЗаполнено(Объект.СчетДоходовКурсоваяРазница) Тогда
		Объект.СчетДоходовКурсоваяРазница = ПланыСчетов.Хозрасчетный.ДоходОтОперационнойКурсовойРазницы;
	КонецЕсли; 
	
	СчетУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетУчетаПрочий(Объект.Организация, Перечисления.ВидыПрочихСчетовУчета.СчетЗатратКомиссионныеПокупкаПродажаВалюты);
	Объект.СчетЗатратКомиссионные	   = СчетУчета.СчетУчетаБУ;
	Объект.Субконто1ЗатратКомиссионные = СчетУчета.Субконто1;
	Объект.Субконто2ЗатратКомиссионные = СчетУчета.Субконто2;
	Объект.Субконто3ЗатратКомиссионные = СчетУчета.Субконто3;	
	Если НЕ ЗначениеЗаполнено(Объект.СчетЗатратКомиссионные) Тогда
		Если ИспользуемыеКлассыСчетовРасходов = Перечисления.КлассыСчетовРасходов.Класс8 Тогда
			Объект.СчетЗатратКомиссионные = ПланыСчетов.Хозрасчетный.ДругиеОперационныеЗатраты;
		Иначе
			Объект.СчетЗатратКомиссионные = ПланыСчетов.Хозрасчетный.АдминистративныеРасходы;
		КонецЕсли;
	КонецЕсли;    	
		
КонецПроцедуры

#КонецОбласти 

#КонецЕсли