#Область ПрограммныйИнтерфейс
		
// Установка доступности переданных реквизитов формы
//
//  Параметры:
// 		Форма                       - Форма объекта
//  	СписокРеквизитов            - Структура - 
//  	ЛабораторияРаботаетВСистеме - Булево - параметр учета элеватора
//  	ИзменятьВидимость           - Булево - Истина, если заполнен реквизит Лабораторный анализ
//  	ИмяТабличнойЧасти           - Строка
//
Процедура УстановитьДоступностьРеквизитовПоНастройке(Форма, СписокРеквизитов, ЛабораторияРаботаетВСистеме, ИзменятьВидимость, ИмяТабличнойЧасти = Неопределено) Экспорт
	
	Объект 	 = Форма.Объект;
	Элементы = Форма.Элементы;

	ФлагДоступности = Истина;
	
	Если ИзменятьВидимость Тогда
		Попытка
			ФлагДоступности = НЕ ЛабораторияРаботаетВСистеме;
		Исключение
			ФлагДоступности = Истина;
		КонецПопытки;
	КонецЕсли;
	
	Для Каждого ТекРеквизит Из СписокРеквизитов Цикл
		Если ИмяТабличнойЧасти = Неопределено Тогда
			Элементы[ТекРеквизит.Ключ].Доступность = ФлагДоступности;
		Иначе
			Элементы[ИмяТабличнойЧасти + ТекРеквизит.Ключ].Доступность = ФлагДоступности;
		КонецЕсли;
	КонецЦикла;	

КонецПроцедуры

#КонецОбласти