#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Менеджер = РегистрыСведений.ИНАГРО_ПредопределеннаяНоменклатура.СоздатьМенеджерЗаписи();		
	Менеджер.Прочитать();
	
	ЗаполнитьЗначенияСвойств(Запись, Менеджер);

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	НаборЗаписей = РегистрыСведений.ИНАГРО_ПредопределеннаяНоменклатура.СоздатьНаборЗаписей();
	Если Модифицированность Тогда 		
		НаборЗаписей.Записать();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
