#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("СписокВыбора", СписокБанков);
	
	Банк = СписокБанков.Получить(0).Значение;
	
	УстановитьПараметрыВыбораБанка();

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("ВыбранныйБанк", Банк);
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыВыбораБанка()
	
	МассивБанков = Новый Массив;	
	
	Для Каждого Строка Из СписокБанков Цикл		
		МассивБанков.Добавить(Строка.Значение);
	КонецЦикла;
	
	ПараметрМассивБанков = Новый ПараметрВыбора("Отбор.Ссылка", МассивБанков);
	
	НовыйМассив = Новый Массив();
	НовыйМассив.Добавить(ПараметрМассивБанков);
	НовыеПараметры = Новый ФиксированныйМассив(НовыйМассив);
	
	Элементы.Банк.ПараметрыВыбора = НовыеПараметры;
	
КонецПроцедуры

#КонецОбласти
