#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	// Форма23
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_Форма23";
	КомандаПечати.Представление = НСтр("ru='Акт уничтожения негодных отходов';uk='Акт знищення непридатних відходів'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокумента";

	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Акт уничтожения негодных отходов""';uk='Реєстр документів ""Акт знищення непридатних відходів""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм,ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_Форма23") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_Форма23", НСтр("ru='Форма23';uk='Форма23'"), 
            ПечатьФорма23(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_АктУничтоженияНегодныхОтходов.ПФ_MXL_Форма23", , Ложь);
    КонецЕсли;	
	
КонецПроцедуры

Функция ПечатьФорма23(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИНАГРО_АктУничтоженияНегодныхОтходов_Форма23";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_АктУничтоженияНегодныхОтходов.ПФ_MXL_Форма23");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ПервыйДокумент = Истина;	
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;

		СрезЗавСкладом = РегистрыСведений.ОтветственныеЛица.СрезПоследних(Ссылка.Дата,Новый Структура("СтруктурнаяЕдиница",Ссылка.Склад));
		СрезНачЛаб = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Ссылка.Дата,Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Ссылка.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ИНАГРО_НачальникВТЛ));
		СрезНачОхраны = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Ссылка.Дата, Новый Структура("СтруктурнаяЕдиница, ОтветственноеЛицо", Ссылка.Организация, Перечисления.ОтветственныеЛицаОрганизаций.ИНАГРО_НачальникОхраны));
		ЗавСкладом = ?(СрезЗавСкладом.Количество()>0,СрезЗавСкладом[0].ФизическоеЛицо,"___________________");
		
		НачЛаб = ?(СрезНачЛаб.Количество()>0,СрезНачЛаб[0].ФизическоеЛицо,"___________________");
		НачОхраны = ?(СрезНачОхраны.Количество()>0,СрезНачОхраны[0].ФизическоеЛицо,"___________________");
		СрезЕДРПОУ = РегистрыСведений.КодыОрганизации.СрезПоследних(Ссылка.Дата,Новый Структура("Организация", Ссылка.Организация));
		ЕДРПОУ = ?(НЕ ПустаяСтрока(Ссылка.Организация.КодПоЕДРПОУ), Ссылка.Организация.КодПоЕДРПОУ,"___________");
		СрезДиректор = РегистрыСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(Ссылка.Дата,Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",Ссылка.Организация,Перечисления.ОтветственныеЛицаОрганизаций.Руководитель));
		ДолжностьДиректора = ?(СрезДиректор.Количество()>0, СрезДиректор[0].Должность,"__________");
		//Шапка
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.Заполнить(Ссылка);
		ОблШапка.Параметры.ЕДРПОУ 				= ЕДРПОУ; 
		ОблШапка.Параметры.Дата 				= Формат(Ссылка.Дата,"ДЛФ = Д");
		ОблШапка.Параметры.ДолжностьДиректора	= ДолжностьДиректора;
		ОблШапка.Параметры.НачальникЛаборатории = НачЛаб;
		ОблШапка.Параметры.НачальникОхраны		= НачОхраны;
		ОблШапка.Параметры.ЗавСкладом 			= ЗавСкладом;
		ОблШапка.Параметры.НомерРаспоряжения	= Ссылка.НомерРаспоряжения;
		ОблШапка.Параметры.ДатаРаспоряжения		= Формат(Ссылка.ДатаРаспоряжения, "ДЛФ=D");
		ОблШапка.Параметры.Примечание			= Ссылка.Комментарий;
		ОблШапка.Параметры.НомерАкта			= Ссылка.НомерАкта;
		ОблШапка.Параметры.ДатаАкта				= Формат(Ссылка.ДатаАкта, "ДЛФ=D");
		ТабДокумент.Вывести(ОблШапка);
		
		//Строка
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		Для Каждого СтрСписокКультур Из Ссылка.СписокНоменклатуры Цикл
			ОблСтрока.Параметры.Заполнить(СтрСписокКультур);
			ОблСтрока.Параметры.ЛабораторныйАнализ = СтрСписокКультур.НомерАнализа + " від " + Формат(СтрСписокКультур.ЛабораторныйАнализ.Дата,"ДЛФ = Д");
			ОблСтрока.Параметры.ПроцентЗерна = ?(СтрСписокКультур.ЗерноваяПримесь = 0,0,100 - СтрСписокКультур.ЗерноваяПримесь);
			ТабДокумент.Вывести(ОблСтрока);
		КонецЦикла;
		
		//Дно
		ОблДно = Макет.ПолучитьОбласть("Дно");
		ОблДно.Параметры.ИтогоВес = Ссылка.СписокНоменклатуры.Итог("Вес");
		ОблДно.Параметры.НомерПропуска 	= Ссылка.НомерПропуска;
		ОблДно.Параметры.ДатаПропуска 	= Формат(Ссылка.ДатаПропуска, "ДЛФ=D");
		ОблДно.Параметры.НачальникЛаборатории = НачЛаб;
		ОблДно.Параметры.НачальникОхраны		= НачОхраны;
		ОблДно.Параметры.ЗавСкладом = ЗавСкладом;
		
		ТабДокумент.Вывести(ОблДно);
			
	КонецЦикла;
	
	Возврат ТабДокумент;	
	
КонецФункции 

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли