#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		
	ДатаНачала = Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
	Если НЕ ЗначениеЗаполнено(ДатаНачала.Значение) Тогда
		Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач").Значение = '00010101';
		Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач").Использование = Истина;
	КонецЕсли;
	
	ПериодОтчета = Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
	Если НЕ ЗначениеЗаполнено(ПериодОтчета.Значение) Тогда
		Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон").Значение = '39991231235959';
		Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон").Использование = Истина;
	КонецЕсли;
		
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли