#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
	// Ведомость отвесов (Автомобильные весы)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_АвтомобильныеВесы";
	КомандаПечати.Представление = НСтр("ru='Ведомость отвесов (Автомобильные весы)';uk='Відомість зважувань (автомобільні ваги)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Весы",
		Перечисления.ИНАГРО_ВидыВесов.АвтомобильныеВесы, ВидСравненияКомпоновкиДанных.Равно);

	// Ведомость отвесов (Бункерные весы)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_БункерныеВесы";
	КомандаПечати.Представление = НСтр("ru='Ведомость отвесов (Бункерные весы)';uk='Відомість зважувань (Бункерні ваги)'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Весы",
		Перечисления.ИНАГРО_ВидыВесов.БункерныеВесы, ВидСравненияКомпоновкиДанных.Равно);

    	// Ведомость отвесов (Автоматические весы)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_АвтоматическиеВесы_2021";
	КомандаПечати.Представление = НСтр("ru='Ведомость отвесов 171-а 2021';uk='Відомість зважувань 171-а 2021'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
    ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Весы",
    	Перечисления.ИНАГРО_ВидыВесов.БункерныеВесы, ВидСравненияКомпоновкиДанных.Равно);
    
        // Ведомость отвесов (Автомобильные весы)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПФ_MXL_UK_ВедомостьВзвешиваний_2021";
	КомандаПечати.Представление = НСтр("ru='Ведомость отвесов 171-б 2021';uk='Відомість зважувань 171-б 2021'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаДокумента,ФормаСписка";
	ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды(КомандаПечати, "Весы",
		Перечисления.ИНАГРО_ВидыВесов.АвтомобильныеВесы, ВидСравненияКомпоновкиДанных.Равно);

	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Ведомость отвесов""';uk='Реєстр документів ""Відомість зважувань""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;

КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	// Устанавливаем признак доступности печати покомплектно.
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	// Проверяем, нужно ли для макета АвтомобильныеВеса формировать табличный документ.
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АвтомобильныеВесы") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_АвтомобильныеВесы", НСтр("ru='Ведомость отвесов (автомобильные весы) ';uk='Відомість зважувань (автомобільні ваги)'"), 
		ПечатьМакета(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_АвтомобильныеВесы", ,Истина);
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_БункерныеВесы") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_БункерныеВесы", НСтр("ru='Ведомость отвесов (Бункерные веса)';uk='Відомість зважувань (Бункерні ваги)'"), 
		ПечатьБункерныйВесов(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_БункерныеВесы", ,Истина);
		
    КонецЕсли;
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_UK_АвтоматическиеВесы_2021") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_UK_АвтоматическиеВесы_2021", НСтр("ru='Ведомость отвесов (Автоматические веса) 2021';uk='Відомість зважувань (Автоматичні ваги) 2021'"), 
		ПечатьАвтоматическиеВесы_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_UK_АвтоматическиеВесы_2021", ,Истина);
		
	КонецЕсли;

    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_UK_ВедомостьВзвешиваний_2021") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПФ_MXL_UK_ВедомостьВзвешиваний_2021", НСтр("ru='Ведомость отвесов 2021';uk='Відомість зважувань 2021'"), 
		ВедомостьВзвешиваний_2021(МассивОбъектов, ОбъектыПечати, ПараметрыВывода), , "Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_UK_ВедомостьВзвешиваний_2021", ,Истина);
		
	КонецЕсли;

КонецПроцедуры

Функция ПечатьМакета(МассивОбъектов,ПараметрыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_АвтомобильныеВесы");
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	//ПервыйДокумент = Истина;
	Для каждого Ссылка Из МассивОбъектов Цикл
		//Если Не ПервыйДокумент Тогда
		//	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		//КонецЕсли; 
		//ПервыйДокумент = Ложь;
		//Если НЕ Ссылка.Проведен Тогда
		//	ТекстСообщения = НСтр("ru='Перед формированием документ необходимо провести!';uk='Перед формуванням документ необхідно провести!'");
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		//КонецЕсли;
		//Макет.КодЯзыкаМакета = "ru";
		
		////Шапка
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.ОРганизация = Ссылка.Организация; 
		ОблШапка.Параметры.Дата= Формат(Ссылка.Дата,"ДЛФ = Д");
		ОблШапка.Параметры.Культура	= Ссылка.Номенклатура;
		ОблШапка.Параметры.Склад = Ссылка.Склад;
		
		ВидОперации = "";
		Если Ссылка.ВидОперации = "Вывоз" Тогда
		
			ВидОперации = НСтр("ru='Вывоз';uk='Вивезення'");
			ИначеЕсли Ссылка.ВидОперации = "Уничтожение" Тогда 
			ВидОперации = НСтр("ru='Уничтожение';uk='Знищення'");
			ИначеЕсли Ссылка.ВидОперации = "Перевзвешивание" Тогда
			ВидОперации = НСтр("ru='Перевзвешивание';uk='Перезважування'");
		
		КонецЕсли; 
		ОблШапка.Параметры.РодОперации = ВидОперации;
		ОблШапка.Параметры.Весы	= Ссылка.Весы;
		ОблШапка.Параметры.Примечание	= Ссылка.Комментарий;
		ТабДокумент.Вывести(ОблШапка);
		//
		////Строка
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ТабЧасть = Ссылка.СписокТТН.Выгрузить();
		Инд = 0;
		Пока ТабЧасть.Количество() > Инд Цикл
			ОблСтрока.Параметры.Ном1 = ТабЧасть[Инд].НомерТТН;
			ОблСтрока.Параметры.Тара1 = ТабЧасть[Инд].ВесТара;
			ОблСтрока.Параметры.Брутто1 = ТабЧасть[Инд].ВесБрутто;
			//ОблСтрока.Параметры.Нетто1 = ТабЧасть[Инд].Вес;
			Инд = Инд + 1;
			Если ТабЧасть.Количество() > Инд Тогда
				ОблСтрока.Параметры.Ном2 = ТабЧасть[Инд].НомерТТН;
				ОблСтрока.Параметры.Тара2 = ТабЧасть[Инд].ВесТара;
				ОблСтрока.Параметры.Брутто2 = ТабЧасть[Инд].ВесБрутто;
				//ОблСтрока.Параметры.Нетто2 = ТабЧасть[Инд].Вес;
				Инд = Инд + 1;
			Иначе
				ОблСтрока.Параметры.Ном2 = "" ;
				ОблСтрока.Параметры.Тара2 = "";
				ОблСтрока.Параметры.Брутто2 = "";
				ОблСтрока.Параметры.Нетто2 = "";
			КонецЕсли;
			ТабДокумент.Вывести(ОблСтрока);
			
		КонецЦикла;	
		
		//валютаДокумента=Справочники.Валюты.	//Дно
		ОблДно = Макет.ПолучитьОбласть("Дно");
		ОблДно.Параметры.ВесБруттоИтого       = Ссылка.СписокТТН.Итог("ВесБрутто");
		ОблДно.Параметры.ВесТараИтого         = Ссылка.СписокТТН.Итог("ВесТара");
		ОблДно.Параметры.ВесНеттоИТого        = Ссылка.СписокТТН.Итог("ВесНетто");
		
		ОблДно.Параметры.ПредседательКомиссии = Ссылка.ПредседательКомиссии;
		ОблДно.Параметры.ПервыйЧлен 	      = Ссылка.ПервыйЧленКомиссии;
		ОблДно.Параметры.ВторойЧлен           = Ссылка.ВторойЧленКомиссии;
		ОблДно.Параметры.ТретийЧлен           = Ссылка.ТретийЧленКомиссии;
		СтрокаВеса = ЧислоПрописью(ОблДно.Параметры.ВесНеттоИТого,"Л = uk_UK; НП=Ложь; FN = Ложь; ДП=Ложь" )+"кілограм";           
		ОблДно.Параметры.ВесПрописью          = СтрЗаменить(СтрокаВеса,"00","");
		
		ТабДокумент.Вывести(ОблДно);
		
	КонецЦикла;
	
	Возврат ТабДокумент;	
	
КонецФункции

Функция ПечатьБункерныйВесов(МассивОбъектов,ПараметрыПечати, ПараметрыВывода)
	
	УстановитьПривилегированныйРежим(Истина);
	ТабДокумент = Новый ТабличныйДокумент;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_БункерныеВесы");
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	Для каждого Ссылка Из МассивОбъектов Цикл
		
		////Шапка
		ОблШапка = Макет.ПолучитьОбласть("Шапка");
		ОблШапка.Параметры.ОРганизация = Ссылка.Организация; 
		ОблШапка.Параметры.Дата= Формат(Ссылка.Дата,"ДЛФ = Д");
		ОблШапка.Параметры.Культура	= Ссылка.Номенклатура;
		ОблШапка.Параметры.Склад = Ссылка.Склад;
		Если Ссылка.ВидОперации = "Вывоз" Тогда
		
			ВидОперации = НСтр("ru='Вывоз';uk='Вивезення'");
			ИначеЕсли Ссылка.ВидОперации = "Уничтожение" Тогда 
			ВидОперации = НСтр("ru='Уничтожение';uk='Знищення'");
			ИначеЕсли Ссылка.ВидОперации = "Перевзвешивание" Тогда
			ВидОперации = НСтр("ru='Перевзвешивание';uk='Перезважування'");
		
		КонецЕсли; 
		ОблШапка.Параметры.РодОперации = ВидОперации;
		ОблШапка.Параметры.Весы	= Ссылка.Весы;
		ОблШапка.Параметры.Примечание	= Ссылка.Комментарий;
		ТабДокумент.Вывести(ОблШапка);
		
		////Строка
		ОблСтрока = Макет.ПолучитьОбласть("Строка");
		ТабЧасть = Ссылка.БункерныеВесы.Выгрузить();
		Инд = 0;
		Пока ТабЧасть.Количество() > Инд Цикл
			ОблСтрока.Параметры.Ном1 = Инд+1;
			ОблСтрока.Параметры.НачСмены1 = ТабЧасть[Инд].СчетчикНаНачалоСмены;
			ОблСтрока.Параметры.КонСмены1 = ТабЧасть[Инд].СчетчикНаКонецСмены;
			ОблСтрока.Параметры.кол1 = ТабЧасть[Инд].КоличествоОтвесов;
			ОблСтрока.Параметры.Отвес1 = ТабЧасть[Инд].ПоказанияОтвеса;
			ОблСтрока.Параметры.нетто1 = ТабЧасть[Инд].ВесНетто;
			Инд = Инд + 1;
			Если ТабЧасть.Количество() > Инд Тогда
				ОблСтрока.Параметры.Ном2 = Инд+1;
				ОблСтрока.Параметры.НачСмены2 = ТабЧасть[Инд].СчетчикНаНачалоСмены;
				ОблСтрока.Параметры.КонСмены2 = ТабЧасть[Инд].СчетчикНаКонецСмены;
				ОблСтрока.Параметры.кол2 = ТабЧасть[Инд].КоличествоОтвесов;
				ОблСтрока.Параметры.Отвес2 = ТабЧасть[Инд].ПоказанияОтвеса;
				ОблСтрока.Параметры.нетто2 = ТабЧасть[Инд].ВесНетто;
				Инд = Инд + 1;
			Иначе
				ОблСтрока.Параметры.Ном2 = "";
				ОблСтрока.Параметры.НачСмены2 = "";
				ОблСтрока.Параметры.КонСмены2 = "";
				ОблСтрока.Параметры.кол2 = "";
				ОблСтрока.Параметры.Отвес2 = "";
				ОблСтрока.Параметры.нетто2 = "";
				
			КонецЕсли;
			ТабДокумент.Вывести(ОблСтрока);
			
		КонецЦикла;	
		// валютаДокумента=Справочники.Валюты.	
		
		// Дно
		ОблДно = Макет.ПолучитьОбласть("Дно");		
		ОблДно.Параметры.ПредседательКомиссии = Ссылка.ПредседательКомиссии;
		ОблДно.Параметры.ПервыйЧлен 	      = Ссылка.ПервыйЧленКомиссии;
		ОблДно.Параметры.ВторойЧлен           = Ссылка.ВторойЧленКомиссии;
		ОблДно.Параметры.ТретийЧлен           = Ссылка.ТретийЧленКомиссии;
		СтрокаВеса = ЧислоПрописью(Ссылка.БункерныеВесы.Итог("ВесНетто"),"Л = uk_UK; НП=Ложь; FN = Ложь; ДП=Ложь" )+"кілограм";           
		ОблДно.Параметры.ВесПрописью          = СтрЗаменить(СтрокаВеса,"00","");
		
		ТабДокумент.Вывести(ОблДно);
		
	КонецЦикла;	
	
	Возврат ТабДокумент;
	
КонецФункции

Функция ПечатьАвтоматическиеВесы_2021(МассивОбъектов,ПараметрыПечати, ПараметрыВывода)
	
    УстановитьПривилегированныйРежим(Истина);
    ТабДокумент = Новый ТабличныйДокумент;
    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_UK_АвтоматическиеВесы_2021");
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ИНАГРО_ВедомостьОтвесов.Организация КАК Организация,
    |   ИНАГРО_ВедомостьОтвесов.Дата КАК Дата,
    |   ИНАГРО_ВедомостьОтвесов.Номер КАК Номер,
    |   ИНАГРО_ВедомостьОтвесов.ВидОперации КАК ВидОперации,
    |   ИНАГРО_ВедомостьОтвесов.Номенклатура КАК Номенклатура,
    |   ИНАГРО_ВедомостьОтвесов.Склад КАК Склад,
    |   ИНАГРО_ВедомостьОтвесов.Весы КАК Весы,
    |   ИНАГРО_ВедомостьОтвесов.ПредседательКомиссии КАК ПредседательКомиссии,
    |   ИНАГРО_ВедомостьОтвесов.ПервыйЧленКомиссии КАК ПервыйЧленКомиссии,
    |   ИНАГРО_ВедомостьОтвесов.ТретийЧленКомиссии КАК ТретийЧленКомиссии,
    |   ИНАГРО_ВедомостьОтвесов.ВторойЧленКомиссии КАК ВторойЧленКомиссии,
    |   ИНАГРО_ВедомостьОтвесовБункерныеВесы.СчетчикНаНачалоСмены КАК СчетчикНаНачалоСмены,
    |   ИНАГРО_ВедомостьОтвесовБункерныеВесы.СчетчикНаКонецСмены КАК СчетчикНаКонецСмены,
    |   ИНАГРО_ВедомостьОтвесовБункерныеВесы.КоличествоОтвесов КАК КоличествоОтвесов,
    |   ИНАГРО_ВедомостьОтвесовБункерныеВесы.ПоказанияОтвеса КАК ПоказанияОтвеса,
    |   ИНАГРО_ВедомостьОтвесовБункерныеВесы.ВесНетто КАК ВесНетто,
    |   ИНАГРО_ВедомостьОтвесов.Ссылка КАК Ссылка,
    |   ИНАГРО_ВедомостьОтвесовБункерныеВесы.НомерСтроки КАК НомерСтроки,
    |   ИНАГРО_ВедомостьОтвесов.Организация.КодПоЕДРПОУ КАК ЕГРПОУ
    |ИЗ
    |   Документ.ИНАГРО_ВедомостьОтвесов.БункерныеВесы КАК ИНАГРО_ВедомостьОтвесовБункерныеВесы
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_ВедомостьОтвесов КАК ИНАГРО_ВедомостьОтвесов
    |       ПО ИНАГРО_ВедомостьОтвесовБункерныеВесы.Ссылка = ИНАГРО_ВедомостьОтвесов.Ссылка
    |ГДЕ
    |   ИНАГРО_ВедомостьОтвесов.Ссылка В(&МассивОбъектов)
    |ИТОГИ ПО
    |   Ссылка";
    
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаСсылка.Следующий() Цикл
        // Вставить обработку выборки ВыборкаСсылка
        ОблШапка = Макет.ПолучитьОбласть("Шапка");
        ОблШапка.Параметры.Организация = ВыборкаСсылка.Организация; 
        ОблШапка.Параметры.ЕГРПОУ = ВыборкаСсылка.ЕГРПОУ;
        ОблШапка.Параметры.День = Формат(ВыборкаСсылка.Дата, "ДФ=дд");
        ОблШапка.Параметры.Месяц = Формат(ВыборкаСсылка.Дата, "ДФ=ММММ");
        ОблШапка.Параметры.Год = Формат(ВыборкаСсылка.Дата, "ДФ=гг");
        ОблШапка.Параметры.Культура	= ВыборкаСсылка.Номенклатура;
        ОблШапка.Параметры.Склад = ВыборкаСсылка.Склад;
        Если ВыборкаСсылка.ВидОперации = "Вывоз" Тогда
            
            ВидОперации = НСтр("ru='Вывоз';uk='Вивезення'");
        ИначеЕсли ВыборкаСсылка.ВидОперации = "Уничтожение" Тогда 
            ВидОперации = НСтр("ru='Уничтожение';uk='Знищення'");
        ИначеЕсли ВыборкаСсылка.ВидОперации = "Перевзвешивание" Тогда
            ВидОперации = НСтр("ru='Перевзвешивание';uk='Перезважування'");
            
        КонецЕсли; 
        ОблШапка.Параметры.РодОперации = ВидОперации;
        ОблШапка.Параметры.Весы	= ВыборкаСсылка.Весы;
        ТабДокумент.Вывести(ОблШапка);
        
        ////Строка
        ОблСтрока = Макет.ПолучитьОбласть("Строка");
        
        ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
        СуммаВесНетто  = 0;
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            
            ОблСтрока.Параметры.ном1 = ВыборкаДетальныеЗаписи.НомерСтроки;
            ОблСтрока.Параметры.НачСмены1 = ВыборкаДетальныеЗаписи.СчетчикНаНачалоСмены;
            ОблСтрока.Параметры.КонСмены1 = ВыборкаДетальныеЗаписи.СчетчикНаКонецСмены;
            ОблСтрока.Параметры.кол1 = ВыборкаДетальныеЗаписи.КоличествоОтвесов;
            ОблСтрока.Параметры.Отвес2 = ВыборкаДетальныеЗаписи.ПоказанияОтвеса;
            ОблСтрока.Параметры.нетто2 = ВыборкаДетальныеЗаписи.ВесНетто;
            ТабДокумент.Вывести(ОблСтрока);
            СуммаВесНетто = СуммаВесНетто + ВыборкаДетальныеЗаписи.ВесНетто;
        КонецЦикла;
        
        // Дно
        ОблДно = Макет.ПолучитьОбласть("Дно");
        
        ГоловаКомиссииИмяФамилия = "";
        ДолжностьГоловаКомиссии = "";
        ГоловаКомиссии = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ПредседательКомиссии));
        Если ГоловаКомиссии.Количество() > 0 Тогда
            СтрукДолжностьГоловаКомиссии = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация, ВыборкаСсылка.ПредседательКомиссии, ВыборкаСсылка.Дата); 
            ДолжностьГоловаКомиссии = ?(ПустаяСтрока(СтрукДолжностьГоловаКомиссии.Должность),"",СтрукДолжностьГоловаКомиссии.Должность);
            ГоловаКомиссииИмяФамилия = СокрЛП(ГоловаКомиссии[0].Имя)
            + " "
            + ВРег(СокрЛП(ГоловаКомиссии[0].Фамилия)); 
        КонецЕсли;
        ОблДно.Параметры.ДолжностьГоловаКомисии 	= ДолжностьГоловаКомиссии;
        ОблДно.Параметры.ПредседательКомиссии = ГоловаКомиссииИмяФамилия;
        
        
        ЧленКомиссии1ИмяФамилия = ""; 
        ДолжностьЧленКомиссии1 = ""; 
        Если ТипЗнч(ВыборкаСсылка.ПервыйЧленКомиссии) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
            СтрукДолжностьЧленКомиссии1 = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация,ВыборкаСсылка.ПервыйЧленКомиссии,ВыборкаСсылка.Дата); 
            ДолжностьЧленКомиссии1 = ?(ПустаяСтрока(СтрукДолжностьЧленКомиссии1.Должность),"",СтрукДолжностьЧленКомиссии1.Должность);
            ЧленКомиссии1 = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ПервыйЧленКомиссии));
            Если ЧленКомиссии1.Количество() > 0 Тогда
                ЧленКомиссии1ИмяФамилия = СокрЛП(ЧленКомиссии1[0].Имя)
                + " "
                + ВРег(СокрЛП(ЧленКомиссии1[0].Фамилия)); 
            КонецЕсли;
        Иначе
            ЧленКомиссии1ИмяФамилия =  ВыборкаСсылка.ПервыйЧленКомиссии;
        КонецЕсли; 
        ОблДно.Параметры.ПервыйЧлен 	      = ЧленКомиссии1ИмяФамилия;
        ОблДно.Параметры.ДолжностьПервыйЧлен  = ДолжностьЧленКомиссии1;
        
        ЧленКомиссии2ИмяФамилия = "";
        ДолжностьЧленКомиссии2 = ""; 
        Если ТипЗнч(ВыборкаСсылка.ВторойЧленКомиссии) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
            СтрукДолжностьЧленКомиссии2 = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация,ВыборкаСсылка.ВторойЧленКомиссии,ВыборкаСсылка.Дата);
            ДолжностьЧленКомиссии2 = ?(ПустаяСтрока(СтрукДолжностьЧленКомиссии2.Должность),"",СтрукДолжностьЧленКомиссии2.Должность);
            ЧленКомиссии2 = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ВторойЧленКомиссии));
            Если ЧленКомиссии2.Количество() > 0 Тогда
                ЧленКомиссии2ИмяФамилия = СокрЛП(ЧленКомиссии2[0].Имя)
                + " "
                + ВРег(СокрЛП(ЧленКомиссии2[0].Фамилия)); 
            КонецЕсли;
        Иначе
            ЧленКомиссии2ИмяФамилия =  ВыборкаСсылка.ВторойЧленКомиссии;
        КонецЕсли;
        ОблДно.Параметры.ВторойЧлен     = ЧленКомиссии2ИмяФамилия;
        ОблДно.Параметры.ДолжностьВторойЧлен     = ДолжностьЧленКомиссии2;
        
        
        ЧленКомиссии3ИмяФамилия = "";
        ДолжностьЧленКомиссии3 = ""; 
        Если ТипЗнч(ВыборкаСсылка.ТретийЧленКомиссии) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
            ЧленКомиссии3 = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ТретийЧленКомиссии));
            Если ЧленКомиссии3.Количество() > 0 Тогда
                СтрукДолжностьЧленКомиссии3 = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация,ВыборкаСсылка.ТретийЧленКомиссии,ВыборкаСсылка.Дата);   
                ДолжностьЧленКомиссии3 = ?(ПустаяСтрока(СтрукДолжностьЧленКомиссии3.Должность),"",СтрукДолжностьЧленКомиссии3.Должность);
                ЧленКомиссии3ИмяФамилия = СокрЛП(ЧленКомиссии3[0].Имя)
                + " "
                + ВРег(СокрЛП(ЧленКомиссии3[0].Фамилия)); 
            КонецЕсли;
        Иначе
            ЧленКомиссии3ИмяФамилия =  ВыборкаСсылка.ТретийЧленКомиссии;
        КонецЕсли;
        
        ОблДно.Параметры.ТретийЧлен           = ЧленКомиссии3ИмяФамилия;
        ОблДно.Параметры.ДолжностьТретийЧлен           = ДолжностьЧленКомиссии3;
        
        СтрокаВеса = ЧислоПрописью(СуммаВесНетто,"Л = uk_UK; НП=Ложь; FN = Ложь; ДП=Ложь" )+"кілограм";           
        ОблДно.Параметры.ВесПрописью = СтрЗаменить(СтрокаВеса,"00","");
        ОблДно.Параметры.День = Формат(ВыборкаСсылка.Дата, "ДФ=дд");
        ОблДно.Параметры.Месяц = Формат(ВыборкаСсылка.Дата, "ДФ=ММММ");
        ОблДно.Параметры.Год = Формат(ВыборкаСсылка.Дата, "ДФ=гг");
               
        ТабДокумент.Вывести(ОблДно);
        
    КонецЦикла;	
    
    Возврат ТабДокумент;
	
КонецФункции

Функция ВедомостьВзвешиваний_2021(МассивОбъектов,ПараметрыПечати, ПараметрыВывода)
    
    УстановитьПривилегированныйРежим(Истина);
    ТабДокумент = Новый ТабличныйДокумент;
    Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИНАГРО_ВедомостьОтвесов.ПФ_MXL_UK_ВедомостьВзвешиваний_2021");
    КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
    Макет.КодЯзыкаМакета = КодЯзыкаПечать;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |   ИНАГРО_ВедомостьОтвесов.Организация КАК Организация,
    |   ИНАГРО_ВедомостьОтвесов.Дата КАК Дата,
    |   ИНАГРО_ВедомостьОтвесов.Номер КАК Номер,
    |   ИНАГРО_ВедомостьОтвесов.ВидОперации КАК ВидОперации,
    |   ИНАГРО_ВедомостьОтвесов.Номенклатура КАК Номенклатура,
    |   ИНАГРО_ВедомостьОтвесов.Склад КАК Склад,
    |   ИНАГРО_ВедомостьОтвесов.Весы КАК Весы,
    |   ИНАГРО_ВедомостьОтвесов.ПредседательКомиссии КАК ПредседательКомиссии,
    |   ИНАГРО_ВедомостьОтвесов.ПервыйЧленКомиссии КАК ПервыйЧленКомиссии,
    |   ИНАГРО_ВедомостьОтвесов.ТретийЧленКомиссии КАК ТретийЧленКомиссии,
    |   ИНАГРО_ВедомостьОтвесов.ВторойЧленКомиссии КАК ВторойЧленКомиссии,
    |   ИНАГРО_ВедомостьОтвесов.Ссылка КАК Ссылка,
    |   ИНАГРО_ВедомостьОтвесовСписокТТН.НомерСтроки КАК НомерСтроки,
    |   ИНАГРО_ВедомостьОтвесов.Организация.КодПоЕДРПОУ КАК ЄДРПОУ,
    |   ИНАГРО_ВедомостьОтвесовСписокТТН.ТТН.НомерТранспорта КАК Транспорт,
    |   ИНАГРО_ВедомостьОтвесовСписокТТН.ВесБрутто КАК МассаБрутто,
    |   ИНАГРО_ВедомостьОтвесовСписокТТН.ВесТара КАК ТараБрутто,
    |   ИНАГРО_ВедомостьОтвесовСписокТТН.ВесНетто КАК МассаНетто,
    |   ИНАГРО_ВедомостьОтвесовСписокТТН.НомерСтроки КАК ном,
    |   ИНАГРО_ВедомостьОтвесов.Номенклатура.БазоваяЕдиницаИзмерения КАК Ед,
    |   ИНАГРО_ВедомостьОтвесов.Номенклатура.Код КАК Код
    |ИЗ
    |   Документ.ИНАГРО_ВедомостьОтвесов.СписокТТН КАК ИНАГРО_ВедомостьОтвесовСписокТТН
    |       ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_ВедомостьОтвесов КАК ИНАГРО_ВедомостьОтвесов
    |       ПО ИНАГРО_ВедомостьОтвесовСписокТТН.Ссылка = ИНАГРО_ВедомостьОтвесов.Ссылка
    |ГДЕ
    |   ИНАГРО_ВедомостьОтвесов.Ссылка В(&МассивОбъектов)
    |ИТОГИ ПО
    |   Ссылка";
    
    Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
    
    РезультатЗапроса = Запрос.Выполнить();
    
    ВыборкаСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    
    Пока ВыборкаСсылка.Следующий() Цикл
        // Вставить обработку выборки ВыборкаСсылка
        ОблШапка = Макет.ПолучитьОбласть("Шапка");
        ОблШапка.Параметры.Организация = ВыборкаСсылка.Организация; 
        ОблШапка.Параметры.ЄДРПОУ = ВыборкаСсылка.ЄДРПОУ;
        ОблШапка.Параметры.День = Формат(ВыборкаСсылка.Дата, "ДФ=дд");
        ОблШапка.Параметры.Месяц = Формат(ВыборкаСсылка.Дата, "ДФ=ММММ");
        ОблШапка.Параметры.Год = Формат(ВыборкаСсылка.Дата, "ДФ=гг");
        ОблШапка.Параметры.Культура	= ВыборкаСсылка.Номенклатура;
        ОблШапка.Параметры.Склад = ВыборкаСсылка.Склад;
        Если ВыборкаСсылка.ВидОперации = "Вывоз" Тогда
            ВидОперации = НСтр("ru='Вывоз';uk='Вивезення'");
        ИначеЕсли ВыборкаСсылка.ВидОперации = "Уничтожение" Тогда 
            ВидОперации = НСтр("ru='Уничтожение';uk='Знищення'");
        ИначеЕсли ВыборкаСсылка.ВидОперации = "Перевзвешивание" Тогда
            ВидОперации = НСтр("ru='Перевзвешивание';uk='Перезважування'");
            
        КонецЕсли; 
        ОблШапка.Параметры.РодОперации = ВидОперации;
        ОблШапка.Параметры.Весы	= ВыборкаСсылка.Весы;
        ТабДокумент.Вывести(ОблШапка);
        
        ////Строка
        ОблСтрока = Макет.ПолучитьОбласть("Строка");
        
        ВыборкаДетальныеЗаписи = ВыборкаСсылка.Выбрать();
        СуммаВесНетто  = 0;
        Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
            ОблСтрока = Макет.ПолучитьОбласть("Строка");
            ЗаполнитьЗначенияСвойств(ОблСтрока.Параметры,ВыборкаДетальныеЗаписи); 
            СуммаВесНетто = СуммаВесНетто + ВыборкаДетальныеЗаписи.МассаНетто;
            ТабДокумент.Вывести(ОблСтрока);
        КонецЦикла;
        
        // Дно
        ОблДно = Макет.ПолучитьОбласть("Дно");
        
        ГоловаКомиссииИмяФамилия = "";
        ДолжностьГоловаКомиссии = "";
        ГоловаКомиссии = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ПредседательКомиссии));
        Если ГоловаКомиссии.Количество() > 0 Тогда
            СтрукДолжностьГоловаКомиссии = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация, ВыборкаСсылка.ПредседательКомиссии, ВыборкаСсылка.Дата); 
            ДолжностьГоловаКомиссии = ?(ПустаяСтрока(СтрукДолжностьГоловаКомиссии.Должность),"",СтрукДолжностьГоловаКомиссии.Должность);
            ГоловаКомиссииИмяФамилия = СокрЛП(ГоловаКомиссии[0].Имя)
            + " "
            + ВРег(СокрЛП(ГоловаКомиссии[0].Фамилия)); 
        КонецЕсли;
        ОблДно.Параметры.ДолжностьГоловаКомисии 	= ДолжностьГоловаКомиссии;
        ОблДно.Параметры.ГоловаКомисии = ГоловаКомиссииИмяФамилия;
        
        
        ЧленКомиссии1ИмяФамилия = ""; 
        ДолжностьЧленКомиссии1 = ""; 
        Если ТипЗнч(ВыборкаСсылка.ПервыйЧленКомиссии) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
            СтрукДолжностьЧленКомиссии1 = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация,ВыборкаСсылка.ПервыйЧленКомиссии,ВыборкаСсылка.Дата); 
            ДолжностьЧленКомиссии1 = ?(ПустаяСтрока(СтрукДолжностьЧленКомиссии1.Должность),"",СтрукДолжностьЧленКомиссии1.Должность);
            ЧленКомиссии1 = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ПервыйЧленКомиссии));
            Если ЧленКомиссии1.Количество() > 0 Тогда
                ЧленКомиссии1ИмяФамилия = СокрЛП(ЧленКомиссии1[0].Имя)
                + " "
                + ВРег(СокрЛП(ЧленКомиссии1[0].Фамилия)); 
            КонецЕсли;
        Иначе
            ЧленКомиссии1ИмяФамилия =  ВыборкаСсылка.ПервыйЧленКомиссии;
        КонецЕсли; 
        ОблДно.Параметры.ПервыйЧлен 	      = ЧленКомиссии1ИмяФамилия;
        ОблДно.Параметры.ДолжностьПервыйЧлен  = ДолжностьЧленКомиссии1;
        
        ЧленКомиссии2ИмяФамилия = "";
        ДолжностьЧленКомиссии2 = ""; 
        Если ТипЗнч(ВыборкаСсылка.ВторойЧленКомиссии) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
            СтрукДолжностьЧленКомиссии2 = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация,ВыборкаСсылка.ВторойЧленКомиссии,ВыборкаСсылка.Дата);
            ДолжностьЧленКомиссии2 = ?(ПустаяСтрока(СтрукДолжностьЧленКомиссии2.Должность),"",СтрукДолжностьЧленКомиссии2.Должность);
            ЧленКомиссии2 = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ВторойЧленКомиссии));
            Если ЧленКомиссии2.Количество() > 0 Тогда
                ЧленКомиссии2ИмяФамилия = СокрЛП(ЧленКомиссии2[0].Имя)
                + " "
                + ВРег(СокрЛП(ЧленКомиссии2[0].Фамилия)); 
            КонецЕсли;
        Иначе
            ЧленКомиссии2ИмяФамилия =  ВыборкаСсылка.ВторойЧленКомиссии;
        КонецЕсли;
        ОблДно.Параметры.ВторойЧлен     = ЧленКомиссии2ИмяФамилия;
        ОблДно.Параметры.ДолжностьВторойЧлен     = ДолжностьЧленКомиссии2;
        
        
        ЧленКомиссии3ИмяФамилия = "";
        ДолжностьЧленКомиссии3 = ""; 
        Если ТипЗнч(ВыборкаСсылка.ТретийЧленКомиссии) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
            ЧленКомиссии3 = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ВыборкаСсылка.Дата, Новый Структура("ФизическоеЛицо", ВыборкаСсылка.ТретийЧленКомиссии));
            Если ЧленКомиссии3.Количество() > 0 Тогда
                СтрукДолжностьЧленКомиссии3 = ИНАГРО_ЗарплатаКадрыРасширенный.ДанныеФизЛица(ВыборкаСсылка.Организация,ВыборкаСсылка.ТретийЧленКомиссии,ВыборкаСсылка.Дата);   
                ДолжностьЧленКомиссии3 = ?(ПустаяСтрока(СтрукДолжностьЧленКомиссии3.Должность),"",СтрукДолжностьЧленКомиссии3.Должность);
                ЧленКомиссии3ИмяФамилия = СокрЛП(ЧленКомиссии3[0].Имя)
                + " "
                + ВРег(СокрЛП(ЧленКомиссии3[0].Фамилия)); 
            КонецЕсли;
        Иначе
            ЧленКомиссии3ИмяФамилия =  ВыборкаСсылка.ТретийЧленКомиссии;
        КонецЕсли;
        
        ОблДно.Параметры.ТретийЧлен           = ЧленКомиссии3ИмяФамилия;
        ОблДно.Параметры.ДолжностьТретийЧлен           = ДолжностьЧленКомиссии3;
        
        СтрокаВеса = ЧислоПрописью(СуммаВесНетто,"Л = uk_UK; НП=Ложь; FN = Ложь; ДП=Ложь" )+"кілограм";           
        ОблДно.Параметры.ВесПрописью = СтрЗаменить(СтрокаВеса,"00","");
        ОблДно.Параметры.День = Формат(ВыборкаСсылка.Дата, "ДФ=дд");
        ОблДно.Параметры.Месяц = Формат(ВыборкаСсылка.Дата, "ДФ=ММММ");
        ОблДно.Параметры.Год = Формат(ВыборкаСсылка.Дата, "ДФ=гг");
                
        ТабДокумент.Вывести(ОблДно);
        
    КонецЦикла;	
    
    Возврат ТабДокумент;

    
КонецФункции

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура;	
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#КонецЕсли