
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

// Процедура - обаботчик события, при нажатии на кнопку "ОК" Командной панели "ОсновныеДействияФормы"
//
&НаКлиенте
Процедура ОсновныеДействияФормыОК(Команда)
	
	ОповеститьОВыборе(Новый Структура("Источник, Результат, Выражение, НомерТаблицы", 
		"ФормаРедактированияВыражения", Истина, ПолеТекстовогоДокумента.ПолучитьТекст(), НомерТаблицы));
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//НадписьТекстВыражения =
	//"В тексте выражения можно использовать следующие предопределенные параметры:
	//|   Результат      - результат вычисления (на входе - значение по умолчанию)
	//|   ДанныеТаблицы - Соответствие значений ячеек электронного документа
	//|   ДанныеТаблицы0 - Соответствие значений ячеек электронного документа (используется для строки табличной части)
	//|   РеквизитыДокумента  - Соответствие загруженных значений
	//|   РеквизитыДокумента0  - Соответствие загруженных значений (используется для строки табличной части)
	//|   Переменная - Глобальная переменная
	////|   ОписаниеОшибки - описание ошибки, выводимое в примечание ячейки и в окно сообщений
	//|Встроенные функции, функции общих модулей.";
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПодсказку() Экспорт
	Если НомерТаблицы = 0 Тогда
		НадписьТекстВыражения = НСтр(
		"ru = 'В тексте выражения можно использовать следующие предопределенные параметры:
         |   Результат      - результат вычисления (на входе - значение по умолчанию)
         |   ДанныеТаблицы - Соответствие значений ячеек электронного документа
         |   РеквизитыДокумента  - Соответствие загруженных значений
         |   Переменная - Глобальная переменная
         |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
         |   Результат      - результат обчислення (на вході - значеня за замовчуванням)
         |   ДанныеТаблицы - ""Соответствие"" значень полів електронного документа
         |   РеквизитыДокумента  - ""Соответствие"" загружених значень
         |   Переменная - Глобальна змінна
         |Встроєні функції, функції загальних модулів.'"
		 );
	ИначеЕсли НомерТаблицы > 0 Тогда
		НадписьТекстВыражения = НСтр(
		"ru = 'В тексте выражения можно использовать следующие предопределенные параметры:
         |   Результат      - результат вычисления (на входе - значение по умолчанию)
         |   ДанныеТаблицы - Соответствие значений ячеек электронного документа
         |   ДанныеТаблицы0 - Соответствие значений ячеек электронного документа (используется для строки табличной части)
         |   РеквизитыДокумента  - Соответствие загруженных значений
         |   РеквизитыДокумента0  - Соответствие загруженных значений (используется для строки табличной части)
         |   Переменная - Глобальная переменная
         |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
         |   Результат      - результат обчислення (на вході - значеня за замовчуванням)
         |   ДанныеТаблицы - ""Соответствие"" значень полів електронного документа
         |   ДанныеТаблицы0 - ""Соответствие"" значень полів електронного документа (ШАПКА)
         |   РеквизитыДокумента  - ""Соответствие"" загружених значень
         |   РеквизитыДокумента0  - ""Соответствие"" загружених значений (ШАПКА)
         |   Переменная - Глобальна змінна
         |Встроєні функції, функції загальних модулів.'"
		 );
	ИначеЕсли НомерТаблицы = -1 Тогда
		НадписьТекстВыражения = НСтр(
		"ru = 'В тексте выражения можно использовать следующие предопределенные параметры:
         |   Результат      - результат вычисления (на входе - ""Неопределено"")
         |   ДанныеТаблицы - Соответствие значений ячеек электронного документа
         |   ДанныеТаблицы0 - Соответствие значений ячеек электронного документа (используется для строки табличной части)
         |Встроенные функции, функции общих модулей.'; uk = 'В тексті виразу можна використовувати наступні змінні:
         |   Результат      - результат обчислення (на вході - ""Неопределено"")
         |   ДанныеТаблицы - ""Соответствие"" значень полів електронного документа
         |   ДанныеТаблицы0 - ""Соответствие"" значень полів електронного документа (ШАПКА)
         |Встроєні функції, функції загальних модулів.'"
		 );
	Иначе
		НадписьТекстВыражения = "";
	КонецЕсли;
КонецПроцедуры

