#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ВидТехники") Тогда
		УстановитьОтборПоВидуТехники(Параметры.ВидТехники);	
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборПоВидуТехники(ВидТехники)

	Список.Отбор.Элементы.Очистить();	
	ПараметрыОтбора = Новый СписокЗначений;
	ПараметрыОтбора.Добавить(Перечисления.ИНАГРО_ВидыТехники.ПустаяСсылка());

	Для Каждого СтрокаВидТехники Из ВидТехники Цикл
		ПараметрыОтбора.Добавить(СтрокаВидТехники);
	КонецЦикла;
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("МаркаМодельТС.ВидТехники");
    ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
    ЭлементОтбора.Использование = Истина;
    ЭлементОтбора.ПравоеЗначение = ПараметрыОтбора;
	
КонецПроцедуры

#КонецОбласти
