// Устанавливает список счетов учета
//
Процедура УстановитьСписокСчетовУчетаНоменклатурыБА(СтруктураДопПараметров) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_КорректировкаСтоимостиСервер");
	Если Обр <> Неопределено Тогда
		Обр.УстановитьСписокСчетовУчетаНоменклатурыБА(СтруктураДопПараметров);
	КонецЕсли;
КонецПроцедуры

// Производит расчет.
//
Процедура РассчитатьСписаниеПоСреднейБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_КорректировкаСтоимостиСервер");
	Если Обр <> Неопределено Тогда
		Обр.РассчитатьСписаниеПоСреднейБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров);
	КонецЕсли;
КонецПроцедуры

// Получает таблицу операций 
//
Функция ПолучитьТаблицуОперацийСписанияБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_КорректировкаСтоимостиСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ПолучитьТаблицуОперацийСписанияБА(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров);
	КонецЕсли;
КонецФункции

// Получает таблицу операций 
//
Функция ПолучитьТаблицуОперацийСписанияКомплектов(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров) Экспорт
	Обр = ИНАГРО_ДирективыПрепроцессору.ИНАГРО_ВызовЗащищеннойОбработки("ИНАГРО_КорректировкаСтоимостиСервер");
	Если Обр <> Неопределено Тогда
		Возврат Обр.ПолучитьТаблицуОперацийСписанияКомплектов(ТаблицаТоваров, ДатаНач, ДатаКон, СтруктураДопПараметров);
	КонецЕсли;
КонецФункции

