#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаЗаписи Из ЭтотОбъект Цикл
		
		Если ТипЗнч(ЭтотОбъект.Отбор.Регистратор.Значение) = Тип("ДокументССылка.Инагро_ПрочиеЗатраты") Тогда
			Если ЭтотОбъект.Отбор.Регистратор.Значение.ВидОперации = Перечисления.ИНАГРО_ВидыОперацийПрочиеЗатраты.Списание Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		Если СтрокаЗаписи.СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения, "ВидСубконто") = Неопределено
			И ЗначениеЗаполнено(СтрокаЗаписи.Подразделение) Тогда 
			СтрокаЗаписи.Подразделение = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		КонецЕсли;
		
		Если СтрокаЗаписи.СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы, "ВидСубконто") = Неопределено
			И ЗначениеЗаполнено(СтрокаЗаписи.НоменклатурнаяГруппа) Тогда 
			СтрокаЗаписи.НоменклатурнаяГруппа = Справочники.НоменклатурныеГруппы.ПустаяСсылка();
		КонецЕсли;
		
		Если СтрокаЗаписи.СчетЗатрат.ВидыСубконто.Найти(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат, "ВидСубконто") = Неопределено
			И ЗначениеЗаполнено(СтрокаЗаписи.СтатьяЗатрат) Тогда 
			СтрокаЗаписи.СтатьяЗатрат = Справочники.СтатьиЗатрат.ПустаяСсылка();
		КонецЕсли;    		
		
	КонецЦикла;		
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли