Функция мРазложитьСтрокуВМассивПодстрок(Знач Стр, Разделитель = ",") Экспорт
	
	МассивСтрок = Новый Массив();
	Если Разделитель = " " Тогда
		Стр = СокрЛП(Стр);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = СокрЛ(Сред(Стр,Поз));
		КонецЦикла;
	Иначе
		ДлинаРазделителя = СтрДлина(Разделитель);
		Пока 1=1 Цикл
			Поз = Найти(Стр,Разделитель);
			Если Поз=0 Тогда
				МассивСтрок.Добавить(Стр);
				Возврат МассивСтрок;
			КонецЕсли;
			МассивСтрок.Добавить(Лев(Стр,Поз-1));
			Стр = Сред(Стр,Поз+ДлинаРазделителя);
		КонецЦикла;
	КонецЕсли;
	
КонецФункции // глРазложить

Функция ПрочитатьНастройкиТаблицыДанных(знач ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек)
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	НомерТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	
	Если НомерТаблицы = "" Тогда
		НомерТаблицы = "0";
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ИмяТабличнойЧасти:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ИмяТабличнойЧасти = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ИмяТабличнойЧасти<>"" Тогда
		СтруктураНастроек.Вставить("ИмяТабличнойЧасти" + НомерТаблицы, ИмяТабличнойЧасти);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "Пометка" Тогда
		Возврат Ложь;
	КонецЕсли;
	ТекущаяСтрока = ТекущаяСтрока + 2;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	
	СтруктураРеквизитов = Новый Структура;
	Пока Истина Цикл
		Если ТекущаяСтрока > Настройки.ВысотаТаблицы Тогда
			Возврат Ложь;
		КонецЕсли;
		ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
		Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
		Если Текст = "КонецТаблицы" Тогда
			ТекущаяСтрока = ТекущаяСтрока + 1;
			Прервать;
		Иначе
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
			Если ИмяРеквизита = "" Тогда
				Возврат Ложь;
			КонецЕсли;
			
			СтруктураРеквизита = Новый Структура;
			СтруктураРеквизита.Вставить("ИмяРеквизита", ИмяРеквизита);
			СтруктураРеквизита.Вставить("Пометка", Не ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст));
			СтруктураРеквизита.Вставить("ПолеПоиска", Не ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст));
			
			Типы = Новый Массив;
			ОписаниеТиповСтрокой = Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст;
			Для к = 1 По СтрЧислоСтрок(ОписаниеТиповСтрокой)  Цикл
				кс = Неопределено;кч = Неопределено;кд = Неопределено;
				МассивЧастейТипа = мРазложитьСтрокуВМассивПодстрок(НРег(СокрЛП(СтрПолучитьСтроку(ОписаниеТиповСтрокой,к ))), ",");
				Если МассивЧастейТипа.Количество() = 0 Тогда
					Продолжить;
				ИначеЕсли Найти(МассивЧастейТипа[0],".") Тогда
					Попытка
						Тип = Тип(СтрЗаменить(МассивЧастейТипа[0],".","Ссылка."));
					Исключение
						Сообщить(ОписаниеОшибки());
						Возврат Ложь;
					КонецПопытки;
				ИначеЕсли МассивЧастейТипа[0] = "строка" Тогда
					Тип = Тип("Строка");
					Если МассивЧастейТипа.Количество() = 2 Тогда
						кс = Новый КвалификаторыСтроки(скEDI_СозданиеДокументовСервер.мПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Переменная);
					ИначеЕсли МассивЧастейТипа.Количество() = 3 Тогда
						кс = Новый КвалификаторыСтроки(скEDI_СозданиеДокументовСервер.мПривестиКЧислу(МассивЧастейТипа[1]),ДопустимаяДлина.Фиксированная);
					Иначе
						кс = Новый КвалификаторыСтроки;
					КонецЕсли;
				ИначеЕсли МассивЧастейТипа[0] = "число" Тогда
					Тип = Тип("Число");
					кч = Новый КвалификаторыЧисла(скEDI_СозданиеДокументовСервер.мПривестиКЧислу(МассивЧастейТипа[1]),скEDI_СозданиеДокументовСервер.мПривестиКЧислу(МассивЧастейТипа[2]),?(МассивЧастейТипа.Количество() = 4, ДопустимыйЗнак.Неотрицательный, ДопустимыйЗнак.Любой));
				ИначеЕсли МассивЧастейТипа[0] = "булево" Тогда
					Тип = Тип("Булево");
				ИначеЕсли МассивЧастейТипа[0] = "дата" Тогда
					Тип = Тип("Дата");
					кд = Новый КвалификаторыДаты(ЧастиДаты.Дата);
				ИначеЕсли МассивЧастейТипа[0] = "время" Тогда
					Тип = Тип("Дата");
					кд = Новый КвалификаторыДаты(ЧастиДаты.Время);
				ИначеЕсли МассивЧастейТипа[0] = "час" Тогда
					Тип = Тип("Дата");
					кд = Новый КвалификаторыДаты(ЧастиДаты.Время);
				ИначеЕсли МассивЧастейТипа[0] = "дата и время" Тогда
					Тип = Тип("Дата");
					кд = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
				ИначеЕсли МассивЧастейТипа[0] = "дата і час" Тогда
					Тип = Тип("Дата");
					кд = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
				Иначе
					Продолжить;
				КонецЕсли;
				Типы.Добавить(Тип);
			КонецЦикла;
			ОписаниеТипов = Новый ОписаниеТипов(Типы, кч, кс, кд);
			СтруктураРеквизита.Вставить("ОписаниеТипов", ОписаниеТипов);
			
			РежимЗагрузкиРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст;
			
			СтруктураРеквизита.Вставить("РежимЗагрузки", РежимЗагрузкиРеквизита);
			
			ЗначениеПоУмолчанию = Настройки.Область(ТекущаяСтрокаОбласти + "C6").Текст;
			СтруктураРеквизита.Вставить("ЗначениеПоУмолчанию",?(ПустаяСтрока(ЗначениеПоУмолчанию), ОписаниеТипов.ПривестиЗначение(Неопределено), скEDI_СозданиеДокументовСервер.ПолучитьЗначениеИзСтрокиВнутр(ЗначениеПоУмолчанию)));
			
			Если РежимЗагрузкиРеквизита = "Вычислять" Тогда
				СтруктураРеквизита.Вставить("Выражение",Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст);
			Иначе
				СтруктураРеквизита.Вставить("ИскатьПо",Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст);
				СвязьПоВладельцу   = Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст;
				СтруктураРеквизита.Вставить("СвязьПоВладельцу",?(Лев(СвязьПоВладельцу,1) = "{",скEDI_СозданиеДокументовСервер.ПолучитьЗначениеИзСтрокиВнутр(СвязьПоВладельцу), СвязьПоВладельцу));
				СвязьПоТипу        = Настройки.Область(ТекущаяСтрокаОбласти + "C9").Текст;
				СтруктураРеквизита.Вставить("СвязьПоТипу",?(Лев(СвязьПоТипу,1) = "{",скEDI_СозданиеДокументовСервер.ПолучитьЗначениеИзСтрокиВнутр(СвязьПоТипу), СвязьПоТипу));
				СтруктураРеквизита.Вставить("ЭлементСвязиПоТипу",скEDI_СозданиеДокументовСервер.мПривестиКЧислу(Настройки.Область(ТекущаяСтрокаОбласти + "C10").Текст));
			КонецЕсли;

			СтруктураРеквизита.Вставить("ИмяРеквизитаШаблона",Настройки.Область(ТекущаяСтрокаОбласти + "C11").Текст);
			
			СтруктураРеквизитов.Вставить(СтруктураРеквизита.ИмяРеквизита, СтруктураРеквизита);

			ТекущаяСтрока = ТекущаяСтрока + 1;
		КонецЕсли;
	КонецЦикла;
	СтруктураНастроек.Вставить("Реквизиты" + НомерТаблицы, СтруктураРеквизитов);
	
	
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст = "" Тогда
		ТекущаяСтрока = ТекущаяСтрока + 1;
		Возврат Истина;
	ИначеЕсли Текст = "После добавления строки" Тогда
		ПослеДобавленияСтроки = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
		Если ПослеДобавленияСтроки<>"" Тогда
			СтруктураНастроек.Вставить("ПослеДобавленияСтрокиТабличнойЧасти" + НомерТаблицы, ПослеДобавленияСтроки);
		КонецЕсли;
		ТекущаяСтрока = ТекущаяСтрока + 1;
		Возврат Истина;
	Иначе		
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПрочитатьНастройкиОбработчиковСобытий(знач ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек)
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "Поиск" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПоискДокумента = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ПоискДокумента<>"" Тогда
		СтруктураНастроек.Вставить("ПоискДокумента", ПоискДокумента);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "При создании" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПриСозданииДокумента = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ПриСозданииДокумента<>"" Тогда
		СтруктураНастроек.Вставить("ПриСозданииДокумента", ПриСозданииДокумента);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "Перед записью" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПередЗаписьюДокумента = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ПередЗаписьюДокумента<>"" Тогда
		СтруктураНастроек.Вставить("ПередЗаписьюДокумента", ПередЗаписьюДокумента);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "При записи" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПриЗаписиДокумента = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ПередЗаписьюДокумента<>"" Тогда
		СтруктураНастроек.Вставить("ПриЗаписиДокумента", ПриЗаписиДокумента);
	КонецЕсли;
	
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	Возврат Истина;
КонецФункции

Функция ПрочитатьНастройкиТаблицыТиповойСхеммы(знач ВерсияФормата, Настройки, ТекущаяСтрока, МассивТаблиц)
	СтруктураНастроек = Новый Структура("НомерТаблицы,Обязательно,ИмяТаблицы,ОписаниеТаблицы,МассивПолей", 0, Ложь, "", "");
	
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "НомерТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	НомерТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если НомерТаблицы <> "" Тогда
		СтруктураНастроек.Вставить("НомерТаблицы", Число(НомерТаблицы));
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ИмяТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ИмяТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ИмяТаблицы<>"" Тогда
		СтруктураНастроек.Вставить("ИмяТаблицы", ИмяТаблицы);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ОписаниеТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ОписаниеТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ОписаниеТаблицы<>"" Тогда
		СтруктураНастроек.Вставить("ОписаниеТаблицы", ОписаниеТаблицы);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "Обязательно:" Тогда
		Возврат Ложь;
	КонецЕсли;
	Обязательно = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если Не ПустаяСтрока(Обязательно) Тогда
		СтруктураНастроек.Вставить("Обязательно", Истина);
	КонецЕсли;
	
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "Обязательно" Тогда
		Возврат Ложь;
	КонецЕсли;
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	
	//СтруктураРеквизитов = Новый Структура;
	МассивПолей = Новый Массив;
	Пока Истина Цикл
		Если ТекущаяСтрока > Настройки.ВысотаТаблицы Тогда
			Возврат Ложь;
		КонецЕсли;
		ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
		Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
		Если Текст = "КонецТаблицы" Тогда
			ТекущаяСтрока = ТекущаяСтрока + 1;
			Прервать;
		Иначе
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
			Если ИмяРеквизита = "" Тогда
				Возврат Ложь;
			КонецЕсли;
			
			СтруктураРеквизита = Новый Структура;
			СтруктураРеквизита.Вставить("ИмяРеквизита", ИмяРеквизита);
			СтруктураРеквизита.Вставить("Обязательно", Не ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст));
			СтруктураРеквизита.Вставить("Тип", Число(Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст));
			СтруктураРеквизита.Вставить("Описание", Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст);
			СтруктураРеквизита.Вставить("ТипТекст", Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст);
			
			//СтруктураРеквизитов.Вставить(СтруктураРеквизита.ИмяРеквизита, СтруктураРеквизита);
			МассивПолей.Добавить(СтруктураРеквизита);

			ТекущаяСтрока = ТекущаяСтрока + 1;
		КонецЕсли;
	КонецЦикла;
	СтруктураНастроек.Вставить("МассивПолей", МассивПолей);
	МассивТаблиц.Добавить(СтруктураНастроек);
	Возврат Истина;
КонецФункции

Функция ПрочитатьНастройкиЭтоТиповаяСхемма(знач ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек)
	ТекущаяСтрока = ТекущаяСтрока + 1;
	
	МассивТаблиц = Новый Массив;
	
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	
	Пока Текст <> "КонецНастроекТиповойСхеммы" Цикл
		Если не ПрочитатьНастройкиТаблицыТиповойСхеммы(ВерсияФормата, Настройки, ТекущаяСтрока, МассивТаблиц) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
		Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	КонецЦикла;
	Если МассивТаблиц.Количество() > 0 Тогда
		СтруктураНастроек.ЭтоТиповаяСхемма = Истина;
		СтруктураНастроек.ТиповаяСхемма_Таблицы = МассивТаблиц;
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	Возврат Истина;
КонецФункции

Функция ПрочитатьНастройкиТаблицыПоТиповойСхемме(знач ВерсияФормата, Настройки, ТекущаяСтрока, МассивТаблиц)
	СтруктураНастроек = Новый Структура("НомерТаблицы,Обязательно,ИмяТаблицы,ОписаниеТаблицы,НастройкаНомерТаблицы,НастройкаИмяТаблицы,НастройкаОписаниеТаблицы,МассивПолей", 0, Ложь, "", "", 0, "", "");
	
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "НомерТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	НомерТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если НомерТаблицы <> "" Тогда
		СтруктураНастроек.Вставить("НомерТаблицы", Число(НомерТаблицы));
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ИмяТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ИмяТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ИмяТаблицы<>"" Тогда
		СтруктураНастроек.Вставить("ИмяТаблицы", ИмяТаблицы);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ОписаниеТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ОписаниеТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если ОписаниеТаблицы<>"" Тогда
		СтруктураНастроек.Вставить("ОписаниеТаблицы", ОписаниеТаблицы);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "Обязательно:" Тогда
		Возврат Ложь;
	КонецЕсли;
	Обязательно = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если Не ПустаяСтрока(Обязательно) Тогда
		СтруктураНастроек.Вставить("Обязательно", Истина);
	КонецЕсли;
	
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "НастройкаНомерТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	НастройкаНомерТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если НастройкаНомерТаблицы <> "" Тогда
		СтруктураНастроек.Вставить("НастройкаНомерТаблицы", Число(НастройкаНомерТаблицы));
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "НастройкаИмяТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	НастройкаИмяТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если НастройкаИмяТаблицы<>"" Тогда
		СтруктураНастроек.Вставить("НастройкаИмяТаблицы", НастройкаИмяТаблицы);
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "НастройкаОписаниеТаблицы:" Тогда
		Возврат Ложь;
	КонецЕсли;
	НастройкаОписаниеТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	Если НастройкаОписаниеТаблицы<>"" Тогда
		СтруктураНастроек.Вставить("НастройкаОписаниеТаблицы", ОписаниеТаблицы);
	КонецЕсли;
	
	
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "Обязательно" Тогда
		Возврат Ложь;
	КонецЕсли;
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	
	//СтруктураРеквизитов = Новый Структура;
	МассивПолей = Новый Массив;
	Пока Истина Цикл
		Если ТекущаяСтрока > Настройки.ВысотаТаблицы Тогда
			Возврат Ложь;
		КонецЕсли;
		ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
		Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
		Если Текст = "КонецТаблицы" Тогда
			ТекущаяСтрока = ТекущаяСтрока + 1;
			Прервать;
		Иначе
			ИмяРеквизита = Настройки.Область(ТекущаяСтрокаОбласти + "C2").Текст;
			Если ИмяРеквизита = "" Тогда
				Возврат Ложь;
			КонецЕсли;
			
			СтруктураРеквизита = Новый Структура;
			СтруктураРеквизита.Вставить("ИмяРеквизита", ИмяРеквизита);
			СтруктураРеквизита.Вставить("Обязательно", Не ПустаяСтрока(Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст));
			СтруктураРеквизита.Вставить("Тип", Число(Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст));
			СтруктураРеквизита.Вставить("Описание", Настройки.Область(ТекущаяСтрокаОбласти + "C4").Текст);
			СтруктураРеквизита.Вставить("ТипТекст", Настройки.Область(ТекущаяСтрокаОбласти + "C5").Текст);
			НастройкаНомерТаблицы = Настройки.Область(ТекущаяСтрокаОбласти + "C6").Текст;
			Если НастройкаНомерТаблицы = "" Тогда
				СтруктураРеквизита.Вставить("НастройкаНомерТаблицы", 0);
			Иначе
				СтруктураРеквизита.Вставить("НастройкаНомерТаблицы", Число(НастройкаНомерТаблицы));
			КонецЕсли;
			СтруктураРеквизита.Вставить("НастройкаИмяРеквизита", Настройки.Область(ТекущаяСтрокаОбласти + "C7").Текст);
			СтруктураРеквизита.Вставить("НастройкаТип", Настройки.Область(ТекущаяСтрокаОбласти + "C8").Текст);
			СтруктураРеквизита.Вставить("НастройкаОписание", Настройки.Область(ТекущаяСтрокаОбласти + "C9").Текст);
			СтруктураРеквизита.Вставить("НастройкаТипТекст", Настройки.Область(ТекущаяСтрокаОбласти + "C10").Текст);
			СтруктураРеквизита.Вставить("НастройкаВыражение", Настройки.Область(ТекущаяСтрокаОбласти + "C11").Текст);
			
			//СтруктураРеквизитов.Вставить(СтруктураРеквизита.ИмяРеквизита, СтруктураРеквизита);
			МассивПолей.Добавить(СтруктураРеквизита);

			ТекущаяСтрока = ТекущаяСтрока + 1;
		КонецЕсли;
	КонецЦикла;
	СтруктураНастроек.Вставить("МассивПолей", МассивПолей);
	МассивТаблиц.Добавить(СтруктураНастроек);
	Возврат Истина;
КонецФункции

Функция ПрочитатьНастройкиНастройкиПоТиповойСхемме(знач ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек)
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ЕДРПОУВладельцаШаблона:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПоТиповойСхеммеЕДРПОУВладельцаШаблона = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ИмяШаблона:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПоТиповойСхеммеИмяШаблона = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ВерсияШаблона:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПоТиповойСхеммеВерсияШаблона = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
	Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	Если Текст <> "ВидДокумента1С:" Тогда
		Возврат Ложь;
	КонецЕсли;
	ПоТиповойСхеммеВидДокумента1С = Настройки.Область(ТекущаяСтрокаОбласти + "C3").Текст;
	
	ТекущаяСтрока = ТекущаяСтрока + 2;
	ТекущаяСтрока = ТекущаяСтрока + 1;
	
	МассивТаблиц = Новый Массив;
	Пока Текст <> "КонецНастроекПоТиповойСхемме" Цикл
		Если не ПрочитатьНастройкиТаблицыПоТиповойСхемме(ВерсияФормата, Настройки, ТекущаяСтрока, МассивТаблиц) Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
		Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
	КонецЦикла;
	Если МассивТаблиц.Количество() > 0 Тогда
		СтруктураНастроек.ПоТиповойСхемме = Истина;
		СтруктураНастроек.ПоТиповойСхеммеЕДРПОУВладельцаШаблона = ПоТиповойСхеммеЕДРПОУВладельцаШаблона;
		СтруктураНастроек.ПоТиповойСхеммеИмяШаблона = ПоТиповойСхеммеИмяШаблона;
		СтруктураНастроек.ПоТиповойСхеммеВерсияШаблона = ПоТиповойСхеммеВерсияШаблона;
		СтруктураНастроек.ПоТиповойСхеммеВидДокумента1С = ПоТиповойСхеммеВидДокумента1С;
		СтруктураНастроек.НастройкиТиповойСхеммы_Таблицы = МассивТаблиц;
	КонецЕсли;
	
	ТекущаяСтрока = ТекущаяСтрока + 1;
	Возврат Истина;
КонецФункции

Функция ОбработатьНастройки(Настройки, ИмяШаблона, СтруктураНастроек) экспорт
	ИмяШаблона = "";
	СтруктураНастроек = Новый Структура("Версия,ПоискДокумента,ПриСозданииДокумента,ПередЗаписьюДокумента,"
	+"ПриЗаписиДокумента,РедактироватьНайденыйДокумент,ПрикреплятьВложеныеФайлы,ПрикреплятьИзображениеДокументаPDF,"
	+"Реквизиты0,"
	+"ИмяТабличнойЧасти1,Реквизиты1,ПослеДобавленияСтрокиТабличнойЧасти1,"
	+"ИмяТабличнойЧасти2,Реквизиты2,ПослеДобавленияСтрокиТабличнойЧасти2,"
	+"ИмяТабличнойЧасти3,Реквизиты3,ПослеДобавленияСтрокиТабличнойЧасти3,"
	+"ИмяТабличнойЧасти4,Реквизиты4,ПослеДобавленияСтрокиТабличнойЧасти4,"
	+"ИмяТабличнойЧасти5,Реквизиты5,ПослеДобавленияСтрокиТабличнойЧасти5,"
	+"ЭтоТиповаяСхемма,ТиповаяСхемма_Таблицы,"
	+"ПоТиповойСхемме,ПоТиповойСхеммеЕДРПОУВладельцаШаблона,ПоТиповойСхеммеИмяШаблона,"
	+"ПоТиповойСхеммеВерсияШаблона,ПоТиповойСхеммеВидДокумента1С,НастройкиТиповойСхеммы_Таблицы");
	
	Если ТипЗнч(Настройки) = Тип("ТабличныйДокумент") Тогда
		
		ВерсияФормата = СокрЛП(Настройки.Область("R1C5").Текст);
		Если ВерсияФормата = "1.1" Тогда
			ТекущаяСтрока = 8; //Строка с которой начинается обработка реквизитов
		Иначе
			Возврат Ложь;
		КонецЕсли;
		СтруктураНастроек.Версия = ВерсияФормата;
		
		ИмяШаблона = СокрЛП(Настройки.Область("R3C5").Текст);
		СтруктураНастроек.РедактироватьНайденыйДокумент = Не ПустаяСтрока(Настройки.Область("R4C5").Текст);
		
		СтруктураНастроек.ЭтоТиповаяСхемма = Ложь;
		СтруктураНастроек.ПоТиповойСхемме = Ложь;
		
		СтруктураНастроек.ПрикреплятьВложеныеФайлы = Ложь;
		Если ВРег(Настройки.Область("R5C1").Текст) = ВРег("Прикреплять вложеные файлы") Тогда
			СтруктураНастроек.ПрикреплятьВложеныеФайлы = Не ПустаяСтрока(Настройки.Область("R5C5").Текст);
		КонецЕсли;
		СтруктураНастроек.ПрикреплятьИзображениеДокументаPDF = Ложь;
		Если ВРег(Настройки.Область("R6C1").Текст) = ВРег("Прикреплять изображение документа PDF") Тогда
			СтруктураНастроек.ПрикреплятьИзображениеДокументаPDF = Не ПустаяСтрока(Настройки.Область("R6C5").Текст);
		КонецЕсли;
		
		Текст = "";
		Пока Истина Цикл
			Если ТекущаяСтрока > Настройки.ВысотаТаблицы Тогда
				Прервать;
			КонецЕсли;
			ТекущаяСтрокаОбласти = "R" + Формат(ТекущаяСтрока, "ЧГ=");
			Текст = Настройки.Область(ТекущаяСтрокаОбласти + "C1").Текст;
			Если Текст = "" Тогда
				ТекущаяСтрока = ТекущаяСтрока + 1;
			ИначеЕсли Текст = "ТаблицаДанных:" Тогда
				Если не ПрочитатьНастройкиТаблицыДанных(ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек) Тогда
					Возврат Ложь;
				КонецЕсли;
			ИначеЕсли Текст = "Обработчики событий:" Тогда
				Если не ПрочитатьНастройкиОбработчиковСобытий(ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек) Тогда
					Возврат Ложь;
				КонецЕсли;
			ИначеЕсли Текст = "ЭтоТиповаяСхемма" Тогда
				Если не ПрочитатьНастройкиЭтоТиповаяСхемма(ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек) Тогда
					Возврат Ложь;
				КонецЕсли;
			ИначеЕсли Текст = "НастройкиПоТиповойСхемме" Тогда
				Если не ПрочитатьНастройкиНастройкиПоТиповойСхемме(ВерсияФормата, Настройки, ТекущаяСтрока, СтруктураНастроек) Тогда
					Возврат Ложь;
				КонецЕсли;
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции



