//added by Al
&НаСервере
Процедура ПодготовитьИРазместитьНетиповыеЭлементыНаФорме()
	                                                                         
	//создания реквизитов
	СМС_ДФИ_КлиентСервер.СздПоле(ЭтаФорма, "СМС_УстанавливатьПризнакОбработаноПриОтправкеИсходящегоДокументаКонтрагенту",,,
								 2, "Объект.СМС_УстанавливатьПризнакОбработаноПриОтправкеИсходящегоДокументаКонтрагенту");
	
КонецПроцедуры
//added by Al

&НаСервере
Процедура СМС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ПодготовитьИРазместитьНетиповыеЭлементыНаФорме();
КонецПроцедуры
