
#Область СлужебныеПроцедурыИФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);  	
		
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
	
	 МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));;

	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ); 
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных,Истина);   
	
	ПоказыватьДокументы = Ложь;
	ПоказыватьКачество  = Ложь;
	
	Если ТЗ.Количество() = 0 Тогда // выводим пустую шапку отчета
		
		ПериодОтчета = Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
		
		Если ПериодОтчета <> Неопределено Тогда
			Если ПериодОтчета.Использование = Истина Тогда
				НачалоОтчета = ПериодОтчета.Значение.ДатаНачала;
				КонецОтчета = ПериодОтчета.Значение.ДатаОкончания;
			КонецЕсли; 
		КонецЕсли;  
		
		МакетЗаголовка = ПолучитьМакет("Заголовок");
		ОбластьЗаголовок = МакетЗаголовка.ПолучитьОбласть("Шапка");
		ОбластьЗаголовок.Параметры.ТекДата	   = ТекущаяДата();
		ОбластьЗаголовок.Параметры.ДатаНачала    = Формат(НачалоОтчета,"ДФ=dd.MM.yyyy");
		ОбластьЗаголовок.Параметры.ДатаОкончания = Формат(КонецОтчета,"ДФ=dd.MM.yyyy");
		
		ДокументРезультат.Вывести(ОбластьЗаголовок);
		
	КонецЕсли;   
	
	ПараметрДокументы = Настройки.ПараметрыДанных.Элементы.Найти("ПоказыватьДокументы");
	
	Если ПараметрДокументы <> Неопределено Тогда
		Если ПараметрДокументы.Использование = Истина Тогда
			ПоказыватьДокументы = ПараметрДокументы.Значение;
		КонецЕсли; 
	КонецЕсли; 
	
	ПараметрКачество = Настройки.ПараметрыДанных.Элементы.Найти("Качество");
	
	Если ПараметрКачество <> Неопределено Тогда
		Если ПараметрКачество.Использование = Истина Тогда
			ПоказыватьКачество = ПараметрКачество.Значение;
		КонецЕсли; 
	КонецЕсли;
	
	Если Не ПоказыватьДокументы Тогда
		УдалитьЛишниеОбласти(ДокументРезультат,"Документ",1);
	КонецЕсли; 
	
	Если Не ПоказыватьКачество Тогда
		 УдалитьЛишниеОбласти(ДокументРезультат,"Влажность",1);
		 УдалитьЛишниеОбласти(ДокументРезультат,"Вологість",1);

		 УдалитьЛишниеОбласти(ДокументРезультат,"Сорность",1);
		 УдалитьЛишниеОбласти(ДокументРезультат,"Смітність",1);

	 КонецЕсли; 
	 
	 ТаблицаЯчеек = Новый ТаблицаЗначений;
	 ТаблицаЯчеек.Колонки.Добавить("НазваниеОбласти");
	 ТаблицаЯчеек.Колонки.Добавить("Ширина");
	 
	 НоваяСтрока = ТаблицаЯчеек.Добавить();
	 НоваяСтрока.НазваниеОбласти = "Владелец";
	 НоваяСтрока.Ширина = 28;
	 
	 НоваяСтрока = ТаблицаЯчеек.Добавить();
	 НоваяСтрока.НазваниеОбласти = "Власник";
	 НоваяСтрока.Ширина = 28;

	 
	 НоваяСтрока = ТаблицаЯчеек.Добавить();
	 НоваяСтрока.НазваниеОбласти = "Влажность";
	 НоваяСтрока.Ширина = 10;
	 
	 НоваяСтрока = ТаблицаЯчеек.Добавить();
	 НоваяСтрока.НазваниеОбласти = "Вологість";
	 НоваяСтрока.Ширина = 10;
	 
	 НоваяСтрока = ТаблицаЯчеек.Добавить();
	 НоваяСтрока.НазваниеОбласти = "Степень";
	 НоваяСтрока.Ширина = 23;
	 
	 НоваяСтрока = ТаблицаЯчеек.Добавить();
	 НоваяСтрока.НазваниеОбласти = "Ступінь";
	 НоваяСтрока.Ширина = 23;   
	 
	 ВыровнятьШиринуЯчеек(ДокументРезультат,ТаблицаЯчеек); 	 
			
КонецПроцедуры

Процедура УдалитьЛишниеОбласти(ТабДок,НазваниеОбласти,КоличествоУдаляемыхКолонок)  
		
	ПрибавкаКОбласти = 2;
	
	Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл
		
		НачальнаяКолонка = 0;
		КолонкаДляУдаления = 0;
		Для индКол=1 По ТабДок.ШиринаТаблицы  Цикл
			
			Если ТабДок.Область(индСтр, индКол).Текст = НазваниеОбласти Тогда
				
				УдаляемаяОбласть1 = ТабДок.Область(индСтр, индКол, индСтр + ПрибавкаКОбласти, индКол + КоличествоУдаляемыхКолонок - 1);
				ТабДок.УдалитьОбласть(УдаляемаяОбласть1, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
				КолонкаДляУдаления = индКол;
				
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ КолонкаДляУдаления = 0 Тогда
			Прервать;	
		КонецЕсли; 
	КонецЦикла;
	
	Если КолонкаДляУдаления <> Неопределено И Не КолонкаДляУдаления = 0 Тогда 
		УдаляемаяОбласть2 = ТабДок.Область(индСтр + ПрибавкаКОбласти + 1, индКол, ТабДок.ВысотаТаблицы, индКол + КоличествоУдаляемыхКолонок - 1);	
		ТабДок.УдалитьОбласть(УдаляемаяОбласть2, ТипСмещенияТабличногоДокумента.ПоГоризонтали);	
	КонецЕсли; 
		
КонецПроцедуры

Процедура ВыровнятьШиринуЯчеек(ТабДок,ТаблицаЯчеек)
	
	Для индСтр=1 По ТабДок.ВысотаТаблицы Цикл
		
		НачальнаяКолонка = 0;
		КолонкаДляУдаления = 0;
		Для индКол=1 По ТабДок.ШиринаТаблицы  Цикл 			
			
			ОбластьМакета = ТабДок.Область(индСтр, индКол);
			
			МассивИмен = ТаблицаЯчеек.НайтиСтроки(Новый Структура("НазваниеОбласти",ОбластьМакета.Текст));
			
			Если МассивИмен.Количество() > 0 Тогда
				ОбластьМакета.ШиринаКолонки = МассивИмен[0].Ширина;
			КонецЕсли; 				
			
		КонецЦикла;
		
		Если НЕ КолонкаДляУдаления = 0 Тогда
			Прервать;	
		КонецЕсли; 
	КонецЦикла;

		
КонецПроцедуры

#КонецОбласти


