
&НаСервере
Процедура СМС_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ПодготовитьИРазместитьНетиповыеЭлементыНаФорме();
КонецПроцедуры

//added by Al
&НаСервере
Процедура ПодготовитьИРазместитьНетиповыеЭлементыНаФорме()
	
	//создаем реквизиты и их элементы
	СМС_ДФИ_КлиентСервер.СоздатьРеквизит(ЭтаФорма, "СписокИсключаемыхКонтрагентов", Новый ОписаниеТипов("СписокЗначений"));
	ЭтаФорма.СписокИсключаемыхКонтрагентов.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.Контрагенты");
	
	СМС_ДФИ_КлиентСервер.СздПоле(ЭтаФорма, "СписокИсключаемыхКонтрагентов",, 
								НСтр("ru = 'Список исключаемых контрагентов'; uk = 'Перелік контрагентів, що виключаються'"),1,
								"СписокИсключаемыхКонтрагентов",,,Элементы.ТекстЗапроса);
	              
	Элементы.СписокИсключаемыхКонтрагентов.УстановитьДействие("ПриИзменении", "СписокИсключаемыхКонтрагентовПриИзменении");              
	                                 
	//создаем декорации 
	ЗаголовокДекорации = НСтр("ru = 'Для отмены подписки создания электронного документа по конкретным контрагентам, 
									|нужно заполнить текст запроса, который исключит документы  из  списка. Параметр 
									|содержайщий  список  контрагентов называется ""СписокИсключаемыхКонтрагентов"", 
									|также параметром передается ссылка на документ как ""Ссылка"".'; 
							  		|uk = 'Для відміни підписки створення електронного документу по конкретних контрагентах, 
							  		|треба заповнити текст запиту,котрий виключить документи зі списку. Параметр, що
							  		|містить список контрагентів називаеється ""СписокИсключаемыхКонтрагентов"", також
							  		|параметром передається посилання на документ ""Ссылка"".'");                                 
	
	СМС_ДФИ_КлиентСервер.СздДекорацияНадпись(ЭтаФорма, "ДекорацияСписокИсключаемыхКонтрагентов",,ЗаголовокДекорации,,Элементы.ТекстЗапроса);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокИсключаемыхКонтрагентовПриИзменении(Элемент)
	
	Если СписокИсключаемыхКонтрагентов.Количество() И Запись.ТекстЗапроса = ""  Тогда
			
		ПредЗаполненныйТекстЗапроса = "ВЫБРАТЬ
		|ВЫРАЗИТЬ(&Ссылка КАК Документ." + ПолучитьБазовоеПредставлениеЗначенияНаСервере(Запись.ВидДокумента1С) + ") КАК Ссылка
		|ПОМЕСТИТЬ втДокумент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втДокумент.Ссылка КАК Ссылка
		|ИЗ
		|	втДокумент КАК втДокумент
		|ГДЕ
		|	НЕ втДокумент.Ссылка.Контрагент В (&СписокИсключаемыхКонтрагентов)";
		
		 Запись.ТекстЗапроса = ПредЗаполненныйТекстЗапроса;
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьБазовоеПредставлениеЗначенияНаСервере(ВидДокумента1С)
	Возврат XMLстрока(ВидДокумента1С);
КонецФункции	
//added by Al