
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоВладельцамПереключатель = 1;
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетНаСервере()
	Результат.Очистить();
	Об = РеквизитФормыВЗначение("Отчет");
	Возврат Об.ВывестиОтчет(СтандПериод.ДатаНачала,СтандПериод.ДатаОкончания);
КонецФункции

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	Результат = СформироватьОтчетНаСервере();
	Элементы.Результат.ОтображениеСостояния.Видимость = ложь;
	Элементы.Результат.ОтображениеСостояния.ДополнительныйРежимОтображения = ДополнительныйРежимОтображения.НеИспользовать; 
КонецПроцедуры

&НаКлиенте
Процедура ПоВладельцамПереключательПриИзменении(Элемент)
	Отчет.ПоВладельцам = ПоВладельцамПереключатель = 2;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиОтчетаНаСервере()

	Настройка = Новый Структура("ДатаНачала,ДатаОкончания,Организация,Владелец,Номенклатура,Склад,Урожай,ВидХранения,ПоВладельцам");
    Пользователь = Пользователи.ТекущийПользователь();

    ЗаполнитьЗначенияСвойств(Настройка, Отчет);
	Настройка.ДатаНачала 	= СтандПериод.ДатаНачала;
	Настройка.ДатаОкончания = СтандПериод.ДатаОкончания; 

    УстановитьПривилегированныйРежим(Истина);
    ХранилищеОбщихНастроек.Сохранить("Отчет.ИНАГРО_ХранениеЗерна", "Основной",Настройка,,Пользователь.Наименование);
    УстановитьПривилегированныйРежим(Ложь); 

КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиОтчета(Команда)
	СохранитьНастройкиОтчетаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНастройкиОтчетаНаСервере()
	
	Пользователь = Пользователи.ТекущийПользователь();

	УстановитьПривилегированныйРежим(Истина);
    ЗначениеНастроек = ХранилищеОбщихНастроек.Загрузить("Отчет.ИНАГРО_ХранениеЗерна","Основной",,Пользователь.Наименование);
    УстановитьПривилегированныйРежим(Ложь);
    
	Если ТипЗнч(ЗначениеНастроек) = Тип("Структура") Тогда  
		
		ЗаполнитьЗначенияСвойств(Отчет, ЗначениеНастроек);
		ЗаполнитьЗначенияСвойств(СтандПериод,ЗначениеНастроек);
        Если ЗначениеНастроек.Свойство("ПоВладельцам") Тогда
            ПоВладельцамПереключатель = ?(ЗначениеНастроек.ПоВладельцам,2,1);
        КонецЕсли;       

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьНастройкиОтчета(Команда)
	ЗагрузитьНастройкиОтчетаНаСервере();
КонецПроцедуры


