#Область СлужебныеПроцедурыИФункции

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Параметры.Отбор) Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Произвольная"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Пенсия2015"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Соцстрах"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Безработица"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Пенсия"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Субсидия"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Соцстрах2015"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Соцстрах2023"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.Субсидия2015"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ВидыСправокОДоходах.ДоходыИНалоги"));
		
	КонецЕсли;     
	
КонецПроцедуры

#КонецОбласти