
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	Настройки = КомпоновщикНастроек.ПолучитьНастройки(); 
		
	ПериодОтчета = Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета");
	Если НЕ ПериодОтчета.Использование Тогда
		Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение.ДатаНачала = '00010101';
		Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение.ДатаОкончания = '39991231235959';
		Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Использование = Истина;
	КонецЕсли; 	
		
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных, ,ДанныеРасшифровки, Истина);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);
	
	Если Настройки.ПараметрыДанных.Элементы.Найти("ПериодОтчета").Значение.ДатаОкончания = '39991231235959' Тогда
		Для индСтр=1 По ДокументРезультат.ВысотаТаблицы Цикл
			Для индКол=1 По ДокументРезультат.ШиринаТаблицы  Цикл		
				Если ДокументРезультат.Область(индСтр, индКол).Текст = "Параметры:" Или ДокументРезультат.Область(индСтр, индКол).Текст = "Параметри:" Тогда			
					ДокументРезультат.Область(индСтр, индКол, индСтр, индКол + 1).Текст = "";							
					Прервать;			
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
