#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ПорядокВыводаПодписи Экспорт; //хранит настройку порядка вывода подписи	
Перем ВестиНумерацияСтраниц Экспорт; //хранит признак ведения нумерации страниц
Перем ПечатьСНомера Экспорт; //хранит признак 
Перем НП Экспорт;  // Хранит настройку периода

Перем Выборка;

Перем фЗачистка,
АктЗачисткиКвоНачОстП,АктЗачисткиКвоНачОстР,
АктЗачисткиВесНачОстП,АктЗачисткиВесНачОстР,
АктЗачисткиВесПоВлНачОстП,АктЗачисткиВесПоВлНачОстР,
АктЗачисткиВесПоСорНачОстП,АктЗачисткиВесПоСорНачОстР;

#Область СлужебныеПроцедурыИФункции

Функция ВывестиОтчет() Экспорт
	
	КодЯзыкаПечать = "uk";
	ТабДок = Новый ТабличныйДокумент;
	
	//ПоказыватьУсушку = Ложь;
	
	Если Общая Тогда
		ТабДок = ВывестиОтчетПоФорма36Сводная();
	Иначе
		ТабДок = ВывестиОтчетПоФорма36();	
	КонецЕсли;

	Возврат ТабДок;
		
КонецФункции

Функция ВывестиОтчетПоФорма36Сводная() Экспорт
	
	Фильтр = ""; 
	Условия = "";
	СформироватьФильтр(Фильтр, Условия);	
	Запрос=Новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ВложенныйЗапрос.Организация КАК Организация,
	             |	ВложенныйЗапрос.Урожай КАК Урожай,
	             |	ВложенныйЗапрос.Склад КАК Склад,
	             |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	             |	ВложенныйЗапрос.ВидХранения КАК ВидХранения,
	             |	ВложенныйЗапрос.Регистратор КАК Регистратор,
	             |	ВложенныйЗапрос.Период КАК Период,
	             |	ВложенныйЗапрос.Влажность КАК Влажность,
	             |	ВложенныйЗапрос.СорнаяПримесь КАК СорнаяПримесь,
	             |	ВложенныйЗапрос.ЗерноваяПримесь КАК ЗерноваяПримесь,
	             |	ВложенныйЗапрос.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
	             |	ВложенныйЗапрос.РегистраторНомер КАК РегистраторНомер,
	             |	ВложенныйЗапрос.РегистраторДата КАК РегистраторДата,
	             |	СУММА(ВложенныйЗапрос.ВесПриход) КАК ВесПриход,
	             |	СУММА(ВложенныйЗапрос.КвоПриход) КАК КвоПриход,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриход) КАК ВесПоВлажностиПриход,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриход) КАК ВесПоСорнойПримесиПриход,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриход) КАК ВесПоЗерновойПримесиПриход,
	             |	СУММА(ВложенныйЗапрос.ВесРасход) КАК ВесРасход,
	             |	СУММА(ВложенныйЗапрос.КвоРасход) КАК КвоРасход,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасход) КАК ВесПоВлажностиРасход,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасход) КАК ВесПоСорнойПримесиРасход,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасход) КАК ВесПоЗерновойПримесиРасход,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушке) КАК УбыльВесаПриСушке,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеПриход) КАК УбыльВесаПриСушкеПриход,
	             |	СУММА(ВложенныйЗапрос.КвоПриходКонечныйОстатокПоДате) КАК КвоПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.КвоРасходКонечныйОстатокПоДате) КАК КвоРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПриходКонечныйОстатокПоДате) КАК ВесПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесРасходКонечныйОстатокПоДате) КАК ВесРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходКонечныйОстатокПоДате) КАК ВесПоВлажностиПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходКонечныйОстатокПоДате) КАК ВесПоВлажностиРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходКонечныйОстатокПоДате) КАК ВесПоСорнойПримесиПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходКонечныйОстатокПоДате) КАК ВесПоСорнойПримесиРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеКонечныйОстатокПоДате) КАК УбыльВесаПриСушкеКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПриходНачальныйОстаток) КАК ВесПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоПриходНачальныйОстаток) КАК КвоПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходНачальныйОстаток) КАК ВесПоВлажностиПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходНачальныйОстаток) КАК ВесПоСорнойПримесиПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриходНачальныйОстаток) КАК ВесПоЗерновойПримесиПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесРасходНачальныйОстаток) КАК ВесРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоРасходНачальныйОстаток) КАК КвоРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходНачальныйОстаток) КАК ВесПоВлажностиРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходНачальныйОстаток) КАК ВесПоСорнойПримесиРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасходНачальныйОстаток) КАК ВесПоЗерновойПримесиРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеНачальныйОстаток) КАК УбыльВесаПриСушкеНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПриходКонечныйОстаток) КАК ВесПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоПриходКонечныйОстаток) КАК КвоПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходКонечныйОстаток) КАК ВесПоВлажностиПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходКонечныйОстаток) КАК ВесПоСорнойПримесиПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриходКонечныйОстаток) КАК ВесПоЗерновойПримесиПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесРасходКонечныйОстаток) КАК ВесРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоРасходКонечныйОстаток) КАК КвоРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходКонечныйОстаток) КАК ВесПоВлажностиРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходКонечныйОстаток) КАК ВесПоСорнойПримесиРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасходКонечныйОстаток) КАК ВесПоЗерновойПримесиРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеКонечныйОстаток) КАК УбыльВесаПриСушкеКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПриходНачальныйОстатокПоДокументу) КАК ВесПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.КвоПриходНачальныйОстатокПоДокументу) КАК КвоПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходНачальныйОстатокПоДокументу) КАК ВесПоВлажностиПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу) КАК ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу) КАК ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесРасходНачальныйОстатокПоДокументу) КАК ВесРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.КвоРасходНачальныйОстатокПоДокументу) КАК КвоРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходНачальныйОстатокПоДокументу) КАК ВесПоВлажностиРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу) КАК ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу) КАК ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеНачальныйОстатокПоДокументу) КАК УбыльВесаПриСушкеНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПриходЗаМесяц) КАК ВесПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.КвоПриходЗаМесяц) КАК КвоПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходЗаМесяц) КАК ВесПоВлажностиПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходЗаМесяц) КАК ВесПоСорнойПримесиПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриходЗаМесяц) КАК ВесПоЗерновойПримесиПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесРасходЗаМесяц) КАК ВесРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.КвоРасходЗаМесяц) КАК КвоРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходЗаМесяц) КАК ВесПоВлажностиРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходЗаМесяц) КАК ВесПоСорнойПримесиРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиОстатокЗаМесяц) КАК ВесПоЗерновойПримесиОстатокЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеЗаМесяц) КАК УбыльВесаПриСушкеЗаМесяц,
	             |	ВложенныйЗапрос.Период_Месяц КАК Период_Месяц,
	             |	ВложенныйЗапрос.КодРасхода КАК КодРасхода
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ИНАГРО_Форма36.Организация КАК Организация,
	             |		ИНАГРО_Форма36.Урожай КАК Урожай,
	             |		ИНАГРО_Форма36.Склад КАК Склад,
	             |		ИНАГРО_Форма36.Номенклатура КАК Номенклатура,
	             |		ИНАГРО_Форма36.ВидХранения КАК ВидХранения,
	             |		ИНАГРО_Форма36.Регистратор КАК Регистратор,
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36.Период, ДЕНЬ) КАК Период,
	             |		ИНАГРО_Форма36.Влажность КАК Влажность,
	             |		ИНАГРО_Форма36.СорнаяПримесь КАК СорнаяПримесь,
	             |		ИНАГРО_Форма36.ЗерноваяПримесь КАК ЗерноваяПримесь,
	             |		ИНАГРО_Форма36.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.Регистратор ССЫЛКА Документ.ИНАГРО_РеестрТТНВвозЖД
	             |				ТОГДА ИНАГРО_РеестрТТНЖДВвозСписокТТН.НомерВагона
	             |			КОГДА ИНАГРО_Форма36.Регистратор ССЫЛКА Документ.ИНАГРО_РеестрТТНВывозЖД
	             |				ТОГДА ИНАГРО_РеестрТТНЖДВывозСписокТТН.НомерВагона
	             |			ИНАЧЕ ИНАГРО_Форма36.Регистратор.Номер
	             |		КОНЕЦ КАК РегистраторНомер,
	             |		ИНАГРО_Форма36.Регистратор.Дата КАК РегистраторДата,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПриход
	             |		КОНЕЦ КАК ВесПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.КвоПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.КвоПриход
	             |		КОНЕЦ КАК КвоПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоВлажностиПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоВлажностиПриход
	             |		КОНЕЦ КАК ВесПоВлажностиПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоСорнойПримесиПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоСорнойПримесиПриход
	             |		КОНЕЦ КАК ВесПоСорнойПримесиПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоЗерновойПримесиПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоЗерновойПримесиПриход
	             |		КОНЕЦ КАК ВесПоЗерновойПримесиПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесРасход
	             |		КОНЕЦ КАК ВесРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.КвоРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.КвоРасход
	             |		КОНЕЦ КАК КвоРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоВлажностиРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоВлажностиРасход
	             |		КОНЕЦ КАК ВесПоВлажностиРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоСорнойПримесиРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоСорнойПримесиРасход
	             |		КОНЕЦ КАК ВесПоСорнойПримесиРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоЗерновойПримесиРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоЗерновойПримесиРасход
	             |		КОНЕЦ КАК ВесПоЗерновойПримесиРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.УбыльВесаПриСушке
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.УбыльВесаПриСушке
	             |		КОНЕЦ КАК УбыльВесаПриСушке,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.УбыльВесаПриСушке
	             |			ИНАЧЕ 0
	             |		КОНЕЦ КАК УбыльВесаПриСушкеПриход,
	             |		0 КАК КвоПриходКонечныйОстатокПоДате,
	             |		0 КАК КвоРасходКонечныйОстатокПоДате,
	             |		0 КАК ВесПриходКонечныйОстатокПоДате,
	             |		0 КАК ВесРасходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоВлажностиПриходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоВлажностиРасходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоСорнойПримесиПриходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоСорнойПримесиРасходКонечныйОстатокПоДате,
	             |		0 КАК УбыльВесаПриСушкеКонечныйОстатокПоДате,
	             |		0 КАК ВесПриходНачальныйОстаток,
	             |		0 КАК КвоПриходНачальныйОстаток,
	             |		0 КАК ВесПоВлажностиПриходНачальныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиПриходНачальныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиПриходНачальныйОстаток,
	             |		0 КАК ВесРасходНачальныйОстаток,
	             |		0 КАК КвоРасходНачальныйОстаток,
	             |		0 КАК ВесПоВлажностиРасходНачальныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиРасходНачальныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиРасходНачальныйОстаток,
	             |		0 КАК УбыльВесаПриСушкеНачальныйОстаток,
	             |		0 КАК ВесПриходКонечныйОстаток,
	             |		0 КАК КвоПриходКонечныйОстаток,
	             |		0 КАК ВесПоВлажностиПриходКонечныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиПриходКонечныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиПриходКонечныйОстаток,
	             |		0 КАК ВесРасходКонечныйОстаток,
	             |		0 КАК КвоРасходКонечныйОстаток,
	             |		0 КАК ВесПоВлажностиРасходКонечныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиРасходКонечныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиРасходКонечныйОстаток,
	             |		0 КАК УбыльВесаПриСушкеКонечныйОстаток,
	             |		0 КАК ВесПриходНачальныйОстатокПоДокументу,
	             |		0 КАК КвоПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоВлажностиПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесРасходНачальныйОстатокПоДокументу,
	             |		0 КАК КвоРасходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоВлажностиРасходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу,
	             |		0 КАК УбыльВесаПриСушкеНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПриходЗаМесяц,
	             |		0 КАК КвоПриходЗаМесяц,
	             |		0 КАК ВесПоВлажностиПриходЗаМесяц,
	             |		0 КАК ВесПоСорнойПримесиПриходЗаМесяц,
	             |		0 КАК ВесПоЗерновойПримесиПриходЗаМесяц,
	             |		0 КАК ВесРасходЗаМесяц,
	             |		0 КАК КвоРасходЗаМесяц,
	             |		0 КАК ВесПоВлажностиРасходЗаМесяц,
	             |		0 КАК ВесПоСорнойПримесиРасходЗаМесяц,
	             |		0 КАК ВесПоЗерновойПримесиОстатокЗаМесяц,
	             |		0 КАК УбыльВесаПриСушкеЗаМесяц,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36.Период, МЕСЯЦ) КАК Период_Месяц,
	             |		ИНАГРО_Форма36.КодРасхода КАК КодРасхода
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36Сводная КАК ИНАГРО_Форма36
	             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВывозЖД.СписокТТН КАК ИНАГРО_РеестрТТНЖДВывозСписокТТН
	             |			ПО ИНАГРО_Форма36.ЛабораторныйАнализ = ИНАГРО_РеестрТТНЖДВывозСписокТТН.НомерАнализа
	             |				И ИНАГРО_Форма36.Влажность = ИНАГРО_РеестрТТНЖДВывозСписокТТН.Влажность
	             |				И ИНАГРО_Форма36.СорнаяПримесь = ИНАГРО_РеестрТТНЖДВывозСписокТТН.СорнаяПримесь
	             |				И ИНАГРО_Форма36.ЗерноваяПримесь = ИНАГРО_РеестрТТНЖДВывозСписокТТН.ЗерноваяПримесь
	             |				И ИНАГРО_Форма36.ВесРасход = ИНАГРО_РеестрТТНЖДВывозСписокТТН.ФизическийВес
	             |				И ИНАГРО_Форма36.Номенклатура = ИНАГРО_РеестрТТНЖДВывозСписокТТН.Номенклатура
	             |				И ИНАГРО_Форма36.Регистратор.Ссылка = ИНАГРО_РеестрТТНЖДВывозСписокТТН.Ссылка
	             |				И ИНАГРО_Форма36.НомерСтроки = ИНАГРО_РеестрТТНЖДВывозСписокТТН.НомерСтроки
	             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВвозЖД.СписокТТН КАК ИНАГРО_РеестрТТНЖДВвозСписокТТН
	             |			ПО ИНАГРО_Форма36.Номенклатура = ИНАГРО_РеестрТТНЖДВвозСписокТТН.Номенклатура
	             |				И ИНАГРО_Форма36.ЛабораторныйАнализ = ИНАГРО_РеестрТТНЖДВвозСписокТТН.НомерАнализа
	             |				И ИНАГРО_Форма36.Влажность = ИНАГРО_РеестрТТНЖДВвозСписокТТН.Влажность
	             |				И ИНАГРО_Форма36.СорнаяПримесь = ИНАГРО_РеестрТТНЖДВвозСписокТТН.СорнаяПримесь
	             |				И ИНАГРО_Форма36.ЗерноваяПримесь = ИНАГРО_РеестрТТНЖДВвозСписокТТН.ЗерноваяПримесь
	             |				И ИНАГРО_Форма36.ВесПриход = ИНАГРО_РеестрТТНЖДВвозСписокТТН.ФизическийВес
	             |				И ИНАГРО_Форма36.Регистратор.Ссылка = ИНАГРО_РеестрТТНЖДВвозСписокТТН.Ссылка
	             |				И ИНАГРО_Форма36.НомерСтроки = ИНАГРО_РеестрТТНЖДВвозСписокТТН.НомерСтроки
	             |	ГДЕ
	             |		ИНАГРО_Форма36.Период >= &НачалоПериода
	             |		И ИНАГРО_Форма36.Период <= &ДатаКонКонецДня
	             |		И &Условия
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Организация,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Урожай,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Склад,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Номенклатура,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВидХранения,
	             |		NULL,
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, ДЕНЬ),
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.УбыльВесаПриСушкеКонечныйОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, МЕСЯЦ),
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36Сводная.ОстаткиИОбороты(&НачалоМесяца, &КонецПериода, День, , &Фильтр) КАК ИНАГРО_Форма36ОстаткиИОбороты
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36Остатки.Организация,
	             |		ИНАГРО_Форма36Остатки.Урожай,
	             |		ИНАГРО_Форма36Остатки.Склад,
	             |		ИНАГРО_Форма36Остатки.Номенклатура,
	             |		ИНАГРО_Форма36Остатки.ВидХранения,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36Остатки.ВесПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.УбыльВесаПриСушкеОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36Сводная.Остатки(&ДатаНач, &Фильтр) КАК ИНАГРО_Форма36Остатки
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36Остатки.Организация,
	             |		ИНАГРО_Форма36Остатки.Урожай,
	             |		ИНАГРО_Форма36Остатки.Склад,
	             |		ИНАГРО_Форма36Остатки.Номенклатура,
	             |		ИНАГРО_Форма36Остатки.ВидХранения,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36Остатки.ВесПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.УбыльВесаПриСушкеОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36Сводная.Остатки(&КонецПериода, &Фильтр) КАК ИНАГРО_Форма36Остатки
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Организация,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Урожай,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Склад,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Номенклатура,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВидХранения,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Регистратор,
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, ДЕНЬ),
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Регистратор.Дата,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.УбыльВесаПриСушкеНачальныйОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, МЕСЯЦ),
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36Сводная.ОстаткиИОбороты(&ДатаНач, &КонецПериода, Регистратор, , &Фильтр) КАК ИНАГРО_Форма36ОстаткиИОбороты
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Организация,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Урожай,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Склад,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Номенклатура,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВидХранения,
	             |		NULL,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ПериодМесяц,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.УбыльВесаПриСушкеПриход,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.ПериодМесяц, МЕСЯЦ),
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36Сводная.ОстаткиИОбороты(&НачалоМесяца, &КонецПериода, Авто, , &Фильтр) КАК ИНАГРО_Форма36ОстаткиИОбороты
	             |	ГДЕ
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.ПериодМесяц, МЕСЯЦ) МЕЖДУ &НачалоМесяца И &КонПериода
	             |		И НЕ ИНАГРО_Форма36ОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИНАГРО_АктЗачистки) КАК ВложенныйЗапрос
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВложенныйЗапрос.Организация,
	             |	ВложенныйЗапрос.Урожай,
	             |	ВложенныйЗапрос.Склад,
	             |	ВложенныйЗапрос.Номенклатура,
	             |	ВложенныйЗапрос.ВидХранения,
	             |	ВложенныйЗапрос.Регистратор,
	             |	ВложенныйЗапрос.Период,
	             |	ВложенныйЗапрос.Влажность,
	             |	ВложенныйЗапрос.СорнаяПримесь,
	             |	ВложенныйЗапрос.ЗерноваяПримесь,
	             |	ВложенныйЗапрос.ЛабораторныйАнализ,
	             |	ВложенныйЗапрос.РегистраторНомер,
	             |	ВложенныйЗапрос.РегистраторДата,
	             |	ВложенныйЗапрос.Период_Месяц,
	             |	ВложенныйЗапрос.КодРасхода
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номенклатура,
	             |	Период_Месяц,
	             |	Период,
	             |	ВложенныйЗапрос.Регистратор.Дата,
	             |	Регистратор
	             |ИТОГИ
	             |	СУММА(ВесПриход),
	             |	СУММА(КвоПриход),
	             |	СУММА(ВесПоВлажностиПриход),
	             |	СУММА(ВесПоСорнойПримесиПриход),
	             |	СУММА(ВесПоЗерновойПримесиПриход),
	             |	СУММА(ВесРасход),
	             |	СУММА(КвоРасход),
	             |	СУММА(ВесПоВлажностиРасход),
	             |	СУММА(ВесПоСорнойПримесиРасход),
	             |	СУММА(ВесПоЗерновойПримесиРасход),
	             |	СУММА(УбыльВесаПриСушке),
	             |	СУММА(УбыльВесаПриСушкеПриход),
	             |	СУММА(КвоПриходКонечныйОстатокПоДате),
	             |	СУММА(КвоРасходКонечныйОстатокПоДате),
	             |	СУММА(ВесПриходКонечныйОстатокПоДате),
	             |	СУММА(ВесРасходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоВлажностиПриходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоВлажностиРасходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоСорнойПримесиПриходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоСорнойПримесиРасходКонечныйОстатокПоДате),
	             |	СУММА(УбыльВесаПриСушкеКонечныйОстатокПоДате),
	             |	СУММА(ВесПриходНачальныйОстаток),
	             |	СУММА(КвоПриходНачальныйОстаток),
	             |	СУММА(ВесПоВлажностиПриходНачальныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиПриходНачальныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиПриходНачальныйОстаток),
	             |	СУММА(ВесРасходНачальныйОстаток),
	             |	СУММА(КвоРасходНачальныйОстаток),
	             |	СУММА(ВесПоВлажностиРасходНачальныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиРасходНачальныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиРасходНачальныйОстаток),
	             |	СУММА(УбыльВесаПриСушкеНачальныйОстаток),
	             |	СУММА(ВесПриходКонечныйОстаток),
	             |	СУММА(КвоПриходКонечныйОстаток),
	             |	СУММА(ВесПоВлажностиПриходКонечныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиПриходКонечныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиПриходКонечныйОстаток),
	             |	СУММА(ВесРасходКонечныйОстаток),
	             |	СУММА(КвоРасходКонечныйОстаток),
	             |	СУММА(ВесПоВлажностиРасходКонечныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиРасходКонечныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиРасходКонечныйОстаток),
	             |	СУММА(УбыльВесаПриСушкеКонечныйОстаток),
	             |	СУММА(ВесПриходНачальныйОстатокПоДокументу),
	             |	СУММА(КвоПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоВлажностиПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесРасходНачальныйОстатокПоДокументу),
	             |	СУММА(КвоРасходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоВлажностиРасходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу),
	             |	СУММА(УбыльВесаПриСушкеНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПриходЗаМесяц),
	             |	СУММА(КвоПриходЗаМесяц),
	             |	СУММА(ВесПоВлажностиПриходЗаМесяц),
	             |	СУММА(ВесПоСорнойПримесиПриходЗаМесяц),
	             |	СУММА(ВесПоЗерновойПримесиПриходЗаМесяц),
	             |	СУММА(ВесРасходЗаМесяц),
	             |	СУММА(КвоРасходЗаМесяц),
	             |	СУММА(ВесПоВлажностиРасходЗаМесяц),
	             |	СУММА(ВесПоСорнойПримесиРасходЗаМесяц),
	             |	СУММА(ВесПоЗерновойПримесиОстатокЗаМесяц),
	             |	СУММА(УбыльВесаПриСушкеЗаМесяц)
	             |ПО
	             |	Склад,
	             |	Номенклатура,
	             |	Период_Месяц,
	             |	Период,
	             |	Регистратор";
	// "+фильтр+"
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Фильтр", Фильтр);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условия", Условия);
	
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ДатаНач",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("НачалоМесяца",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонПериода",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("КонецПериода",Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаКонКонецДня",КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("Организация",Организация);				
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Урожай",Урожай);
	Запрос.УстановитьПараметр("ВидХранения",ВидХранения);
	
	ТабДок = Новый ТабличныйДокумент;
	//ТабДок.Очистить();
	Макет = ЭтотОбъект.ПолучитьМакет("Форма36");
	ПреобразоватьМакет(Макет);
	
	КодЯзыкаПечать = "uk";
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	РезЗапроса = Запрос.Выполнить();
	КоличествоСтрокВВыборке=РезЗапроса.Выбрать().Количество();
	Если КоличествоСтрокВВыборке>0 Тогда
		
		//ОблШапка = СформироватьЗаголовок(ДатаНач,ДатаКон);	
		//ТабДок.Вывести(ОблШапка);
		//ВысотаШапки   					= ТабДок.ВысотаТаблицы;
		//ТабДок.ФиксацияСверху			= ВысотаШапки;		
		//ТабДок.ПовторятьПриПечатиСтроки = ТабДок.Область("R1:R" + ВысотаШапки);
		
		ОблНачОст 	= Макет.ПолучитьОбласть("Остаток");
		ОблКонОст 	= Макет.ПолучитьОбласть("ТМЦ");		
		ОблДатаДок 	= ?(ТолькоОборотЗаДень, Макет.ПолучитьОбласть("ОборотЗаДень"), Макет.ПолучитьОбласть("ДатаДок"));
		ОблТекДок 	= ПолучитьОбластьДляСтрокиДокумента(Макет); //Макет.ПолучитьОбласть("ТекДок");
		ОблКонец	= Макет.ПолучитьОбласть("Конец");
		ОблПодписи 	= Макет.ПолучитьОбласть("Подписи");
		
		ОблКонОстЗаМесяц	 	= Макет.ПолучитьОбласть("ТМЦ1ЗаМесяц");
		ОблКонОстПослеЗачистки 	= Макет.ПолучитьОбласть("ТМЦЗаУрожай");
		
		
		ОблШапкаИтогов 	= Макет.ПолучитьОбласть("ШапкаИтогов");
		ОблСтрокаИтогов = Макет.ПолучитьОбласть("СтрокаИтогов");
		ОблДноИтогов 	= Макет.ПолучитьОбласть("ДноИтогов");
		
		//Обнулить();
		//ОбнулитьОстаткиНаАктЗачистки();
		
		ВыборкаСклад = РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
		Если ЗначениеЗаполнено(НачальнаяСтраницаДляНумерации) Тогда
			НомерСтраницы = НачальнаяСтраницаДляНумерации;
		Иначе
			НомерСтраницы = 1;
		КонецЕсли;
		Пока ВыборкаСклад.Следующий() Цикл
			
			ВыборкаНом = ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
			Пока ВыборкаНом.Следующий() Цикл
				Если ВыводитьТолькоОбороты Тогда
					Если ВыборкаНом.ВесПриход = 0 И ВыборкаНом.ВесРасход = 0 И ВыборкаНом.УбыльВесаПриСушкеПриход = 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				фЗачистка = Ложь;
				фВывестиНачОстатки = Ложь;
				ТабДок.НачатьГруппуСтрок();
				АктЗачисткиКвоНачОстП = ОКР(ВыборкаНом.КвоПриходНачальныйОстаток,2);
				АктЗачисткиКвоНачОстР = ОКР(ВыборкаНом.КвоРасходНачальныйОстаток,2);
				АктЗачисткиВесНачОстП = ОКР(ВыборкаНом.ВесПриходНачальныйОстаток,2);
				АктЗачисткиВесНачОстР = ОКР(ВыборкаНом.ВесРасходНачальныйОстаток,2);
				АктЗачисткиВесПоВлНачОстП 	= ОКР(ВыборкаНом.ВесПоВлажностиПриходНачальныйОстаток,2);
				АктЗачисткиВесПоВлНачОстР 	= ОКР(ВыборкаНом.ВесПоВлажностиРасходНачальныйОстаток,2);
				АктЗачисткиВесПоСорНачОстП 	= ОКР(ВыборкаНом.ВесПоСорнойПримесиПриходНачальныйОстаток,2);
				АктЗачисткиВесПоСорНачОстР	= ОКР(ВыборкаНом.ВесПоСорнойПримесиРасходНачальныйОстаток,2);
				
				// заполнение шапки
				ОблШапка = СформироватьЗаголовок(НачалоПериода,КонецПериода, НомерСтраницы, ВыборкаНом.Номенклатура, ВыборкаНом.Склад);	
				ТабДок.Вывести(ОблШапка);
				//ВысотаШапки   					= ТабДок.ВысотаТаблицы;
				//ТабДок.ФиксацияСверху			= ВысотаШапки;		
				НомерСтраницы = НомерСтраницы + 1;
				
				// заполнение начальных остатков по номенклатуре
				ЗаполнитьОбластьНачОстатковПоНоменклатуре(ОблНачОст, ВыборкаНом);
				ТабДок.Вывести(ОблНачОст);
				ТабДок.НачатьГруппуСтрок();
				ТаблицаРасшифровкиИтоговРасход = СформироватьСтруктуруТаблицыРасшифровкиИтогов();
				ТаблицаРасшифровкиИтоговПриход = СформироватьСтруктуруТаблицыРасшифровкиИтогов();
				
				ВыборкаПериод_Месяц = ВыборкаНом.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период_Месяц");
				Пока ВыборкаПериод_Месяц.Следующий() Цикл
					ЕстьОборотЗаМесяц	= Ложь;
					
					Если ИтогиЗаМесяц Тогда
						ТабДок.НачатьГруппуСтрок();
					КонецЕсли;
					
					ВыборкаПериод=ВыборкаПериод_Месяц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период");			
					Пока ВыборкаПериод.Следующий() Цикл
						Если ИтогиЗаДень Тогда
							ТабДок.НачатьГруппуСтрок();
						КонецЕсли;				
						ВыборкаРасшифровка=ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Регистратор");					
						Пока ВыборкаРасшифровка.Следующий() Цикл					
							Если ТипЗнч(ВыборкаРасшифровка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_АктЗачистки") Тогда										
								// заполенние расшифровки по документам зачистки
								фЗачистка = Истина;
								фВывестиНачОстатки = Истина;
								Обход = ВыборкаРасшифровка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);							
								Пока Обход.Следующий() Цикл
									Если Обход.Регистратор = Null или Обход.Регистратор = Неопределено Тогда
										Продолжить;
									КонецЕсли;								
									Если Обход.ВесПриходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоВлажностиПриходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу ИЛИ 
										Обход.ВесРасходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоВлажностиРасходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу Тогда
										ЗаполнитьОбластьКонОстатковПоНоменклатуреПослеЗачистки(ОблКонОстПослеЗачистки, Обход);
									КонецЕсли;
									ЗаполнитьОбластьПоТекДокументу(ОблТекДок, Обход);
									Прервать;
								КонецЦикла;																				
								ТабДок.Вывести(ОблКонОстПослеЗачистки);
								ТабДок.Вывести(ОблТекДок);
							Иначе
								// заполенние расшифровки документами
								Обход = ВыборкаРасшифровка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока Обход.Следующий() Цикл
									Если Обход.Регистратор = Null или Обход.Регистратор = Неопределено Тогда
										Продолжить;
									КонецЕсли;
									Если фВывестиНачОстатки Тогда
										ЗаполнитьОбластьНачОстатковПоНоменклатуре(ОблНачОст, Обход, Истина);
										ТабДок.Вывести(ОблНачОст);
										фВывестиНачОстатки = Ложь;
									КонецЕсли;								
									Если Обход.РегистраторНомер = Null Тогда
										Продолжить;
									КонецЕсли;
									
									
									ЗаполнитьОбластьПоТекДокументу(ОблТекДок, Обход);
									ТабДок.Вывести(ОблТекДок);
									Если Обход.ВесПриход <> 0 Тогда
										ЗаполнитьТаблицуРасшифровкиИтоговПриход(ТаблицаРасшифровкиИтоговПриход, Обход);
									КонецЕсли;								
									Если Обход.ВесРасход <> 0 ИЛИ Обход.УбыльВесаПриСушке > 0 Тогда
										ЗаполнитьТаблицуРасшифровкиИтоговРасход(ТаблицаРасшифровкиИтоговРасход, Обход);
									КонецЕсли;								
								КонецЦикла;
							КонецЕсли;
						КонецЦикла;
						Если ИтогиЗаДень И (ВыборкаПериод_Месяц.ВесПриход <> 0 ИЛИ ВыборкаПериод_Месяц.ВесРасход <> 0) И НЕ фЗачистка Тогда
							ТабДок.ЗакончитьГруппуСтрок();
							ЗаполнитьОбластьЗаДень(ОблДатаДок, ВыборкаПериод);
							ТабДок.Вывести(ОблДатаДок);
							фЗачистка = Ложь;
						КонецЕсли;					
					КонецЦикла;
					
					Если ИтогиЗаМесяц И (ВыборкаПериод_Месяц.ВесПриход <> 0 ИЛИ ВыборкаПериод_Месяц.ВесРасход <> 0) И НЕ ЕстьОборотЗаМесяц Тогда
						ТабДок.ЗакончитьГруппуСтрок();
						ЗаполнитьОбластьКонОстатковЗаМесяц(ОблКонОстЗаМесяц, ВыборкаПериод_Месяц);
						ТабДок.Вывести(ОблКонОстЗаМесяц);
						ЕстьОборотЗаМесяц = Истина;
					КонецЕсли;
					
				КонецЦикла;
				ТабДок.ЗакончитьГруппуСтрок();
				// заполнение конечных остатков по номенклатуре
				//Если НЕ ЕстьОборотЗаМесяц И ИтогиЗаМесяц Тогда
				//	ЗаполнитьОбластьКонОстатковЗаМесяц(ОблКонОстЗаМесяц, ВыборкаНом);
				//	ТабДок.Вывести(ОблКонОстЗаМесяц);
				//КонецЕсли;
				
				ЗаполнитьОбластьКонОстатковПоНоменклатуре(ОблКонОст, ВыборкаНом);
				ТабДок.Вывести(ОблКонОст);
				
				ТабДок.ЗакончитьГруппуСтрок();
				
				Если РасшифроватьИтоги Тогда
					ВывестиРасшифровкуИтоговИОборотов(Макет, ТабДок, ТаблицаРасшифровкиИтоговПриход, ТаблицаРасшифровкиИтоговРасход);
				КонецЕсли;
				
        		Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизацииИмяФамилия(Организация,КонецПериода);

				ОблПодписи.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;
				ОблПодписи.Параметры.ГлавныйБухгалтер = Руководители.ГлавныйБухгалтер;
					
				ТабДок.Вывести(ОблПодписи);
				ТабДок.ВывестиГоризонтальныйРазделительСтраниц();				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	ТабДок.ПолеСверху 	= 10;
	ТабДок.ПолеСнизу 	= 5;
	
	Возврат ТабДок;
	
КонецФункции

Функция ВывестиОтчетПоФорма36() Экспорт
	
	Фильтр = ""; 
	Условия = "";
	СформироватьФильтр(Фильтр, Условия);	
	Запрос=Новый запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ВложенныйЗапрос.Организация,
	             |	ВложенныйЗапрос.Урожай,
	             |	ВложенныйЗапрос.Склад КАК Склад,
	             |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	             |	ВложенныйЗапрос.ВидХранения,
	             |	ВложенныйЗапрос.Владелец КАК Владелец,
	             |	ВложенныйЗапрос.Договор КАК Договор,
	             |	ВложенныйЗапрос.Регистратор КАК Регистратор,
	             |	ВложенныйЗапрос.Период КАК Период,
	             |	ВложенныйЗапрос.Влажность,
	             |	ВложенныйЗапрос.СорнаяПримесь,
	             |	ВложенныйЗапрос.ЗерноваяПримесь,
	             |	ВложенныйЗапрос.ЛабораторныйАнализ,
	             |	ВложенныйЗапрос.РегистраторНомер,
	             |	ВложенныйЗапрос.РегистраторДата,
	             |	СУММА(ВложенныйЗапрос.ВесПриход) КАК ВесПриход,
	             |	СУММА(ВложенныйЗапрос.КвоПриход) КАК КвоПриход,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриход) КАК ВесПоВлажностиПриход,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриход) КАК ВесПоСорнойПримесиПриход,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриход) КАК ВесПоЗерновойПримесиПриход,
	             |	СУММА(ВложенныйЗапрос.ВесРасход) КАК ВесРасход,
	             |	СУММА(ВложенныйЗапрос.КвоРасход) КАК КвоРасход,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасход) КАК ВесПоВлажностиРасход,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасход) КАК ВесПоСорнойПримесиРасход,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасход) КАК ВесПоЗерновойПримесиРасход,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушке) КАК УбыльВесаПриСушке,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеПриход) КАК УбыльВесаПриСушкеПриход,
	             |	СУММА(ВложенныйЗапрос.КвоПриходКонечныйОстатокПоДате) КАК КвоПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.КвоРасходКонечныйОстатокПоДате) КАК КвоРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПриходКонечныйОстатокПоДате) КАК ВесПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесРасходКонечныйОстатокПоДате) КАК ВесРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходКонечныйОстатокПоДате) КАК ВесПоВлажностиПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходКонечныйОстатокПоДате) КАК ВесПоВлажностиРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходКонечныйОстатокПоДате) КАК ВесПоСорнойПримесиПриходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходКонечныйОстатокПоДате) КАК ВесПоСорнойПримесиРасходКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеКонечныйОстатокПоДате) КАК УбыльВесаПриСушкеКонечныйОстатокПоДате,
	             |	СУММА(ВложенныйЗапрос.ВесПриходНачальныйОстаток) КАК ВесПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоПриходНачальныйОстаток) КАК КвоПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходНачальныйОстаток) КАК ВесПоВлажностиПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходНачальныйОстаток) КАК ВесПоСорнойПримесиПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриходНачальныйОстаток) КАК ВесПоЗерновойПримесиПриходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесРасходНачальныйОстаток) КАК ВесРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоРасходНачальныйОстаток) КАК КвоРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходНачальныйОстаток) КАК ВесПоВлажностиРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходНачальныйОстаток) КАК ВесПоСорнойПримесиРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасходНачальныйОстаток) КАК ВесПоЗерновойПримесиРасходНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеНачальныйОстаток) КАК УбыльВесаПриСушкеНачальныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПриходКонечныйОстаток) КАК ВесПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоПриходКонечныйОстаток) КАК КвоПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходКонечныйОстаток) КАК ВесПоВлажностиПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходКонечныйОстаток) КАК ВесПоСорнойПримесиПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриходКонечныйОстаток) КАК ВесПоЗерновойПримесиПриходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесРасходКонечныйОстаток) КАК ВесРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.КвоРасходКонечныйОстаток) КАК КвоРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходКонечныйОстаток) КАК ВесПоВлажностиРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходКонечныйОстаток) КАК ВесПоСорнойПримесиРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасходКонечныйОстаток) КАК ВесПоЗерновойПримесиРасходКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеКонечныйОстаток) КАК УбыльВесаПриСушкеКонечныйОстаток,
	             |	СУММА(ВложенныйЗапрос.ВесПриходНачальныйОстатокПоДокументу) КАК ВесПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.КвоПриходНачальныйОстатокПоДокументу) КАК КвоПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходНачальныйОстатокПоДокументу) КАК ВесПоВлажностиПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу) КАК ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу) КАК ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесРасходНачальныйОстатокПоДокументу) КАК ВесРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.КвоРасходНачальныйОстатокПоДокументу) КАК КвоРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходНачальныйОстатокПоДокументу) КАК ВесПоВлажностиРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу) КАК ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу) КАК ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеНачальныйОстатокПоДокументу) КАК УбыльВесаПриСушкеНачальныйОстатокПоДокументу,
	             |	СУММА(ВложенныйЗапрос.ВесПриходЗаМесяц) КАК ВесПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.КвоПриходЗаМесяц) КАК КвоПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиПриходЗаМесяц) КАК ВесПоВлажностиПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиПриходЗаМесяц) КАК ВесПоСорнойПримесиПриходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиОстатокЗаМесяц) КАК ВесПоЗерновойПримесиОстатокЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесРасходЗаМесяц) КАК ВесРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.КвоРасходЗаМесяц) КАК КвоРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоВлажностиРасходЗаМесяц) КАК ВесПоВлажностиРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоСорнойПримесиРасходЗаМесяц) КАК ВесПоСорнойПримесиРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.ВесПоЗерновойПримесиРасходЗаМесяц) КАК ВесПоЗерновойПримесиРасходЗаМесяц,
	             |	СУММА(ВложенныйЗапрос.УбыльВесаПриСушкеЗаМесяц) КАК УбыльВесаПриСушкеЗаМесяц,
	             |	ВложенныйЗапрос.Период_Месяц КАК Период_Месяц,
	             |	ВложенныйЗапрос.КодРасхода
	             |ИЗ
	             |	(ВЫБРАТЬ
	             |		ИНАГРО_Форма36.Организация КАК Организация,
	             |		ИНАГРО_Форма36.Урожай КАК Урожай,
	             |		ИНАГРО_Форма36.Склад КАК Склад,
	             |		ИНАГРО_Форма36.Номенклатура КАК Номенклатура,
	             |		ИНАГРО_Форма36.ВидХранения КАК ВидХранения,
	             |		ИНАГРО_Форма36.Владелец КАК Владелец,
	             |		ИНАГРО_Форма36.Договор КАК Договор,
	             |		ИНАГРО_Форма36.Регистратор КАК Регистратор,
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36.Период, ДЕНЬ) КАК Период,
	             |		ИНАГРО_Форма36.Влажность КАК Влажность,
	             |		ИНАГРО_Форма36.СорнаяПримесь КАК СорнаяПримесь,
	             |		ИНАГРО_Форма36.ЗерноваяПримесь КАК ЗерноваяПримесь,
	             |		ИНАГРО_Форма36.ЛабораторныйАнализ КАК ЛабораторныйАнализ,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.Регистратор ССЫЛКА Документ.ИНАГРО_РеестрТТНВвозЖД
	             |				ТОГДА ИНАГРО_РеестрТТНЖДВвозСписокТТН.НомерВагона
	             |			КОГДА ИНАГРО_Форма36.Регистратор ССЫЛКА Документ.ИНАГРО_РеестрТТНВывозЖД
	             |				ТОГДА ИНАГРО_РеестрТТНЖДВывозСписокТТН.НомерВагона
	             |			ИНАЧЕ ИНАГРО_Форма36.Регистратор.Номер
	             |		КОНЕЦ КАК РегистраторНомер,
	             |		ИНАГРО_Форма36.Регистратор.Дата КАК РегистраторДата,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПриход
	             |		КОНЕЦ КАК ВесПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.КвоПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.КвоПриход
	             |		КОНЕЦ КАК КвоПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоВлажностиПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоВлажностиПриход
	             |		КОНЕЦ КАК ВесПоВлажностиПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоСорнойПримесиПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоСорнойПримесиПриход
	             |		КОНЕЦ КАК ВесПоСорнойПримесиПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоЗерновойПримесиПриход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоЗерновойПримесиПриход
	             |		КОНЕЦ КАК ВесПоЗерновойПримесиПриход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесРасход
	             |		КОНЕЦ КАК ВесРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.КвоРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.КвоРасход
	             |		КОНЕЦ КАК КвоРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоВлажностиРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоВлажностиРасход
	             |		КОНЕЦ КАК ВесПоВлажностиРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоСорнойПримесиРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоСорнойПримесиРасход
	             |		КОНЕЦ КАК ВесПоСорнойПримесиРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.ВесПоЗерновойПримесиРасход
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.ВесПоЗерновойПримесиРасход
	             |		КОНЕЦ КАК ВесПоЗерновойПримесиРасход,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.УбыльВесаПриСушке
	             |			ИНАЧЕ -1 * ИНАГРО_Форма36.УбыльВесаПриСушке
	             |		КОНЕЦ КАК УбыльВесаПриСушке,
	             |		ВЫБОР
	             |			КОГДА ИНАГРО_Форма36.ВидДвижения = &Приход
	             |				ТОГДА ИНАГРО_Форма36.УбыльВесаПриСушке
	             |			ИНАЧЕ 0
	             |		КОНЕЦ КАК УбыльВесаПриСушкеПриход,
	             |		0 КАК КвоПриходКонечныйОстатокПоДате,
	             |		0 КАК КвоРасходКонечныйОстатокПоДате,
	             |		0 КАК ВесПриходКонечныйОстатокПоДате,
	             |		0 КАК ВесРасходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоВлажностиПриходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоВлажностиРасходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоСорнойПримесиПриходКонечныйОстатокПоДате,
	             |		0 КАК ВесПоСорнойПримесиРасходКонечныйОстатокПоДате,
	             |		0 КАК УбыльВесаПриСушкеКонечныйОстатокПоДате,
	             |		0 КАК ВесПриходНачальныйОстаток,
	             |		0 КАК КвоПриходНачальныйОстаток,
	             |		0 КАК ВесПоВлажностиПриходНачальныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиПриходНачальныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиПриходНачальныйОстаток,
	             |		0 КАК ВесРасходНачальныйОстаток,
	             |		0 КАК КвоРасходНачальныйОстаток,
	             |		0 КАК ВесПоВлажностиРасходНачальныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиРасходНачальныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиРасходНачальныйОстаток,
	             |		0 КАК УбыльВесаПриСушкеНачальныйОстаток,
	             |		0 КАК ВесПриходКонечныйОстаток,
	             |		0 КАК КвоПриходКонечныйОстаток,
	             |		0 КАК ВесПоВлажностиПриходКонечныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиПриходКонечныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиПриходКонечныйОстаток,
	             |		0 КАК ВесРасходКонечныйОстаток,
	             |		0 КАК КвоРасходКонечныйОстаток,
	             |		0 КАК ВесПоВлажностиРасходКонечныйОстаток,
	             |		0 КАК ВесПоСорнойПримесиРасходКонечныйОстаток,
	             |		0 КАК ВесПоЗерновойПримесиРасходКонечныйОстаток,
	             |		0 КАК УбыльВесаПриСушкеКонечныйОстаток,
	             |		0 КАК ВесПриходНачальныйОстатокПоДокументу,
	             |		0 КАК КвоПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоВлажностиПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесРасходНачальныйОстатокПоДокументу,
	             |		0 КАК КвоРасходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоВлажностиРасходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу,
	             |		0 КАК УбыльВесаПриСушкеНачальныйОстатокПоДокументу,
	             |		0 КАК ВесПриходЗаМесяц,
	             |		0 КАК КвоПриходЗаМесяц,
	             |		0 КАК ВесПоВлажностиПриходЗаМесяц,
	             |		0 КАК ВесПоСорнойПримесиПриходЗаМесяц,
	             |		0 КАК ВесПоЗерновойПримесиОстатокЗаМесяц,
	             |		0 КАК ВесРасходЗаМесяц,
	             |		0 КАК КвоРасходЗаМесяц,
	             |		0 КАК ВесПоВлажностиРасходЗаМесяц,
	             |		0 КАК ВесПоСорнойПримесиРасходЗаМесяц,
	             |		0 КАК ВесПоЗерновойПримесиРасходЗаМесяц,
	             |		0 КАК УбыльВесаПриСушкеЗаМесяц,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36.Период, МЕСЯЦ) КАК Период_Месяц,
	             |		ИНАГРО_Форма36.КодРасхода КАК КодРасхода
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36 КАК ИНАГРО_Форма36
	             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВывозЖД.СписокТТН КАК ИНАГРО_РеестрТТНЖДВывозСписокТТН
	             |			ПО ИНАГРО_Форма36.ЛабораторныйАнализ = ИНАГРО_РеестрТТНЖДВывозСписокТТН.НомерАнализа
	             |				И ИНАГРО_Форма36.Влажность = ИНАГРО_РеестрТТНЖДВывозСписокТТН.Влажность
	             |				И ИНАГРО_Форма36.СорнаяПримесь = ИНАГРО_РеестрТТНЖДВывозСписокТТН.СорнаяПримесь
	             |				И ИНАГРО_Форма36.ЗерноваяПримесь = ИНАГРО_РеестрТТНЖДВывозСписокТТН.ЗерноваяПримесь
	             |				И ИНАГРО_Форма36.ВесРасход = ИНАГРО_РеестрТТНЖДВывозСписокТТН.ФизическийВес
	             |				И ИНАГРО_Форма36.Номенклатура = ИНАГРО_РеестрТТНЖДВывозСписокТТН.Номенклатура
	             |				И ИНАГРО_Форма36.Регистратор.Ссылка = ИНАГРО_РеестрТТНЖДВывозСписокТТН.Ссылка
	             |				И ИНАГРО_Форма36.НомерСтроки = ИНАГРО_РеестрТТНЖДВывозСписокТТН.НомерСтроки
	             |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИНАГРО_РеестрТТНВвозЖД.СписокТТН КАК ИНАГРО_РеестрТТНЖДВвозСписокТТН
	             |			ПО ИНАГРО_Форма36.Номенклатура = ИНАГРО_РеестрТТНЖДВвозСписокТТН.Номенклатура
	             |				И ИНАГРО_Форма36.ЛабораторныйАнализ = ИНАГРО_РеестрТТНЖДВвозСписокТТН.НомерАнализа
	             |				И ИНАГРО_Форма36.Влажность = ИНАГРО_РеестрТТНЖДВвозСписокТТН.Влажность
	             |				И ИНАГРО_Форма36.СорнаяПримесь = ИНАГРО_РеестрТТНЖДВвозСписокТТН.СорнаяПримесь
	             |				И ИНАГРО_Форма36.ЗерноваяПримесь = ИНАГРО_РеестрТТНЖДВвозСписокТТН.ЗерноваяПримесь
	             |				И ИНАГРО_Форма36.ВесПриход = ИНАГРО_РеестрТТНЖДВвозСписокТТН.ФизическийВес
	             |				И ИНАГРО_Форма36.Регистратор.Ссылка = ИНАГРО_РеестрТТНЖДВвозСписокТТН.Ссылка
	             |				И ИНАГРО_Форма36.НомерСтроки = ИНАГРО_РеестрТТНЖДВвозСписокТТН.НомерСтроки
	             |	ГДЕ
	             |		ИНАГРО_Форма36.Период >= &ДатаНач
	             |		И ИНАГРО_Форма36.Период <= &ДатаКонКонецДня
	             |		И &Условия
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Организация,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Урожай,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Склад,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Номенклатура,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВидХранения,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Владелец,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Договор,
	             |		NULL,
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, ДЕНЬ),
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиПриходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиРасходКонечныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.УбыльВесаПриСушкеКонечныйОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, МЕСЯЦ),
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36.ОстаткиИОбороты(&НачалоМесяца, &КонецПериода, День, , &Фильтр) КАК ИНАГРО_Форма36ОстаткиИОбороты
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36Остатки.Организация,
	             |		ИНАГРО_Форма36Остатки.Урожай,
	             |		ИНАГРО_Форма36Остатки.Склад,
	             |		ИНАГРО_Форма36Остатки.Номенклатура,
	             |		ИНАГРО_Форма36Остатки.ВидХранения,
	             |		ИНАГРО_Форма36Остатки.Владелец,
	             |		ИНАГРО_Форма36Остатки.Договор,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36Остатки.ВесПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.УбыльВесаПриСушкеОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36.Остатки(&НачалоПериода, &Фильтр) КАК ИНАГРО_Форма36Остатки
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36Остатки.Организация,
	             |		ИНАГРО_Форма36Остатки.Урожай,
	             |		ИНАГРО_Форма36Остатки.Склад,
	             |		ИНАГРО_Форма36Остатки.Номенклатура,
	             |		ИНАГРО_Форма36Остатки.ВидХранения,
	             |		ИНАГРО_Форма36Остатки.Владелец,
	             |		ИНАГРО_Форма36Остатки.Договор,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36Остатки.ВесПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиПриходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.КвоРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоВлажностиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоСорнойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.ВесПоЗерновойПримесиРасходОстаток,
	             |		ИНАГРО_Форма36Остатки.УбыльВесаПриСушкеОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36.Остатки(&ДатаКон, &Фильтр) КАК ИНАГРО_Форма36Остатки
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Организация,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Урожай,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Склад,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Номенклатура,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВидХранения,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Владелец,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Договор,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Регистратор,
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, ДЕНЬ),
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Регистратор.Дата,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиПриходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиРасходНачальныйОстаток,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.УбыльВесаПриСушкеНачальныйОстаток,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.Период, МЕСЯЦ),
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36.ОстаткиИОбороты(&НачалоМесяца, &КонецПериода, Регистратор, , &Фильтр) КАК ИНАГРО_Форма36ОстаткиИОбороты
	             |	
	             |	ОБЪЕДИНИТЬ ВСЕ
	             |	
	             |	ВЫБРАТЬ
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Организация,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Урожай,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Склад,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Номенклатура,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВидХранения,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Владелец,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.Договор,
	             |		NULL,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ПериодМесяц,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		NULL,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		0,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиПриходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.КвоРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоВлажностиРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоСорнойПримесиРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.ВесПоЗерновойПримесиРасходПриход,
	             |		ИНАГРО_Форма36ОстаткиИОбороты.УбыльВесаПриСушкеПриход,
	             |		КОНЕЦПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.ПериодМесяц, МЕСЯЦ),
	             |		0
	             |	ИЗ
	             |		РегистрНакопления.ИНАГРО_Форма36.ОстаткиИОбороты(&НачалоМесяца, &КонецПериода, Авто, , &Фильтр) КАК ИНАГРО_Форма36ОстаткиИОбороты
	             |	ГДЕ
	             |		НАЧАЛОПЕРИОДА(ИНАГРО_Форма36ОстаткиИОбороты.ПериодМесяц, МЕСЯЦ) МЕЖДУ &НачалоМесяца И &КонПериода
	             |		И НЕ ИНАГРО_Форма36ОстаткиИОбороты.Регистратор ССЫЛКА Документ.ИНАГРО_АктРасчет310) КАК ВложенныйЗапрос
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ВложенныйЗапрос.Организация,
	             |	ВложенныйЗапрос.Урожай,
	             |	ВложенныйЗапрос.Склад,
	             |	ВложенныйЗапрос.Номенклатура,
	             |	ВложенныйЗапрос.ВидХранения,
	             |	ВложенныйЗапрос.Владелец,
	             |	ВложенныйЗапрос.Регистратор,
	             |	ВложенныйЗапрос.Период,
	             |	ВложенныйЗапрос.Влажность,
	             |	ВложенныйЗапрос.СорнаяПримесь,
	             |	ВложенныйЗапрос.ЗерноваяПримесь,
	             |	ВложенныйЗапрос.ЛабораторныйАнализ,
	             |	ВложенныйЗапрос.РегистраторНомер,
	             |	ВложенныйЗапрос.РегистраторДата,
	             |	ВложенныйЗапрос.Период_Месяц,
	             |	ВложенныйЗапрос.Договор,
	             |	ВложенныйЗапрос.КодРасхода
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номенклатура,
	             |	Владелец,
	             |	Период_Месяц,
	             |	Период,
	             |	ВложенныйЗапрос.Регистратор.Дата,
	             |	Регистратор
	             |ИТОГИ
	             |	СУММА(ВесПриход),
	             |	СУММА(КвоПриход),
	             |	СУММА(ВесПоВлажностиПриход),
	             |	СУММА(ВесПоСорнойПримесиПриход),
	             |	СУММА(ВесПоЗерновойПримесиПриход),
	             |	СУММА(ВесРасход),
	             |	СУММА(КвоРасход),
	             |	СУММА(ВесПоВлажностиРасход),
	             |	СУММА(ВесПоСорнойПримесиРасход),
	             |	СУММА(ВесПоЗерновойПримесиРасход),
	             |	СУММА(УбыльВесаПриСушке),
	             |	СУММА(УбыльВесаПриСушкеПриход),
	             |	СУММА(КвоПриходКонечныйОстатокПоДате),
	             |	СУММА(КвоРасходКонечныйОстатокПоДате),
	             |	СУММА(ВесПриходКонечныйОстатокПоДате),
	             |	СУММА(ВесРасходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоВлажностиПриходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоВлажностиРасходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоСорнойПримесиПриходКонечныйОстатокПоДате),
	             |	СУММА(ВесПоСорнойПримесиРасходКонечныйОстатокПоДате),
	             |	СУММА(УбыльВесаПриСушкеКонечныйОстатокПоДате),
	             |	СУММА(ВесПриходНачальныйОстаток),
	             |	СУММА(КвоПриходНачальныйОстаток),
	             |	СУММА(ВесПоВлажностиПриходНачальныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиПриходНачальныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиПриходНачальныйОстаток),
	             |	СУММА(ВесРасходНачальныйОстаток),
	             |	СУММА(КвоРасходНачальныйОстаток),
	             |	СУММА(ВесПоВлажностиРасходНачальныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиРасходНачальныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиРасходНачальныйОстаток),
	             |	СУММА(УбыльВесаПриСушкеНачальныйОстаток),
	             |	СУММА(ВесПриходКонечныйОстаток),
	             |	СУММА(КвоПриходКонечныйОстаток),
	             |	СУММА(ВесПоВлажностиПриходКонечныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиПриходКонечныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиПриходКонечныйОстаток),
	             |	СУММА(ВесРасходКонечныйОстаток),
	             |	СУММА(КвоРасходКонечныйОстаток),
	             |	СУММА(ВесПоВлажностиРасходКонечныйОстаток),
	             |	СУММА(ВесПоСорнойПримесиРасходКонечныйОстаток),
	             |	СУММА(ВесПоЗерновойПримесиРасходКонечныйОстаток),
	             |	СУММА(УбыльВесаПриСушкеКонечныйОстаток),
	             |	СУММА(ВесПриходНачальныйОстатокПоДокументу),
	             |	СУММА(КвоПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоВлажностиПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоЗерновойПримесиПриходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесРасходНачальныйОстатокПоДокументу),
	             |	СУММА(КвоРасходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоВлажностиРасходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПоЗерновойПримесиРасходНачальныйОстатокПоДокументу),
	             |	СУММА(УбыльВесаПриСушкеНачальныйОстатокПоДокументу),
	             |	СУММА(ВесПриходЗаМесяц),
	             |	СУММА(КвоПриходЗаМесяц),
	             |	СУММА(ВесПоВлажностиПриходЗаМесяц),
	             |	СУММА(ВесПоСорнойПримесиПриходЗаМесяц),
	             |	СУММА(ВесПоЗерновойПримесиОстатокЗаМесяц),
	             |	СУММА(ВесРасходЗаМесяц),
	             |	СУММА(КвоРасходЗаМесяц),
	             |	СУММА(ВесПоВлажностиРасходЗаМесяц),
	             |	СУММА(ВесПоСорнойПримесиРасходЗаМесяц),
	             |	СУММА(ВесПоЗерновойПримесиРасходЗаМесяц),
	             |	СУММА(УбыльВесаПриСушкеЗаМесяц)
	             |ПО
	             |	Склад,
	             |	Владелец,
	             |	Договор,
	             |	Номенклатура,
	             |	Период_Месяц,
	             |	Период,
	             |	Регистратор";
	// "+фильтр+"
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Фильтр", Фильтр);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условия", Условия);
	
	Запрос.УстановитьПараметр("Приход",ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ДатаНач"	     ,НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("НачалоМесяца",НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("КонПериода"  ,КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("ДатаКон"		,Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода",Новый Граница(КонецДня(КонецПериода), ВидГраницы.Включая));	
	Запрос.УстановитьПараметр("ДатаКонКонецДня",КонецПериода);
	Запрос.УстановитьПараметр("Организация",Организация);				
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("Урожай",Урожай);
	Запрос.УстановитьПараметр("ВидХранения",ВидХранения);
	Запрос.УстановитьПараметр("Владелец",Владелец);
	Запрос.УстановитьПараметр("ДоговорКонтрагента",ДоговорКонтрагента);
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = ЭтотОбъект.ПолучитьМакет("Форма36");
	ПреобразоватьМакет(Макет);
	
	КодЯзыкаПечать = "uk";
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	РезЗапроса = запрос.Выполнить();
	КоличествоСтрокВВыборке=РезЗапроса.Выбрать().Количество();
	Если КоличествоСтрокВВыборке>0 Тогда
		//
		//ОблШапка = СформироватьЗаголовок(ДатаНач,ДатаКон);	
		//ТабДок.Вывести(ОблШапка);
		//ВысотаШапки   					= ТабДок.ВысотаТаблицы;
		//ТабДок.ФиксацияСверху			= ВысотаШапки;		
		//ТабДок.ПовторятьПриПечатиСтроки = ТабДок.Область("R1:R" + ВысотаШапки);
		
		ОблНачОст 	= Макет.ПолучитьОбласть("Остаток");
		ОблКонОст 	= Макет.ПолучитьОбласть("ТМЦ");
		ОблКонОстПослеЗачистки 	= Макет.ПолучитьОбласть("ТМЦЗаУрожай");
		ОблДатаДок 	= ?(ТолькоОборотЗаДень, Макет.ПолучитьОбласть("ОборотЗаДень"), Макет.ПолучитьОбласть("ДатаДок"));
		ОблТекДок 	= ПолучитьОбластьДляСтрокиДокумента(Макет);//Макет.ПолучитьОбласть("ТекДок");
		ОблВлад		= Макет.ПолучитьОбласть("Владелец1");
		ОблКонец	= Макет.ПолучитьОбласть("Конец");
		ОблПодписи 	= Макет.ПолучитьОбласть("Подписи");
		
		ОблКонОст1 				= Макет.ПолучитьОбласть("ТМЦ1");
		ОблКонОстЗаМесяц		= Макет.ПолучитьОбласть("ТМЦ1ЗаМесяц");
		ОблКонОстПослеЗачистки1 = Макет.ПолучитьОбласть("ТМЦ1ЗаУрожай");
		
		ОблПереоформление = Макет.ПолучитьОбласть("ТМЦПоПереоформлению");
		ЗаполнитьНачальныеДанныеПоПереоформлению(ОблПереоформление);
		
		ВыборкаСклад=РезЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Склад");
		Если ЗначениеЗаполнено(НачальнаяСтраницаДляНумерации) Тогда
			НомерСтраницы = НачальнаяСтраницаДляНумерации;
		Иначе
			НомерСтраницы = 1;
		КонецЕсли;
		
		Пока ВыборкаСклад.Следующий() Цикл
			
			ВыборкаВлад=ВыборкаСклад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Владелец");
			Пока ВыборкаВлад.Следующий() Цикл
				Если ВыводитьТолькоОбороты Тогда
					Если ВыборкаВлад.ВесПриход = 0 И ВыборкаВлад.ВесРасход = 0 И ВыборкаВлад.УбыльВесаПриСушкеПриход = 0 Тогда
						Продолжить;
					КонецЕсли;
				КонецЕсли;
				ТабДок.НачатьГруппуСтрок();
				
				ВыборкаДоговор = ВыборкаВлад.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Договор");
				Пока ВыборкаДоговор.Следующий() Цикл
					
					// заполнение шапки
					ОблШапка = СформироватьЗаголовок(НачалоПериода,КонецПериода, НомерСтраницы);	
					ТабДок.Вывести(ОблШапка);
					НомерСтраницы = НомерСтраницы + 1;
					//ВысотаШапки   					= ТабДок.ВысотаТаблицы;
					//ТабДок.ФиксацияСверху			= ВысотаШапки;		
					
					ОблВлад.Параметры.Владелец=ВыборкаДоговор.Владелец;
					ОблВлад.Параметры.Договор=ВыборкаДоговор.Договор;
					ТабДок.Вывести(ОблВлад);			
					ВыборкаНом = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Номенклатура");
					Пока ВыборкаНом.Следующий() Цикл
						Если ВыводитьТолькоОбороты Тогда
							Если (ВыборкаНом.ВесПриход + ВыборкаНом.ВесРасход) = 0 Тогда
								Продолжить;
							КонецЕсли;
						КонецЕсли;
						
						ЗаполнитьНачальныеДанныеПоПереоформлению(ОблПереоформление);
						фЗачистка = Ложь;
						фВывестиНачОстатки = Ложь;
						ТабДок.НачатьГруппуСтрок();
						ТаблицаРасшифровкиИтоговРасход = СформироватьСтруктуруТаблицыРасшифровкиИтогов();
						ТаблицаРасшифровкиИтоговПриход = СформироватьСтруктуруТаблицыРасшифровкиИтогов();				
						АктЗачисткиКвоНачОстП = ОКР(ВыборкаНом.КвоПриходНачальныйОстаток,2);
						АктЗачисткиКвоНачОстР = ОКР(ВыборкаНом.КвоРасходНачальныйОстаток,2);
						АктЗачисткиВесНачОстП = ОКР(ВыборкаНом.ВесПриходНачальныйОстаток,2);
						АктЗачисткиВесНачОстР = ОКР(ВыборкаНом.ВесРасходНачальныйОстаток,2);
						АктЗачисткиВесПоВлНачОстП 	= ОКР(ВыборкаНом.ВесПоВлажностиПриходНачальныйОстаток,2);
						АктЗачисткиВесПоВлНачОстР 	= ОКР(ВыборкаНом.ВесПоВлажностиРасходНачальныйОстаток,2);
						АктЗачисткиВесПоСорНачОстП 	= ОКР(ВыборкаНом.ВесПоСорнойПримесиПриходНачальныйОстаток,2);
						АктЗачисткиВесПоСорНачОстР	= ОКР(ВыборкаНом.ВесПоСорнойПримесиРасходНачальныйОстаток,2);				
						// заполнение начальных остатков по номенклатуре
						ЗаполнитьОбластьНачОстатковПоНоменклатуре(ОблНачОст, ВыборкаНом);
						ТабДок.Вывести(ОблНачОст);
						ТабДок.НачатьГруппуСтрок();
						
						ВыборкаПериод_Месяц = ВыборкаНом.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период_Месяц");
						
						Пока ВыборкаПериод_Месяц.Следующий() Цикл
							ЕстьОборотЗаМесяц	= Ложь;
							
							Если ИтогиЗаМесяц Тогда
								ТабДок.НачатьГруппуСтрок();
							КонецЕсли;
							
							ВыборкаПериод = ВыборкаПериод_Месяц.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период");			
							Пока ВыборкаПериод.Следующий() Цикл
								Если ИтогиЗаДень Тогда
									ТабДок.НачатьГруппуСтрок();
								КонецЕсли;
								ВыборкаРасшифровка=ВыборкаПериод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Регистратор");					
								Пока ВыборкаРасшифровка.Следующий() Цикл					
									Если ТипЗнч(ВыборкаРасшифровка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_АктРасчет310") Тогда										
										// заполенние расшифровки по документам зачистки
										фЗачистка = Истина;
										фВывестиНачОстатки = Истина;
										Обход = ВыборкаРасшифровка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);							
										Пока Обход.Следующий() Цикл
											Если Обход.Регистратор = Null или Обход.Регистратор = Неопределено Тогда
												Продолжить;
											КонецЕсли;								
											Если Обход.ВесПриходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоВлажностиПриходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу ИЛИ 
												Обход.ВесРасходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоВлажностиРасходНачальныйОстатокПоДокументу <> 0 ИЛИ Обход.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу Тогда										
												ЗаполнитьОбластьКонОстатковПоНоменклатуреПослеЗачистки(ОблКонОстПослеЗачистки, Обход);										
											КонецЕсли;
											ЗаполнитьОбластьПоТекДокументу(ОблТекДок, Обход);
											Прервать;
										КонецЦикла;							
										
										Если ЗаполнитьПоказателиКачестваПереоформление(ОблПереоформление) Тогда
											ТабДок.Вывести(ОблПереоформление);
										КонецЕсли;
										ЗаполнитьНачальныеДанныеПоПереоформлению(ОблПереоформление);
										
										// заполнение конечных остатков по номенклатуре
										//Если ИтогиЗаМесяц Тогда
										//	ЗаполнитьОбластьКонОстатковЗаМесяц(ОблКонОстЗаМесяц, ВыборкаПериод_Месяц);
										//	ТабДок.Вывести(ОблКонОстЗаМесяц);
										//	ЕстьОборотЗаМесяц = Истина;
										//КонецЕсли;
										
										ТабДок.Вывести(ОблКонОстПослеЗачистки);
										ТабДок.Вывести(ОблТекДок);							
									Иначе
										// заполенние расшифровки документами
										Обход = ВыборкаРасшифровка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
										Пока Обход.Следующий() Цикл
											Если Обход.Регистратор = Null или Обход.Регистратор = Неопределено Тогда
												Продолжить;
											КонецЕсли;
											Если фВывестиНачОстатки Тогда
												ЗаполнитьОбластьНачОстатковПоНоменклатуре(ОблНачОст, Обход, Истина);
												ТабДок.Вывести(ОблНачОст);
												фВывестиНачОстатки = Ложь;
											КонецЕсли;								
											Если Обход.РегистраторНомер = Null Тогда
												Продолжить;
											КонецЕсли;
											
											Если ТипЗнч(ВыборкаРасшифровка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_Переоформление") Тогда										
												// заполенние расшифровки по документам переоформления
												ЗаполнитьДанныеПоПереоформлению(ОблПереоформление, Обход);
											КонецЕсли;
											
											ЗаполнитьОбластьПоТекДокументу(ОблТекДок, Обход);
											ТабДок.Вывести(ОблТекДок);
											Если Обход.ВесПриход <> 0 Тогда
												ЗаполнитьТаблицуРасшифровкиИтоговПриход(ТаблицаРасшифровкиИтоговПриход, Обход);
											КонецЕсли;								
											Если Обход.ВесРасход <> 0 ИЛИ Обход.УбыльВесаПриСушке > 0 Тогда
												ЗаполнитьТаблицуРасшифровкиИтоговРасход(ТаблицаРасшифровкиИтоговРасход, Обход);
											КонецЕсли;								
										КонецЦикла;
									КонецЕсли;
									
									
								КонецЦикла;
								Если ИтогиЗаДень И (ВыборкаПериод.ВесПриход <> 0 ИЛИ ВыборкаПериод.ВесРасход <> 0) И НЕ фЗачистка Тогда
									ТабДок.ЗакончитьГруппуСтрок();
									ЗаполнитьОбластьЗаДень(ОблДатаДок, ВыборкаПериод);
									ТабДок.Вывести(ОблДатаДок);
									фЗачистка = Ложь;
								КонецЕсли;					
							КонецЦикла;
							
							Если ИтогиЗаМесяц И (ВыборкаПериод_Месяц.ВесПриход <> 0 ИЛИ ВыборкаПериод_Месяц.ВесРасход <> 0) И НЕ ЕстьОборотЗаМесяц Тогда
								ТабДок.ЗакончитьГруппуСтрок();
								
								Если ЗаполнитьПоказателиКачестваПереоформление(ОблПереоформление) Тогда
									ТабДок.Вывести(ОблПереоформление);
								КонецЕсли;
								
								ЗаполнитьОбластьКонОстатковЗаМесяц(ОблКонОстЗаМесяц, ВыборкаПериод_Месяц);
								ТабДок.Вывести(ОблКонОстЗаМесяц);
								ЕстьОборотЗаМесяц = Истина;
							КонецЕсли;
							
						КонецЦикла;
						ТабДок.ЗакончитьГруппуСтрок();
						// Итог по переоформлению,
						// если выводим итоги за месяц с ними у нас уже идут итоги по переоформлению
						Если НЕ ИтогиЗаМесяц Тогда
							Если ЗаполнитьПоказателиКачестваПереоформление(ОблПереоформление) Тогда
								ТабДок.Вывести(ОблПереоформление);
							КонецЕсли;
							ЗаполнитьНачальныеДанныеПоПереоформлению(ОблПереоформление);
						КонецЕсли;
						
						//// заполнение конечных остатков по номенклатуре
						//Если НЕ ЕстьОборотЗаМесяц И ИтогиЗаМесяц Тогда
						//	ЗаполнитьОбластьКонОстатковЗаМесяц(ОблКонОстЗаМесяц, ВыборкаНом);
						//	ТабДок.Вывести(ОблКонОстЗаМесяц);
						//КонецЕсли;
						
						ЗаполнитьОбластьКонОстатковПоНоменклатуре(ОблКонОст, ВыборкаНом);
						ТабДок.Вывести(ОблКонОст);
						
						Если РасшифроватьИтоги Тогда
							ВывестиРасшифровкуИтоговИОборотов(Макет, ТабДок, ТаблицаРасшифровкиИтоговПриход, ТаблицаРасшифровкиИтоговРасход);
						КонецЕсли;
						
						ТабДок.ЗакончитьГруппуСтрок();
					КонецЦикла;
					
	        		Руководители = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизацииИмяФамилия(Организация,КонецПериода);

					ОблПодписи.Параметры.НачальникВТЛ = Руководители.НачальникВТЛ;
					ОблПодписи.Параметры.ГлавныйБухгалтер = Руководители.ГлавныйБухгалтер;
					
					ТабДок.Вывести(ОблПодписи);
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
					
				КонецЦикла;
				
				ТабДок.ЗакончитьГруппуСтрок();
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	ТабДок.АвтоМасштаб=Истина;
	ТабДок.ОриентацияСтраницы=ОриентацияСтраницы.Ландшафт;
	ТабДок.ПолеСлева 	= 5;
	ТабДок.ПолеСправа 	= 5;
	ТабДок.ПолеСверху 	= 10;
	ТабДок.ПолеСнизу 	= 5;
	
	Возврат ТабДок;
	
КонецФункции

Процедура СформироватьФильтр( Фильтр, Условия)
	
	Фильтр	= " ИСТИНА ";
	Условия = " ИСТИНА ";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		Фильтр=Фильтр+" И Организация В ИЕРАРХИИ(&Организация) ";
		Условия = Условия + " И ИНАГРО_Форма36.Организация В ИЕРАРХИИ(&Организация) ";
	КонецЕсли; 
	Если Не Общая И ЗначениеЗаполнено(Владелец) Тогда
		Фильтр=Фильтр+" И Владелец В ИЕРАРХИИ(&Владелец) ";
		Условия = Условия + " И ИНАГРО_Форма36.Владелец В ИЕРАРХИИ(&Владелец) ";
	КонецЕсли;
	Если Не Общая И ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		Фильтр=Фильтр+" И Договор В ИЕРАРХИИ(&ДоговорКонтрагента) ";
		Условия = Условия + " И ИНАГРО_Форма36.Договор В ИЕРАРХИИ(&ДоговорКонтрагента) ";
	КонецЕсли;	
	Если ЗначениеЗаполнено(Номенклатура) Тогда
		Фильтр=Фильтр+" И Номенклатура В ИЕРАРХИИ(&Номенклатура) ";
		Условия = Условия + " И ИНАГРО_Форма36.Номенклатура В ИЕРАРХИИ(&Номенклатура) ";
	КонецЕсли;
	Если ЗначениеЗаполнено(Склад) Тогда
		Фильтр=Фильтр+" И Склад В ИЕРАРХИИ(&Склад) ";
		Условия = Условия + " И ИНАГРО_Форма36.Склад В ИЕРАРХИИ(&Склад) ";
	КонецЕсли;
	Если ЗначениеЗаполнено(Урожай) Тогда
		Фильтр=Фильтр+" И Урожай В ИЕРАРХИИ(&Урожай) ";
		Условия = Условия + " И ИНАГРО_Форма36.Урожай В ИЕРАРХИИ(&Урожай) ";
	КонецЕсли;
	Если ЗначениеЗаполнено(ВидХранения) Тогда
		Фильтр=Фильтр+" И ВидХранения В ИЕРАРХИИ(&ВидХранения) ";
		Условия = Условия + " И ИНАГРО_Форма36.ВидХранения В ИЕРАРХИИ(&ВидХранения) ";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




// функция предназначена для формирования ТЗ для вывода подписей
//
Функция ПорядокВыводаПодписиПоУмолчанию() Экспорт 
	
	ОтветственноеЛицоЗаВедениеФ36 = Пользователи.ТекущийПользователь().ФизическоеЛицо;  	
	РезВыгрузки = ИНАГРО_Элеватор.ОтветственныеЛицаОрганизации(Организация, КонецПериода);
		
	// создание промежуточной ТЗ 
	НоваяТЗВыводаПодписей = Новый ТаблицаЗначений;
	НоваяТЗВыводаПодписей.Колонки.Добавить("Вывод");
	НоваяТЗВыводаПодписей.Колонки.Добавить("Подпись");
	НоваяТЗВыводаПодписей.Колонки.Добавить("Представление");
	
	// начальное заполнение ТЗ для вывода подписей
	НоваяСтрока = НоваяТЗВыводаПодписей.Добавить();	
	НоваяСтрока.Вывод         = Истина;
	НоваяСтрока.Подпись       = "Ответственное лицо за ведение формы № 36";
	НоваяСтрока.Представление = ОтветственноеЛицоЗаВедениеФ36;
	
	НоваяСтрока = НоваяТЗВыводаПодписей.Добавить();
	НоваяСтрока.Вывод         = Истина;
	НоваяСтрока.Подпись       = "Гл. бухгалтер";
	НоваяСтрока.Представление = РезВыгрузки.ГлавныйБухгалтер;
	
	НоваяСтрока = НоваяТЗВыводаПодписей.Добавить();
	НоваяСтрока.Вывод         = Истина;
	НоваяСтрока.Подпись       = "Начальник ПТЛ";
	НоваяСтрока.Представление = РезВыгрузки.НачальникВТЛ;
	
	НоваяСтрока = НоваяТЗВыводаПодписей.Добавить();
	НоваяСтрока.Вывод         = Истина;
	НоваяСтрока.Подпись       = "Зав. складом";
	НоваяСтрока.Представление = ИНАГРО_Элеватор.ОтветственныеЛица(Организация, КонецПериода, Склад);
	
	НоваяСтрока = НоваяТЗВыводаПодписей.Добавить();
	НоваяСтрока.Вывод         = Ложь;
	НоваяСтрока.Подпись       = "Директор";
	НоваяСтрока.Представление = РезВыгрузки.Руководитель;
	
	НоваяСтрока = НоваяТЗВыводаПодписей.Добавить();
	НоваяСтрока.Вывод         = Ложь;
	НоваяСтрока.Подпись       = "Лаборант";
	НоваяСтрока.Представление = "";
	
	
    Возврат НоваяТЗВыводаПодписей;
	
КонецФункции //ПорядокВыводаПодписиПоУмолчанию()

Процедура ЗаполнитьОбластьПоТекДокументу(ОблТекДок, СтрДанных)
	
	ОблТекДок.Параметры.ДокСсылка				= СтрДанных.Регистратор;
	ОблТекДок.Параметры.ДатаДок					= Формат(СтрДанных.Регистратор.Дата,"ДФ=dd.MM.yyyy");
	ОблТекДок.Параметры.НомерДок				= СтрДанных.РегистраторНомер;
	ОблТекДок.Параметры.НомерАнализа			= СтрДанных.ЛабораторныйАнализ;//?(СтрДанных.ЛабораторныйАнализ<>Null,СтрДанных.ЛабораторныйАнализ.номер,"");
	ОблТекДок.Параметры.ОткудаКуда				= ПолучитьОткудаКуда(СтрДанных.Регистратор,СтрДанных.ВесПриход,СтрДанных.КодРасхода);
	Если ТипЗнч(СтрДанных.Регистратор) = Тип("ДокументСсылка.ИНАГРО_АктЗачистки") 
		или ТипЗнч(СтрДанных.Регистратор) = Тип("ДокументСсылка.ИНАГРО_АктРасчет310") Тогда
		ОблТекДок.Параметры.Влажность				= 0;
		ОблТекДок.Параметры.СорнаяПримесь			= 0;
		ОблТекДок.Параметры.КвоПриход				= 0;
		ОблТекДок.Параметры.КвоРасход				= 0;
		ОблТекДок.Параметры.ВесПриход				= 0;
		Если ТипЗнч(СтрДанных.Регистратор) = Тип("ДокументСсылка.ИНАГРО_АктЗачистки") Тогда
			ОблТекДок.Параметры.ВесРасход = СтрДанных.Регистратор.УбыльВсего;
			НедостатокОстача 			= СтрДанных.Регистратор.ФизическийВес9 - СтрДанных.Регистратор.УбыльВсего;
			ОблТекДок.Параметры.КонОст 	= НедостатокОстача;
			Если СтрДанных.Регистратор.ФизическийВес9 > 0 Тогда
				Если НедостатокОстача < 0 Тогда
					НедостатокОстача = -1*НедостатокОстача;
					ОблТекДок.Параметры.КонОст 	= "(" + (НедостатокОстача) + ")";
				КонецЕсли;
			КонецЕсли;			
		ИначеЕсли ТипЗнч(СтрДанных.Регистратор) = Тип("ДокументСсылка.ИНАГРО_АктРасчет310") Тогда
			ОблТекДок.Параметры.ВесРасход 	= СтрДанных.Регистратор.ВесУбыльВсего - СтрДанных.Регистратор.ВесПовышениеВсего;
			Если СтрДанных.Регистратор.ФизическийВес8 < 0 Тогда
				ОблТекДок.Параметры.КонОст		= "(" + -1 * СтрДанных.Регистратор.ФизическийВес8 + ")";
			Иначе
				ОблТекДок.Параметры.КонОст		= СтрДанных.Регистратор.ФизическийВес8;

			КонецЕсли;
		Иначе
			ОблТекДок.Параметры.ВесРасход = 0;
		КонецЕсли;
		ОблТекДок.Параметры.ВесПоВлажностиПриход	= 0;
		ОблТекДок.Параметры.ВесПоСорнойПримесиПриход= 0;
		ОблТекДок.Параметры.ВесПоВлажностиРасход	= 0;
		ОблТекДок.Параметры.ВесПоСорнойПримесиРасход= 0;
		Если ПоказыватьУсушку Тогда
			ОблТекДок.Параметры.УбыльВесаПриСушкеРасход = 0;
		КонецЕсли;
		
	Иначе
		ОблТекДок.Параметры.Влажность				= СтрДанных.Влажность;
		ОблТекДок.Параметры.СорнаяПримесь			= СтрДанных.СорнаяПримесь;												
		ОблТекДок.Параметры.КвоПриход				= ОКР(СтрДанных.КвоПриход,2);
		ОблТекДок.Параметры.КвоРасход				= ОКР(СтрДанных.КвоРасход,2);						
		ОблТекДок.Параметры.ВесПриход				= ОКР(СтрДанных.ВесПриход,2);
		ОблТекДок.Параметры.ВесРасход				= ОКР(СтрДанных.ВесРасход,2);
		ОблТекДок.Параметры.ВесПоВлажностиПриход	= ОКР(СтрДанных.ВесПоВлажностиПриход,2);
		ОблТекДок.Параметры.ВесПоСорнойПримесиПриход= ОКР(СтрДанных.ВесПоСорнойПримесиПриход,2);
		ОблТекДок.Параметры.ВесПоВлажностиРасход	= ОКР(СтрДанных.ВесПоВлажностиРасход,2);
		ОблТекДок.Параметры.ВесПоСорнойПримесиРасход= ОКР(СтрДанных.ВесПоСорнойПримесиРасход,2);
		Если ПоказыватьУсушку Тогда
			ОблТекДок.Параметры.УбыльВесаПриСушкеРасход = ОКР(СтрДанных.УбыльВесаПриСушкеПриход,2);
		КонецЕсли;
		ОблТекДок.Параметры.КонОст					= 0;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОбластьНачОстатковПоНоменклатуре(ОблНачОст, ВыборкаНом, НаДокумент = Ложь)
	
	Если НаДокумент Тогда
		
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			ОблНачОст.Параметры.Склад = ВыборкаНом.Склад;
		Иначе
			ОблНачОст.Параметры.Склад = "";
		КонецЕсли;
		
		ОблНачОст.Параметры.НоменклатураНаНачало= ВыборкаНом.Номенклатура;
		ОблНачОст.Параметры.ВлНаНачП			= Процент(ВыборкаНом.ВесПриходНачальныйОстатокПоДокументу,ВыборкаНом.ВесПоВлажностиПриходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.СорНаНачП			= Процент(ВыборкаНом.ВесПриходНачальныйОстатокПоДокументу,ВыборкаНом.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.ВлНаНачР			= Процент(ВыборкаНом.ВесРасходНачальныйОстатокПоДокументу,ВыборкаНом.ВесПоВлажностиРасходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.СорНаНачР			= Процент(ВыборкаНом.ВесРасходНачальныйОстатокПоДокументу,ВыборкаНом.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.КвоНачОстП			= ОКР(ВыборкаНом.КвоПриходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.КвоНачОстР			= ОКР(ВыборкаНом.КвоРасходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.КвоНаНачОст			= ОКР(ВыборкаНом.КвоПриходНачальныйОстатокПоДокументу-ВыборкаНом.КвоРасходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.ВесНачОстП			= ОКР(ВыборкаНом.ВесПриходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.ВесПоВлНаНачП		= ОКР(ВыборкаНом.ВесПоВлажностиПриходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.ВесПоСорНаНачП		= ОКР(ВыборкаНом.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,2);		
		ОблНачОст.Параметры.ВесНаНачР			= ОКР(ВыборкаНом.ВесРасходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.ВесПоВлНаНачР		= ОКР(ВыборкаНом.ВесПоВлажностиРасходНачальныйОстатокПоДокументу,2);
		ОблНачОст.Параметры.ВесПоСорНаНачР		= ОКР(ВыборкаНом.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,2);
		Если ПоказыватьУсушку Тогда
			ОблНачОст.Параметры.УбыльВесаПриСушкеНачРасход=ОКР(ВыборкаНом.УбыльВесаПриСушкеНачальныйОстатокПоДокументу,2);
		КонецЕсли;
		ОблНачОст.Параметры.ВесНаНачОст			= ОКР(ВыборкаНом.ВесПриходНачальныйОстатокПоДокументу-ВыборкаНом.ВесРасходНачальныйОстатокПоДокументу,2);
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Склад) Тогда
			ОблНачОст.Параметры.Склад = ВыборкаНом.Склад;
		Иначе
			ОблНачОст.Параметры.Склад = "";
		КонецЕсли;
		
		ОблНачОст.Параметры.НоменклатураНаНачало= ВыборкаНом.Номенклатура;
		ОблНачОст.Параметры.ВлНаНачП			= Процент(ВыборкаНом.ВесПриходНачальныйОстаток,ВыборкаНом.ВесПоВлажностиПриходНачальныйОстаток,2);
		ОблНачОст.Параметры.СорНаНачП			= Процент(ВыборкаНом.ВесПриходНачальныйОстаток,ВыборкаНом.ВесПоСорнойПримесиПриходНачальныйОстаток,2);
		ОблНачОст.Параметры.ВлНаНачР			= Процент(ВыборкаНом.ВесРасходНачальныйОстаток,ВыборкаНом.ВесПоВлажностиРасходНачальныйОстаток,2);
		ОблНачОст.Параметры.СорНаНачР			= Процент(ВыборкаНом.ВесРасходНачальныйОстаток,ВыборкаНом.ВесПоСорнойПримесиРасходНачальныйОстаток,2);
		ОблНачОст.Параметры.КвоНачОстП			= ОКР(ВыборкаНом.КвоПриходНачальныйОстаток,2);
		ОблНачОст.Параметры.КвоНачОстР			= ОКР(ВыборкаНом.КвоРасходНачальныйОстаток,2);
		ОблНачОст.Параметры.КвоНаНачОст			= ОКР(ВыборкаНом.КвоПриходНачальныйОстаток-ВыборкаНом.КвоРасходНачальныйОстаток,2);
		ОблНачОст.Параметры.ВесНачОстП			= ОКР(ВыборкаНом.ВесПриходНачальныйОстаток,2);
		ОблНачОст.Параметры.ВесПоВлНаНачП		= ОКР(ВыборкаНом.ВесПоВлажностиПриходНачальныйОстаток,2);
		ОблНачОст.Параметры.ВесПоСорНаНачП		= ОКР(ВыборкаНом.ВесПоСорнойПримесиПриходНачальныйОстаток,2);		
		ОблНачОст.Параметры.ВесНаНачР			= ОКР(ВыборкаНом.ВесРасходНачальныйОстаток,2);
		ОблНачОст.Параметры.ВесПоВлНаНачР		= ОКР(ВыборкаНом.ВесПоВлажностиРасходНачальныйОстаток,2);
		ОблНачОст.Параметры.ВесПоСорНаНачР		= ОКР(ВыборкаНом.ВесПоСорнойПримесиРасходНачальныйОстаток,2);
		Если ПоказыватьУсушку Тогда
			ОблНачОст.Параметры.УбыльВесаПриСушкеНачРасход=ОКР(ВыборкаНом.УбыльВесаПриСушкеНачальныйОстаток,2);
		КонецЕсли;
		ОблНачОст.Параметры.ВесНаНачОст			= ОКР(ВыборкаНом.ВесПриходНачальныйОстаток-ВыборкаНом.ВесРасходНачальныйОстаток,2);
	КонецЕсли;
	
КонецПроцедуры   


// ++процедуры для переоформления
Процедура ЗаполнитьНачальныеДанныеПоПереоформлению(ОблПереоформление)
	
	ОблПереоформление.Параметры.ПроцентПоВлажностиПриходП			= 0;
	ОблПереоформление.Параметры.ПроцентВесПоСорнойПримесиПриходП	= 0;
	ОблПереоформление.Параметры.ПроцентПоВлажностиРасходП			= 0;
	ОблПереоформление.Параметры.ПроцентВесПоСорнойПримесиРасходП	= 0;
	ОблПереоформление.Параметры.КвоПриходП	= 0;
	ОблПереоформление.Параметры.КвоРасходП	= 0;						
	ОблПереоформление.Параметры.ВесПриходП	= 0;
	ОблПереоформление.Параметры.ВесРасходП	= 0;
	ОблПереоформление.Параметры.ВесПоВлажностиПриходП		= 0;
	ОблПереоформление.Параметры.ВесПоСорнойПримесиПриходП	= 0;
	ОблПереоформление.Параметры.ВесПоВлажностиРасходП		= 0;
	ОблПереоформление.Параметры.ВесПоСорнойПримесиРасходП	= 0;
	Если ПоказыватьУсушку Тогда
		ОблПереоформление.Параметры.УбыльВесаПриСушкеРасходП= 0;
	КонецЕсли;
	ОблПереоформление.Параметры.ВесОстПП					= 0;
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПоПереоформлению(ОблТекДок, СтрДанных)
	
	ОблТекДок.Параметры.КвоПриходП				= ОблТекДок.Параметры.КвоПриходП + ОКР(СтрДанных.КвоПриход,2);
	ОблТекДок.Параметры.КвоРасходП				= ОблТекДок.Параметры.КвоРасходП + ОКР(СтрДанных.КвоРасход,2);						
	ОблТекДок.Параметры.ВесПриходП				= ОблТекДок.Параметры.ВесПриходП + ОКР(СтрДанных.ВесПриход,2);
	ОблТекДок.Параметры.ВесРасходП				= ОблТекДок.Параметры.ВесРасходП + ОКР(СтрДанных.ВесРасход,2);
	ОблТекДок.Параметры.ВесПоВлажностиПриходП	= ОблТекДок.Параметры.ВесПоВлажностиПриходП 		+ ОКР(СтрДанных.ВесПоВлажностиПриход,2);
	ОблТекДок.Параметры.ВесПоСорнойПримесиПриходП= ОблТекДок.Параметры.ВесПоСорнойПримесиПриходП 	+ ОКР(СтрДанных.ВесПоСорнойПримесиПриход,2);
	ОблТекДок.Параметры.ВесПоВлажностиРасходП	= ОблТекДок.Параметры.ВесПоВлажностиРасходП		+ ОКР(СтрДанных.ВесПоВлажностиРасход,2);
	ОблТекДок.Параметры.ВесПоСорнойПримесиРасходП= ОблТекДок.Параметры.ВесПоСорнойПримесиРасходП	+ ОКР(СтрДанных.ВесПоСорнойПримесиРасход,2);
	Если ПоказыватьУсушку Тогда
		ОблТекДок.Параметры.УбыльВесаПриСушкеРасходП = ОблТекДок.Параметры.УбыльВесаПриСушкеРасходП	+ ОКР(СтрДанных.УбыльВесаПриСушкеПриход,2);
	КонецЕсли;
	ОблТекДок.Параметры.ВесОстПП					= 0;
	
КонецПроцедуры

Функция ЗаполнитьПоказателиКачестваПереоформление(Область)
	
	ВывестиПереоформление = Ложь;
	
	Если ПоказыватьПереоформление Тогда
		
		Если (Область.Параметры.ВесПриходП + Область.Параметры.ВесРасходП) <> 0 Тогда
			ВывестиПереоформление = Истина;
			Область.Параметры.ПроцентПоВлажностиПриходП			= Процент(Область.Параметры.ВесПриходП, Область.Параметры.ВесПоВлажностиПриходП, 2);
			Область.Параметры.ПроцентВесПоСорнойПримесиПриходП	= Процент(Область.Параметры.ВесПриходП, Область.Параметры.ВесПоСорнойПримесиПриходП,2);
			Область.Параметры.ПроцентПоВлажностиРасходП			= Процент(Область.Параметры.ВесРасходП, Область.Параметры.ВесПоВлажностиРасходП,2);
			Область.Параметры.ПроцентВесПоСорнойПримесиРасходП	= Процент(Область.Параметры.ВесРасходП, Область.Параметры.ВесПоСорнойПримесиРасходП,2);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ВывестиПереоформление;
	
КонецФункции
// процедуры для переоформления

Процедура ЗаполнитьОбластьЗаДень(ОблДатаДок, ВыборкаПериод)
	
	КодЯзыкаПечать = "uk";

	
	ОблДатаДок.Параметры.День=формат(ВыборкаПериод.Период,"ДЛФ=DD;Л="+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));						
	ОблДатаДок.Параметры.ПроцентПоВлажностиПриход=Процент(ВыборкаПериод.ВесПриход,ВыборкаПериод.ВесПоВлажностиПриход,2);
	ОблДатаДок.Параметры.ПроцентВесПоСорнойПримесиПриход=Процент(ВыборкаПериод.ВесПриход,ВыборкаПериод.ВесПоСорнойПримесиПриход,2);
	ОблДатаДок.Параметры.ПроцентПоВлажностиРасход=Процент(ВыборкаПериод.ВесРасход,ВыборкаПериод.ВесПоВлажностиРасход,2);
	ОблДатаДок.Параметры.ПроцентВесПоСорнойПримесиРасход=Процент(ВыборкаПериод.ВесРасход,ВыборкаПериод.ВесПоСорнойПримесиРасход,2);						
	ОблДатаДок.Параметры.ВесПриход=ОКР(ВыборкаПериод.ВесПриход,2);
	ОблДатаДок.Параметры.ВесРасход=ОКР(ВыборкаПериод.ВесРасход,2);
	ОблДатаДок.Параметры.ВесПоВлажностиПриход=ОКР(ВыборкаПериод.ВесПоВлажностиПриход,2);
	ОблДатаДок.Параметры.ВесПоВлажностиРасход=ОКР(ВыборкаПериод.ВесПоВлажностиРасход,2);
	ОблДатаДок.Параметры.ВесПоСорнойПримесиПриход=ОКР(ВыборкаПериод.ВесПоСорнойПримесиПриход,2);
	ОблДатаДок.Параметры.ВесПоСорнойПримесиРасход=ОКР(ВыборкаПериод.ВесПоСорнойПримесиРасход,2);
	
	Если НЕ ТолькоОборотЗаДень Тогда
		ОблДатаДок.Параметры.КвоПриходЗаДеньУ					= ВыборкаПериод.КвоПриходКонечныйОстатокПоДате;
		ОблДатаДок.Параметры.ВесПриходЗаДеньУ 					= ОКР(ВыборкаПериод.ВесПриходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.ВесПоВлажностиПриходЗаДеньУ 		= ОКР(ВыборкаПериод.ВесПоВлажностиПриходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.ВесПоСорнойПримесиПриходЗаДеньУ 	= ОКР(ВыборкаПериод.ВесПоСорнойПримесиПриходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.ВлажностьПоПриходуУ 				= Процент(ВыборкаПериод.ВесПриходКонечныйОстатокПоДате,ВыборкаПериод.ВесПоВлажностиПриходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.СорнаяПримесьПоПриходуУ 			= Процент(ВыборкаПериод.ВесПриходКонечныйОстатокПоДате,ВыборкаПериод.ВесПоСорнойПримесиПриходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.КвоРасходЗаДеньУ					= ВыборкаПериод.КвоРасходКонечныйОстатокПоДате;
		ОблДатаДок.Параметры.ВесРасходЗаДеньУ 					= ОКР(ВыборкаПериод.ВесРасходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.ВесПоВлажностиРасходЗаДеньУ 		= ОКР(ВыборкаПериод.ВесПоВлажностиРасходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.ВесПоСорнойПримесиРасходЗаДеньУ 	= ОКР(ВыборкаПериод.ВесПоСорнойПримесиРасходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.ВлажностьПоРасходуУ 				= Процент(ВыборкаПериод.ВесРасходКонечныйОстатокПоДате,ВыборкаПериод.ВесПоВлажностиРасходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.СорнаяПримесьПоРасходуУ 			= Процент(ВыборкаПериод.ВесРасходКонечныйОстатокПоДате,ВыборкаПериод.ВесПоСорнойПримесиРасходКонечныйОстатокПоДате,2);
		ОблДатаДок.Параметры.ВесОст					 			= ОКР(ВыборкаПериод.ВесПриходКонечныйОстатокПоДате - ВыборкаПериод.ВесРасходКонечныйОстатокПоДате,2);
		Если ПоказыватьУсушку Тогда
			ОблДатаДок.Параметры.УбыльВесаПриСушкеЗаденьУ			= Окр(ВыборкаПериод.УбыльВесаПриСушкеКонечныйОстатокПоДате,2);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОбластьКонОстатковПоНоменклатуре(ОблКонОст, ВыборкаНом)
	
	ОблКонОст.Параметры.Номенклатура					= ВыборкаНом.Номенклатура;
	
	ОблКонОст.Параметры.ПроцентПоВлажностиПриход		= Процент(ВыборкаНом.ВесПриход + ?(фЗачистка,АктЗачисткиВесНачОстП,0),ВыборкаНом.ВесПоВлажностиПриход + ?(фЗачистка,АктЗачисткиВесПоВлНачОстП,0),2);
	ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиПриход	= Процент(ВыборкаНом.ВесПриход + ?(фЗачистка,АктЗачисткиВесНачОстП,0),ВыборкаНом.ВесПоСорнойПримесиПриход + ?(фЗачистка,АктЗачисткиВесПоСорНачОстП,0),2);
	ОблКонОст.Параметры.ПроцентПоВлажностиРасход		= Процент(ВыборкаНом.ВесРасход + ?(фЗачистка,АктЗачисткиВесНачОстР,0),ВыборкаНом.ВесПоВлажностиРасход + ?(фЗачистка,АктЗачисткиВесПоВлНачОстР,0),2);
	ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиРасход = Процент(ВыборкаНом.ВесРасход + ?(фЗачистка,АктЗачисткиВесНачОстР,0),ВыборкаНом.ВесПоСорнойПримесиРасход + ?(фЗачистка,АктЗачисткиВесПоСорНачОстР,0),2);
	ОблКонОст.Параметры.ВесПриход						= ОКР(ВыборкаНом.ВесПриход + ?(фЗачистка,АктЗачисткиВесНачОстП,0),2);				
	ОблКонОст.Параметры.КвоПриход						= ОКР(ВыборкаНом.КвоПриход + ?(фЗачистка,АктЗачисткиКвоНачОстП,0),2);			
	ОблКонОст.Параметры.КвоРасход						= ОКР(ВыборкаНом.КвоРасход + ?(фЗачистка,АктЗачисткиКвоНачОстР,0),2);										
	ОблКонОст.Параметры.ВесПоВлажностиПриход			= ОКР(ВыборкаНом.ВесПоВлажностиПриход + ?(фЗачистка,АктЗачисткиВесПоВлНачОстП,0),2);
	ОблКонОст.Параметры.ВесПоСорнойПримесиПриход		= ОКР(ВыборкаНом.ВесПоСорнойПримесиПриход + ?(фЗачистка,АктЗачисткиВесПоСорНачОстП,0),2);									
	ОблКонОст.Параметры.ВесРасход						= ОКР(ВыборкаНом.ВесРасход + ?(фЗачистка,АктЗачисткиВесНачОстР,0),2);
	ОблКонОст.Параметры.ВесПоВлажностиРасход			= ОКР(ВыборкаНом.ВесПоВлажностиРасход + ?(фЗачистка,АктЗачисткиВесПоВлНачОстР,0),2);			
	ОблКонОст.Параметры.ВесПоСорнойПримесиРасход		= ОКР(ВыборкаНом.ВесПоСорнойПримесиРасход + ?(фЗачистка,АктЗачисткиВесПоСорНачОстР,0),2);
	Если ПоказыватьУсушку Тогда
		ОблКонОст.Параметры.УбыльВесаПриСушкеРасход			= ОКР(ВыборкаНом.УбыльВесаПриСушкеКонечныйОстаток,2);
	КонецЕсли;
	
	ОблКонОст.Параметры.ПроцентПоВлажностиПриходУ		= Процент(ВыборкаНом.ВесПриходКонечныйОстаток,ВыборкаНом.ВесПоВлажностиПриходКонечныйОстаток,2);
	ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиПриходУ= Процент(ВыборкаНом.ВесПриходКонечныйОстаток,ВыборкаНом.ВесПоСорнойПримесиПриходКонечныйОстаток,2);
	ОблКонОст.Параметры.ПроцентПоВлажностиРасходУ		= Процент(ВыборкаНом.ВесРасходКонечныйОстаток,ВыборкаНом.ВесПоВлажностиРасходКонечныйОстаток,2);
	ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиРасходУ= Процент(ВыборкаНом.ВесРасходКонечныйОстаток,ВыборкаНом.ВесПоСорнойПримесиРасходКонечныйОстаток,2);
	ОблКонОст.Параметры.КвоПриходУ						= ОКР(ВыборкаНом.КвоПриходКонечныйОстаток,2);
	ОблКонОст.Параметры.КвоРасходУ						= ОКР(ВыборкаНом.КвоРасходКонечныйОстаток,2);				
	ОблКонОст.Параметры.ВесПриходУ						= ОКР(ВыборкаНом.ВесПриходКонечныйОстаток,2);
	ОблКонОст.Параметры.ВесПоВлажностиПриходУ			= ОКР(ВыборкаНом.ВесПоВлажностиПриходКонечныйОстаток,2);
	ОблКонОст.Параметры.ВесПоСорнойПримесиПриходУ		= ОКР(ВыборкаНом.ВесПоСорнойПримесиПриходКонечныйОстаток,2);					
	ОблКонОст.Параметры.ВесРасходУ						= ОКР(ВыборкаНом.ВесРасходКонечныйОстаток,2);
	ОблКонОст.Параметры.ВесПоВлажностиРасходУ			= ОКР(ВыборкаНом.ВесПоВлажностиРасходКонечныйОстаток,2);
	ОблКонОст.Параметры.ВесПоСорнойПримесиРасходУ		= ОКР(ВыборкаНом.ВесПоСорнойПримесиРасходКонечныйОстаток,2);
	Если ПоказыватьУсушку Тогда
		ОблКонОст.Параметры.УбыльВесаПриСушкеРасходУ		= ОКР(ВыборкаНом.УбыльВесаПриСушкеКонечныйОстаток,2);
	КонецЕсли;
	ОблКонОст.Параметры.ВесОстПУ						= ОКР(ВыборкаНом.ВесПриходКонечныйОстаток-ВыборкаНом.ВесРасходКонечныйОстаток,2);
	
	//ОблКонОст.Параметры.КвоПриходМ						= ОКР(ВыборкаНом.КвоПриходЗаМесяц,2);
	//ОблКонОст.Параметры.ВесПриходМ						= ОКР(ВыборкаНом.ВесПриходЗаМесяц,2);
	//ОблКонОст.Параметры.ПроцентПоВлажностиПриходМ		= Процент(ВыборкаНом.ВесПриходЗаМесяц,ВыборкаНом.ВесПоВлажностиПриходЗаМесяц,2);
	//ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиПриходМ = Процент(ВыборкаНом.ВесПриходЗаМесяц,ВыборкаНом.ВесПоСорнойПримесиПриходЗаМесяц,2);	
	//ОблКонОст.Параметры.ВесПоВлажностиПриходМ			= ОКР(ВыборкаНом.ВесПоВлажностиПриходЗаМесяц,2);
	//ОблКонОст.Параметры.ВесПоСорнойПримесиПриходМ		= ОКР(ВыборкаНом.ВесПоСорнойПримесиПриходЗаМесяц,2);											
	//ОблКонОст.Параметры.КвоРасходМ						= ОКР(ВыборкаНом.КвоРасходЗаМесяц,2);
	//ОблКонОст.Параметры.ВесРасходМ						= ОКР(ВыборкаНом.ВесРасходЗаМесяц,2);
	//ОблКонОст.Параметры.ПроцентПоВлажностиРасходМ		= Процент(ВыборкаНом.ВесРасходЗаМесяц,ВыборкаНом.ВесПоВлажностиРасходЗаМесяц,2);
	//ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиРасходМ = Процент(ВыборкаНом.ВесРасходЗаМесяц,ВыборкаНом.ВесПоСорнойПримесиРасходЗаМесяц,2);
	//ОблКонОст.Параметры.ВесПоВлажностиРасходМ			= ОКР(ВыборкаНом.ВесПоВлажностиРасходЗаМесяц,2);			
	//ОблКонОст.Параметры.ВесПоСорнойПримесиРасходМ		= ОКР(ВыборкаНом.ВесПоСорнойПримесиРасходЗаМесяц,2);
	//ОблКонОст.Параметры.ВесОстПМ						= ОКР(ВыборкаНом.ВесПриходЗаМесяц - ВыборкаНом.ВесРасходЗаМесяц,2);
	//Если ПоказыватьУсушку Тогда
	//ОблКонОст.Параметры.УбыльВесаПриСушкеРасходМ		= ОКР(ВыборкаНом.УбыльВесаПриСушкеЗаМесяц,2);
	//КонецЕсли;
	
КонецПроцедуры


Процедура ЗаполнитьОбластьКонОстатковПоНоменклатуреПослеЗачистки(ОблКонОст, Выборка)
	
	ОблКонОст.Параметры.КвоПриходУ						= ОКР(Выборка.КвоПриходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ВесПриходУ						= ОКР(Выборка.ВесПриходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ПроцентПоВлажностиПриходУ		= Процент(Выборка.ВесПриходНачальныйОстатокПоДокументу,Выборка.ВесПоВлажностиПриходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиПриходУ= Процент(Выборка.ВесПриходНачальныйОстатокПоДокументу,Выборка.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,2);	
	ОблКонОст.Параметры.ВесПоВлажностиПриходУ			= ОКР(Выборка.ВесПоВлажностиПриходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ВесПоСорнойПримесиПриходУ		= ОКР(Выборка.ВесПоСорнойПримесиПриходНачальныйОстатокПоДокументу,2);										
	
	ОблКонОст.Параметры.КвоРасходУ						= ОКР(Выборка.КвоРасходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ВесРасходУ						= ОКР(Выборка.ВесРасходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ПроцентПоВлажностиРасходУ		= Процент(Выборка.ВесРасходНачальныйОстатокПоДокументу,Выборка.ВесПоВлажностиРасходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ПроцентВесПоСорнойПримесиРасходУ= Процент(Выборка.ВесРасходНачальныйОстатокПоДокументу,Выборка.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,2);
	ОблКонОст.Параметры.ВесПоВлажностиРасходУ			= ОКР(Выборка.ВесПоВлажностиРасходНачальныйОстатокПоДокументу,2);			
	ОблКонОст.Параметры.ВесПоСорнойПримесиРасходУ		= ОКР(Выборка.ВесПоСорнойПримесиРасходНачальныйОстатокПоДокументу,2);
	
	ОблКонОст.Параметры.ВесОстПУ						= ОКР(Выборка.ВесПриходНачальныйОстатокПоДокументу - Выборка.ВесРасходНачальныйОстатокПоДокументу,2);
	Если ПоказыватьУсушку Тогда
		ОблКонОст.Параметры.УбыльВесаПриСушкеРасходУ		= ОКР(Выборка.УбыльВесаПриСушкеНачальныйОстатокПоДокументу,2);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьОбластьКонОстатковЗаМесяц(ОблКонОстЗаМесяц, Выборка)
	
	Попытка
		ОблКонОстЗаМесяц.Параметры.Месяц							= ПредставлениеПериода(НачалоМесяца(Выборка.Период_Месяц), КонецМесяца(Выборка.Период_Месяц), "ФП=Истина");//формат(Выборка.Период_Месяц,"Л=; ДЛФ=DD"+ Локализация.ОпределитьКодЯзыкаДляФормат(КодЯзыкаПечать));
	Исключение КонецПопытки;
	ОблКонОстЗаМесяц.Параметры.КвоПриходМ						= ОКР(Выборка.КвоПриходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ВесПриходМ						= ОКР(Выборка.ВесПриходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ПроцентПоВлажностиПриходМ		= Процент(Выборка.ВесПриходЗаМесяц,Выборка.ВесПоВлажностиПриходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ПроцентВесПоСорнойПримесиПриходМ = Процент(Выборка.ВесПриходЗаМесяц,Выборка.ВесПоСорнойПримесиПриходЗаМесяц,2);	
	ОблКонОстЗаМесяц.Параметры.ВесПоВлажностиПриходМ			= ОКР(Выборка.ВесПоВлажностиПриходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ВесПоСорнойПримесиПриходМ		= ОКР(Выборка.ВесПоСорнойПримесиПриходЗаМесяц,2);										
	
	ОблКонОстЗаМесяц.Параметры.КвоРасходМ						= ОКР(Выборка.КвоРасходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ВесРасходМ						= ОКР(Выборка.ВесРасходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ПроцентПоВлажностиРасходМ		= Процент(Выборка.ВесРасходЗаМесяц,Выборка.ВесПоВлажностиРасходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ПроцентВесПоСорнойПримесиРасходМ = Процент(Выборка.ВесРасходЗаМесяц,Выборка.ВесПоСорнойПримесиРасходЗаМесяц,2);
	ОблКонОстЗаМесяц.Параметры.ВесПоВлажностиРасходМ			= ОКР(Выборка.ВесПоВлажностиРасходЗаМесяц,2);			
	ОблКонОстЗаМесяц.Параметры.ВесПоСорнойПримесиРасходМ		= ОКР(Выборка.ВесПоСорнойПримесиРасходЗаМесяц,2);
	
	ОблКонОстЗаМесяц.Параметры.ВесОстПМ							= 0;//ОКР(Выборка.ВесПриходЗаМесяц - Выборка.ВесРасходЗаМесяц,2);
	
	Если ПоказыватьУсушку Тогда
		ОблКонОстЗаМесяц.Параметры.УбыльВесаПриСушкеРасходМ		= ОКР(Выборка.УбыльВесаПриСушкеЗаМесяц,2);
	КонецЕсли;
	
КонецПроцедуры

// Таблица Расшифровки Итогов и оборотов
//
Функция СформироватьСтруктуруТаблицыРасшифровкиИтогов()
	
	ТаблицаРасшифровкиИтогов = Новый ТаблицаЗначений;
	
	ТаблицаРасшифровкиИтогов.Колонки.Добавить("ВидРасхода");
	ТаблицаРасшифровкиИтогов.Колонки.Добавить("Порядок");
	ТаблицаРасшифровкиИтогов.Колонки.Добавить("Вес");
	ТаблицаРасшифровкиИтогов.Колонки.Добавить("ВесПоВлажности");
	ТаблицаРасшифровкиИтогов.Колонки.Добавить("ВесПоСорнойПримеси");
	
	Возврат ТаблицаРасшифровкиИтогов;
	
КонецФункции

Процедура ЗаполнитьТаблицуРасшифровкиИтоговПриход(ТаблицаРасшифровкиИтогов, Выборка)
	
	СтрТаблицыРасшифровкиИтогов = ТаблицаРасшифровкиИтогов.Добавить();
	
	Переоформление 					= 0;
	ВесПоВлажностиПереоформление 	= 0;
	ВесПоСорнойПримесиПереоформление = 0;
	Расход 							= 0;
	ВесПоВлажностиРасход 			= 0;
	ВесПоСорнойПримесиРасход 		= 0;		
	СтрТаблицыРасшифровкиИтогов.Вес = 0;
	УбыльПоВлаге 					= 0;
	
	Если ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_Переоформление") Тогда
		СтрТаблицыРасшифровкиИтогов.ВидРасхода = "Переоформлення:";
		СтрТаблицыРасшифровкиИтогов.Порядок = 2;
		Переоформление 	= Выборка.ВесПриход;
		ВесПоВлажностиПереоформление = Выборка.ВесПоВлажностиПриход;
		ВесПоСорнойПримесиПереоформление = Выборка.ВесПоСорнойПримесиПриход;
	ИначеЕсли ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_Форма34Сводная") Тогда
		СтрТаблицыРасшифровкиИтогов.ВидРасхода = "Убуток від очистки:";
		СтрТаблицыРасшифровкиИтогов.Порядок = 4;
		УбыльПоСору 	= Выборка.ВесПриход;
		ВесПоВлажностиУбыльПоСору = Выборка.ВесПоВлажностиПриход;
		ВесПоСорнойПримесиУбыльПоСору = Выборка.ВесПоСорнойПримесиПриход;		
	Иначе 
		СтрТаблицыРасшифровкиИтогов.ВидРасхода = "Прихід:";
		СтрТаблицыРасшифровкиИтогов.Порядок = 1;
		Расход 			= Выборка.ВесПриход;
		ВесПоВлажностиРасход = Выборка.ВесПоВлажностиПриход;
		ВесПоСорнойПримесиРасход = Выборка.ВесПоСорнойПримесиПриход;		
	КонецЕсли;
	
	СтрТаблицыРасшифровкиИтогов.Вес 				= Выборка.ВесПриход;
	СтрТаблицыРасшифровкиИтогов.ВесПоВлажности 		= Выборка.ВесПоВлажностиПриход;
	СтрТаблицыРасшифровкиИтогов.ВесПоСорнойПримеси 	= Выборка.ВесПоСорнойПримесиПриход;
	
	// Итоги:
	СтрТаблицыРасшифровкиИтогов = ТаблицаРасшифровкиИтогов.Добавить();
	СтрТаблицыРасшифровкиИтогов.ВидРасхода 			= "Всього:";
	СтрТаблицыРасшифровкиИтогов.Порядок 			= 3;
	СтрТаблицыРасшифровкиИтогов.Вес 				= Переоформление + Расход;
	СтрТаблицыРасшифровкиИтогов.ВесПоВлажности 		= ВесПоВлажностиПереоформление + ВесПоВлажностиРасход;
	СтрТаблицыРасшифровкиИтогов.ВесПоСорнойПримеси 	= ВесПоСорнойПримесиПереоформление + ВесПоСорнойПримесиРасход;
	
КонецПроцедуры

Функция Процент(ФизВес=0, ВесПоВлаж=0, Округление = 0) // не является ошибкой проверки конфигурации
	Если ФизВес = 0 Тогда
		Возврат 0;
	Иначе
		Возврат Окр(100*ВесПоВлаж/ФизВес , Округление);
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьТаблицуРасшифровкиИтоговРасход(ТаблицаРасшифровкиИтогов, Выборка)
	
	СтрТаблицыРасшифровкиИтогов = ТаблицаРасшифровкиИтогов.Добавить();
	
	Переоформление 					= 0;
	ВесПоВлажностиПереоформление 	= 0;
	ВесПоСорнойПримесиПереоформление = 0;
	УбыльПоСору 					= 0;
	ВесПоВлажностиУбыльПоСору 		= 0;
	ВесПоСорнойПримесиУбыльПоСору 	= 0;		
	Расход 							= 0;
	ВесПоВлажностиРасход 			= 0;
	ВесПоСорнойПримесиРасход 		= 0;		
	СтрТаблицыРасшифровкиИтогов.Вес = 0;
	УбыльПоВлаге 					= 0;
	
	Если ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_Переоформление") Тогда
		СтрТаблицыРасшифровкиИтогов.ВидРасхода = "Переоформлення:";
		СтрТаблицыРасшифровкиИтогов.Порядок = 2;
		Переоформление 	= Выборка.ВесРасход;
		ВесПоВлажностиПереоформление = Выборка.ВесПоВлажностиРасход;
		ВесПоСорнойПримесиПереоформление = Выборка.ВесПоСорнойПримесиРасход;
	ИначеЕсли ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_Форма34Сводная") Тогда
		
		ЭтоКатегорийныеОтходы = Ложь;
		Если Выборка.КодРасхода = Перечисления.ИНАГРО_КодыРасхода.Кат1 Тогда
			СтрТаблицыРасшифровкиИтогов.ВидРасхода = "в т. ч. Відходи I кат.:";
			ЭтоКатегорийныеОтходы = Истина;
		ИначеЕсли Выборка.КодРасхода = Перечисления.ИНАГРО_КодыРасхода.Кат2 Тогда
			СтрТаблицыРасшифровкиИтогов.ВидРасхода = "в т. ч. Відходи II кат.:";
			ЭтоКатегорийныеОтходы = Истина;
		ИначеЕсли Выборка.КодРасхода = Перечисления.ИНАГРО_КодыРасхода.Кат3 Тогда
			СтрТаблицыРасшифровкиИтогов.ВидРасхода = "в т. ч. Відходи III кат.:";
			ЭтоКатегорийныеОтходы = Истина;
		ИначеЕсли Выборка.КодРасхода = Перечисления.ИНАГРО_КодыРасхода.Побочный Тогда
			СтрТаблицыРасшифровкиИтогов.ВидРасхода = "в т. ч. Побічний продукт:";
			ЭтоКатегорийныеОтходы = Истина;
		КонецЕсли;
		
		Если ЭтоКатегорийныеОтходы Тогда
			СтрТаблицыРасшифровкиИтогов.Порядок = 4;
			СтрТаблицыРасшифровкиИтогов.Вес 				= Выборка.ВесРасход;
			СтрТаблицыРасшифровкиИтогов.ВесПоВлажности 		= Выборка.ВесПоВлажностиРасход;
			СтрТаблицыРасшифровкиИтогов.ВесПоСорнойПримеси 	= Выборка.ВесПоСорнойПримесиРасход;		
			СтрТаблицыРасшифровкиИтогов 					= ТаблицаРасшифровкиИтогов.Добавить();
		КонецЕсли;
	
		СтрТаблицыРасшифровкиИтогов.ВидРасхода 			= " Всього убуток від очистки:";
		СтрТаблицыРасшифровкиИтогов.Порядок 			= 4;
		УбыльПоСору 									= Выборка.ВесРасход;
		ВесПоВлажностиУбыльПоСору 						= Выборка.ВесПоВлажностиРасход;
		ВесПоСорнойПримесиУбыльПоСору 					= Выборка.ВесПоСорнойПримесиРасход;		

	ИначеЕсли ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_АктРасчет310") ИЛИ ТипЗнч(Выборка.Регистратор)=Тип("ДокументСсылка.ИНАГРО_АктЗачистки") Тогда
		СтрТаблицыРасшифровкиИтогов.ВидРасхода = "Списання зерна: ";
		СтрТаблицыРасшифровкиИтогов.Порядок = 8;
		Возврат;
	Иначе 
		СтрТаблицыРасшифровкиИтогов.ВидРасхода = "Відпуск:";
		СтрТаблицыРасшифровкиИтогов.Порядок = 1;
		Расход 			= Выборка.ВесРасход;
		ВесПоВлажностиРасход = Выборка.ВесПоВлажностиРасход;
		ВесПоСорнойПримесиРасход = Выборка.ВесПоСорнойПримесиРасход;		
	КонецЕсли;
	
	СтрТаблицыРасшифровкиИтогов.Вес 				= Выборка.ВесРасход;
	СтрТаблицыРасшифровкиИтогов.ВесПоВлажности 		= Выборка.ВесПоВлажностиРасход;
	СтрТаблицыРасшифровкиИтогов.ВесПоСорнойПримеси 	= Выборка.ВесПоСорнойПримесиРасход;
	
	Если Выборка.УбыльВесаПриСушке > 0 Тогда
		СтрТаблицыРасшифровкиИтогов = ТаблицаРасшифровкиИтогов.Добавить();
		СтрТаблицыРасшифровкиИтогов.ВидРасхода = "Убуток по вологості:";
		СтрТаблицыРасшифровкиИтогов.Порядок = 6;
		СтрТаблицыРасшифровкиИтогов.Вес 	   = Выборка.УбыльВесаПриСушке;
		УбыльПоВлаге = Выборка.ВесРасход;
	КонецЕсли;
	
	// Итоги:
	СтрТаблицыРасшифровкиИтогов = ТаблицаРасшифровкиИтогов.Добавить();
	СтрТаблицыРасшифровкиИтогов.ВидРасхода 			= "Всього по відпуску:";
	СтрТаблицыРасшифровкиИтогов.Порядок 			= 3;
	СтрТаблицыРасшифровкиИтогов.Вес 				= Переоформление + Расход;
	СтрТаблицыРасшифровкиИтогов.ВесПоВлажности 		= ВесПоВлажностиПереоформление + ВесПоВлажностиРасход;
	СтрТаблицыРасшифровкиИтогов.ВесПоСорнойПримеси 	= ВесПоСорнойПримесиПереоформление + ВесПоСорнойПримесиРасход;
	
	СтрТаблицыРасшифровкиИтогов = ТаблицаРасшифровкиИтогов.Добавить();
	СтрТаблицыРасшифровкиИтогов.ВидРасхода 			= "Відпуск + убуток від очистки:";
	СтрТаблицыРасшифровкиИтогов.Порядок 			= 5;
	СтрТаблицыРасшифровкиИтогов.Вес 				= Переоформление + Расход + УбыльПоСору;
	СтрТаблицыРасшифровкиИтогов.ВесПоВлажности 		= ВесПоВлажностиПереоформление + ВесПоВлажностиРасход + ВесПоВлажностиУбыльПоСору;
	СтрТаблицыРасшифровкиИтогов.ВесПоСорнойПримеси 	= ВесПоСорнойПримесиПереоформление + ВесПоСорнойПримесиРасход + ВесПоСорнойПримесиУбыльПоСору;
	
	СтрТаблицыРасшифровкиИтогов = ТаблицаРасшифровкиИтогов.Добавить();
	СтрТаблицыРасшифровкиИтогов.Порядок 			= 7;
	СтрТаблицыРасшифровкиИтогов.ВидРасхода 			= "Відпуск + убуток:";
	СтрТаблицыРасшифровкиИтогов.Вес 				= Переоформление + Расход + УбыльПоСору + УбыльПоВлаге;
	
КонецПроцедуры

Функция СформироватьЗаголовок(ДатаНач,ДатаКон, НомерСтраницы, ШапкаНоменклатура = "", ШапкаСклад = "") Экспорт
	
	КодЯзыкаПечать = "uk";

	
	// Вывод заголовка, описателя периода и фильтров и шапки
	Если ДатаНач = '00010101000000' И ДатаКон = '00010101000000' Тогда
		
		ОписаниеПериода     = НСтр("ru= 'Период: без ограничения.';uk='Період: без обмеження.'",КодЯзыкаПечать);		
		
	Иначе
		
		Если ДатаНач = '00010101000000' ИЛИ КонецПериода = '00010101000000' Тогда
			
			ОписаниеПериода = НСтр("ru= 'Период: ';uk='Період: '",КодЯзыкаПечать) + Формат(НачалоПериода, "ДФ = ""дд.ММ.гггг""; ДП = "+НСтр("ru= 'без ограничения';uk='без обмеження'",КодЯзыкаПечать)+"") 
			+ " - "      + Формат(КонецПериода, "ДФ = ""дд.ММ.гггг""; ДП = "+НСтр("ru= 'без ограничения';uk='без обмеження'")+"");
			
		Иначе
			
			ОписаниеПериода = НСтр("ru= 'Период: ';uk='Період: '",КодЯзыкаПечать) + ПредставлениеПериода(НачалоДня(НачалоПериода), КонецДня(ДатаКон), "Л = "+КодЯзыкаПечать+"; ФП = Истина");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Макет = ПолучитьМакет("Форма36");
	ПреобразоватьМакет(Макет);
	КодЯзыкаПечать = "uk";
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;
	
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Шапка");
	
	НазваниеОрганизации = Организация.НаименованиеПолное;
	Если ПустаяСтрока(НазваниеОрганизации) Тогда
		НазваниеОрганизации = Организация;
	КонецЕсли;
	
	Структура = Новый Структура("Организация", Организация);
	ЗаголовокОтчета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	ЗаголовокОтчета.Параметры.ИдентификационныйКод= Организация.КодПоЕДРПОУ;
	
	//ЗаголовокОтчета.Параметры.Период = ОписаниеПериода;
	//ЗаголовокОтчета.Параметры.ТекДата = ТекущаяДата();
	
	// Вывод списка фильтров:
	//СтрФильтры   = "";	
	//Если Организация<>Справочники.Организации.ПустаяСсылка() Тогда
	//	//НСтр("ru='';uk=''")
	//	СтрФильтры=СтрФильтры+НСтр("ru='Фирма: ';uk='Фірма: '",КодЯзыкаПечать)+Организация+", ";
	//КонецЕсли;
	//Если Владелец<>Справочники.Контрагенты.ПустаяСсылка() Тогда
	//	СтрФильтры=СтрФильтры+НСтр("ru='Владелец: ';uk='Власник: '",КодЯзыкаПечать)+Владелец+", ";
	//КонецЕсли;	
	//Если Склад<>Справочники.Склады.ПустаяСсылка() Тогда
	//	СтрФильтры=СтрФильтры+"Склад: "+Склад+", ";
	//КонецЕсли;
	//Если Номенклатура<>Справочники.Номенклатура.ПустаяСсылка() Тогда
	//	СтрФильтры=СтрФильтры+"ТМЦ: "+Номенклатура+", ";
	//КонецЕсли;
	//Если Урожай<>Справочники.ИНАГРО_ВидыУрожая.ПустаяСсылка() Тогда
	//	СтрФильтры=СтрФильтры+"Урожай: "+Урожай+", ";
	//КонецЕсли;
	//Если ВидХранения<>Справочники.ИНАГРО_ВидыХранения.ПустаяСсылка() Тогда
	//	СтрФильтры=СтрФильтры+НСтр("ru='Вид хранения: ';uk='Вид зберігання: '",КодЯзыкаПечать)+ВидХранения+", ";
	//КонецЕсли;	
	
	//Если Не ПустаяСтрока(СтрФильтры) Тогда				
	//	ЗаголовокОтчета.Параметры.Отбор = НСтр("ru='Отбор: ';uk='Відбір: '",КодЯзыкаПечать) + Лев(СтрФильтры,СтрДлина(СтрФильтры)-2);
	//КонецЕсли;
	
	ЗаголовокОтчета.Параметры.Склад = ШапкаСклад;
    ЗаголовокОтчета.Параметры.ЗавСкладом = ИНАГРО_Элеватор.ОтветственныеЛицаИмяФамилия(Организация, ДатаКон, ШапкаСклад);
	ЗаголовокОтчета.Параметры.Культура = ШапкаНоменклатура;
	ЗаголовокОтчета.Параметры.ГодУрожая = Урожай;
	Если НумерацияСтраниц тогда 
		ЗаголовокОтчета.Параметры.НомерЛиста = Строка(НомерСтраницы);
	КонецЕсли;
	
	Возврат(ЗаголовокОтчета);
	
КонецФункции

Функция ПолучитьОбластьДляСтрокиДокумента(Макет)
	
	Если ВыводитьПоказателиКачестваСТочностьюДоОдногоЗнака Тогда
		Рез = Макет.ПолучитьОбласть("ТекДокСОкруглением");
	Иначе
		Рез = Макет.ПолучитьОбласть("ТекДок");
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции

Процедура ПреобразоватьМакет(Макет);		
	
	Если НЕ ПоказыватьУсушку Тогда
		Область = Макет.Область("КолонкаУсушка");
		Макет.УдалитьОбласть(Область, ТипСмещенияТабличногоДокумента.ПоГоризонтали);
	КонецЕсли;
	
КонецПроцедуры

Процедура ВывестиРасшифровкуИтоговИОборотов(Макет, ТабДок, ТаблицаРасшифровкиИтоговПриход, ТаблицаРасшифровкиИтоговРасход);
	
	ОблШапкаИтогов 			= Макет.ПолучитьОбласть("ШапкаИтогов");
	ОблСтрокаИтогов 		= Макет.ПолучитьОбласть("СтрокаИтогов");
	ПустаяОблСтрокаИтогов 	= Макет.ПолучитьОбласть("СтрокаИтогов");
	ОблДноИтогов 			= Макет.ПолучитьОбласть("ДноИтогов");
	
	ТаблицаРасшифровкиИтоговПриход.Свернуть("Порядок, ВидРасхода", "Вес, ВесПоВлажности, ВесПоСорнойПримеси");
	ТаблицаРасшифровкиИтоговПриход.Сортировать("Порядок");
	ТаблицаРасшифровкиИтоговРасход.Свернуть("Порядок, ВидРасхода", "Вес, ВесПоВлажности, ВесПоСорнойПримеси");
	ТаблицаРасшифровкиИтоговРасход.Сортировать("Порядок");
	
	ТабДок.Вывести(ОблШапкаИтогов);
	КвоСтрок = Макс(ТаблицаРасшифровкиИтоговПриход.Количество(), ТаблицаРасшифровкиИтоговРасход.Количество());					
	Для НомерСтроки = 0 По КвоСтрок - 1 Цикл
		ЗаполнитьЗначенияСвойств(ОблСтрокаИтогов.Параметры, ПустаяОблСтрокаИтогов.Параметры);
		Если НомерСтроки <= ТаблицаРасшифровкиИтоговПриход.Количество() - 1 Тогда
			СтрТаблицыРасшифровкиИтоговПриход 					= ТаблицаРасшифровкиИтоговПриход.Получить(НомерСтроки);
			ОблСтрокаИтогов.Параметры.ВидПрихода 				= СтрТаблицыРасшифровкиИтоговПриход.ВидРасхода;
			ОблСтрокаИтогов.Параметры.ВесПриход					= СтрТаблицыРасшифровкиИтоговПриход.Вес;
			ОблСтрокаИтогов.Параметры.ВесПоВлажностиПриход 		= СтрТаблицыРасшифровкиИтоговПриход.ВесПоВлажности;
			ОблСтрокаИтогов.Параметры.ВесПоСорнойПримесиПриход 	= СтрТаблицыРасшифровкиИтоговПриход.ВесПоСорнойПримеси;
			ОблСтрокаИтогов.Параметры.ВлажностьПриход			= ИНАГРО_Элеватор.Процент(СтрТаблицыРасшифровкиИтоговПриход.Вес, СтрТаблицыРасшифровкиИтоговПриход.ВесПоВлажности);
			ОблСтрокаИтогов.Параметры.СорнаяПримесьПриход		= ИНАГРО_Элеватор.Процент(СтрТаблицыРасшифровкиИтоговПриход.Вес, СтрТаблицыРасшифровкиИтоговПриход.ВесПоСорнойПримеси);
		КонецЕсли;
		Если НомерСтроки <= ТаблицаРасшифровкиИтоговРасход.Количество() - 1 Тогда
			СтрТаблицыРасшифровкиИтоговРасход					= ТаблицаРасшифровкиИтоговРасход.Получить(НомерСтроки);
			ОблСтрокаИтогов.Параметры.ВидРасхода 				= СтрТаблицыРасшифровкиИтоговРасход.ВидРасхода;
			ОблСтрокаИтогов.Параметры.ВесРасход					= СтрТаблицыРасшифровкиИтоговРасход.Вес;
			ОблСтрокаИтогов.Параметры.ВесПоВлажностиРасход 		= СтрТаблицыРасшифровкиИтоговРасход.ВесПоВлажности;
			ОблСтрокаИтогов.Параметры.ВесПоСорнойПримесиРасход 	= СтрТаблицыРасшифровкиИтоговРасход.ВесПоСорнойПримеси;
			ОблСтрокаИтогов.Параметры.ВлажностьРасход 			= ИНАГРО_Элеватор.Процент(СтрТаблицыРасшифровкиИтоговРасход.Вес, СтрТаблицыРасшифровкиИтоговРасход.ВесПоВлажности);
			ОблСтрокаИтогов.Параметры.СорнаяПримесьРасход 		= ИНАГРО_Элеватор.Процент(СтрТаблицыРасшифровкиИтоговРасход.Вес, СтрТаблицыРасшифровкиИтоговРасход.ВесПоСорнойПримеси);
		КонецЕсли;
		ТабДок.Вывести(ОблСтрокаИтогов);
	КонецЦикла;
	ТабДок.Вывести(ОблДноИтогов);
	
КонецПроцедуры

Функция ПолучитьОткудаКуда(Ссылка,Приход=0,КодРасхода=Неопределено) Экспорт
	ОткудаКуда="";
	Если ОбщегоНазначенияБП.ЕстьРеквизитДокумента("ОписаниеДвиженияФормы36",Ссылка.Метаданные()) Тогда
		Если НЕ СокрЛП(Ссылка.ОписаниеДвиженияФормы36) = "" Тогда
			ОткудаКуда = Ссылка.ОписаниеДвиженияФормы36;
		КонецЕсли;
	КонецЕсли;
	
	Если СокрЛП(ОткудаКуда) = "" Тогда
		ОткудаКуда = ПолучитьОткудаКудаИзШаблона(Ссылка, Приход);
	КонецЕсли;	
	
	Если СокрЛП(ОткудаКуда) = "" Тогда
		
		Если ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_РеестрТТНВвоз") ИЛИ ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_ТТНВвоз") Тогда
			ОткудаКуда= ""+Ссылка.Владелец.Наименование+?(строка(Ссылка.УдалитьОткуда)="","",", "+Ссылка.УдалитьОткуда.Наименование);
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_РеестрТТНВнутр") ИЛИ ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_ТТНВнутр") Тогда
			Если Ссылка.Перевес=Истина Тогда
				ОткудаКуда = "Перевес. "+Ссылка.Склад.Наименование+" / "+Ссылка.НовыйСклад.Наименование;
			Иначе               			
				ОткудаКуда = ""+?(ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_РеестрТТНВнутр"),Ссылка.СписокТТН[0].Владелец,Ссылка.Владелец)+". "+Ссылка.Склад.Наименование+" / "+Ссылка.НовыйСклад.Наименование;
			КонецЕсли;			
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_РеестрТТНВывоз") ИЛИ ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_ТТНВывоз") Тогда
			Если  ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_РеестрТТНВывоз") и Ссылка.видОперации=Перечисления.ИНАГРО_ВидыОперацийРеестрТТНВывоз.ВывозОтходов тогда
				ОткудаКуда = ""+Ссылка.отходы;
			иначе
				ОткудаКуда = ""+Ссылка.Владелец.Наименование+" / "+Ссылка.Получатель.Наименование;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_Переоформление") Тогда
			Если Приход=0 Тогда
				ОткудаКуда = "Переоформлено на "+Ссылка.НовыйВладелец.Наименование;			 
			Иначе 
				ОткудаКуда = "Переоформлено з "+Ссылка.Владелец.Наименование;  
			КонецЕсли;
		ИначеЕсли  ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_Перемещение") Тогда
			Если Приход=0 Тогда
				ОткудаКуда = ""+Ссылка.НовыйСклад.Наименование;			 
			Иначе
				ОткудаКуда = ""+Ссылка.Склад.Наименование;			 
			КонецЕсли;
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_ПриказНаВывоз") Тогда
			ОткудаКуда = ""+СокрЛП(Ссылка.ПунктНазначения)+", "+СокрЛП(Ссылка.НомерТранспорта);
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_Форма34Сводная") Тогда
			ОткудаКуда = "";
			ЕСЛИ  ссылка.видДокумента=Перечисления.ИНАГРО_ВидыАктовОчисткиСушки.Оздоровление тогда
				ОткудаКуда = "Оздоровление / ";
			иначе
				Если Ссылка.ПроводилиОчистку И ЗначениеЗаполнено(КодРасхода) Тогда
					//ОткудаКуда = "" + КодРасхода + " " + "Очистка ";
					ОткудаКуда = "" + КодРасхода;
				ИначеЕсли Ссылка.ПроводилиСушку И Ссылка.ПроводилиОчистку И НЕ ЗначениеЗаполнено(КодРасхода) Тогда
					ОткудаКуда = "Очистка/Сушка ";
				ИначеЕсли Ссылка.ПроводилиСушку Тогда
					ОткудаКуда = "Сушка ";
				Иначе
					ОткудаКуда = "Очистка/Сушка ";
				КонецЕсли;
			КонецЕсли;
			ОткудаКуда = ОткудаКуда + ?(Ссылка.ЦельПодработки = "", "", " (" + Ссылка.ЦельПодработки +")");
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_Переработка") Тогда
			ОткудаКуда = "Переработка "+Ссылка.Владелец.Наименование;
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_АктСписания") Тогда
			ОткудаКуда = "Списание в переработку  "+Ссылка.Владелец.Наименование;
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_ПриходИзПроизводства") Тогда
			ОткудаКуда = "Оприходование продукции  "+Ссылка.Владелец.Наименование;		
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_АктЗачистки") Тогда
			ОткудаКуда = "Акт зачистки "+Ссылка.Номенклатура;
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_АктРасчет310") Тогда
			ОткудаКуда = "Акт расчет "+Ссылка.Владелец.Наименование;
		ИначеЕсли (ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_Корректировка")) или (ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_КорректировкаСписком")) Тогда
			ОткудаКуда = "Корректировка ";                                                            
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_АктРаспределения") Тогда
			ОткудаКуда = "Акт распределения "+Ссылка.Отходы;
		ИначеЕсли ТипЗнч(Ссылка)=Тип("ДокументСсылка.ИНАГРО_Инвентаризация") Тогда
			ОткудаКуда = "Инвентаризация "+Ссылка.Номенклатура;
		Иначе
			Попытка
				ОткудаКуда = Ссылка.Владелец.Наименование;
			Исключение
				ОткудаКуда = Ссылка;
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат ОткудаКуда;
КонецФункции

Функция ПолучитьОткудаКудаИзШаблона(Ссылка, ВесПриход) Экспорт
	
	ОткудаКуда = "";
	
	ВыборкаПараметров = ИНАГРО_ЭлеваторЗаполнениеДокументовСервер.ПолучитьПараметрыВидовДокументов("ИмяПоМетаданным", Ссылка.Метаданные().Имя); 
	Если ВыборкаПараметров <> Справочники.ИНАГРО_ВидыДокументов.ПустаяСсылка() Тогда  
		ШаблонОписаниеДвиженияФормы36 = ВыборкаПараметров.ШаблонОписаниеДвиженияФормы36;
		СтруктураШаблоновОписанияДвиженияФормы36 = ПолучитьШаблоныОписанияДвиженияФормы36(ШаблонОписаниеДвиженияФормы36);
		ОбщийШаблон 	= СтруктураШаблоновОписанияДвиженияФормы36.ОбщийШаблон;
		ШаблонПоПриходу = СтруктураШаблоновОписанияДвиженияФормы36.ШаблонПоПриходу;
		ШаблонПоРасходу = СтруктураШаблоновОписанияДвиженияФормы36.ШаблонПоРасходу;
		
		ШаблонОписаниеДвиженияФормы36_ = "";
		Если СтруктураШаблоновОписанияДвиженияФормы36.ИспользоватьОбщийШаблон Тогда
			ШаблонОписаниеДвиженияФормы36_ = ОбщийШаблон;
		Иначе
			Если ВесПриход = 0 Тогда
				ШаблонОписаниеДвиженияФормы36_ = ШаблонПоРасходу;
			Иначе
				ШаблонОписаниеДвиженияФормы36_ = ШаблонПоПриходу;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ СокрЛП(ШаблонОписаниеДвиженияФормы36) = "" Тогда
			
			Стр = СтрЗаменить(ШаблонОписаниеДвиженияФормы36_,"[", """+Ссылка.");
			Стр = СтрЗаменить(Стр,"]", "+""");
			Стр = "ОткудаКуда = """ + Стр + """";
			Выполнить(Стр);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОткудаКуда;
	
КонецФункции

Функция ПолучитьШаблоныОписанияДвиженияФормы36(ШаблонОписаниеДвиженияФормы36) Экспорт
	
	СтруктураШаблоновОписанияДвиженияФормы36 = Новый Структура("ИспользоватьОбщийШаблон, ОбщийШаблон, ШаблонПоПриходу, ШаблонПоРасходу", Истина, "", "", "");
	
	Для Счетчик = 1 по СтрЧислоСтрок(ШаблонОписаниеДвиженияФормы36) Цикл
		
		ТекСтрока = СтрПолучитьСтроку(ШаблонОписаниеДвиженияФормы36, Счетчик);
		Префикс = Лев(ТекСтрока,2);
		Если Префикс = "@+" Тогда
			СтруктураШаблоновОписанияДвиженияФормы36.ШаблонПоПриходу = СокрЛП(Прав(ТекСтрока, СтрДлина(ТекСтрока) - 2));
			СтруктураШаблоновОписанияДвиженияФормы36.ИспользоватьОбщийШаблон = Ложь;
		ИначеЕсли Префикс = "@-" Тогда
			СтруктураШаблоновОписанияДвиженияФормы36.ШаблонПоРасходу = СокрЛП(Прав(ТекСтрока, СтрДлина(ТекСтрока) - 2));
			СтруктураШаблоновОписанияДвиженияФормы36.ИспользоватьОбщийШаблон = Ложь;
		Иначе
			СтруктураШаблоновОписанияДвиженияФормы36.ОбщийШаблон = ТекСтрока;
			СтруктураШаблоновОписанияДвиженияФормы36.ИспользоватьОбщийШаблон = Истина;
		КонецЕсли;
		
	КонецЦикла;	
	
	Возврат СтруктураШаблоновОписанияДвиженияФормы36;
	
КонецФункции

#КонецЕсли