#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если РеквизитФормыВЗначение("Объект").ЭтоНовый() Тогда
						
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Ввод новых документов ""Реестр договоров контрагентов"" запрещен!';uk='Введення нових документів ""Реєстр договорів контрагентів"" заборонене!'");
		Сообщение.Сообщить();
		
		Отказ = Истина;
		
		Возврат;
			
	КонецЕсли;
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

#КонецОбласти