#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка,Макет)
	
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");

	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ДокументРезультат.АвтоМасштаб = Истина;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	НастройкиОтчета = КомпоновщикНастроек.ПолучитьНастройки();
	
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,НастройкиОтчета,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений")); 
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ДанныеОтчета = Новый ДеревоЗначений;
	ПроцессорВывода.УстановитьОбъект(ДанныеОтчета);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Макет = ПолучитьМакет("Макет");
	
	СтандартнаяОбработка = Ложь;
	                                                              
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСтроки = Макет.ПолучитьОбласть("Строки");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ПериодОтчета = МакетКомпоновкиДанных.ЗначенияПараметров.ДатаКон.Значение;
	Для Каждого ДанныеОтчетаОрганизации Из ДанныеОтчета.Строки Цикл
		Для Каждого ДанныеОтчета Из ДанныеОтчетаОрганизации.Строки Цикл

		ОбластьШапка.Параметры.Заполнить(ДанныеОтчета);
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(ДанныеОтчета.Организация,Период);
		
		// Получаем наименования органа социальной защиты
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КодыОрганизацииСрезПоследних.Организация,
		|	КодыОрганизацииСрезПоследних.ИНАГРО_ОрганСоциальнойЗащитыНаселения КАК ОрганСоциальнойЗащитыНаселения
		|ИЗ
		|	РегистрСведений.КодыОрганизации.СрезПоследних(&Период, ) КАК КодыОрганизацииСрезПоследних
		|ГДЕ
		|	КодыОрганизацииСрезПоследних.Организация = &Организация";
		
		Запрос.УстановитьПараметр("Организация",ДанныеОтчета.Организация);
		Запрос.УстановитьПараметр("Период",ПериодОтчета);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();		
		
		ОбластьШапка.Параметры.Организация = ДанныеОтчета.Организация.НаименованиеПолное;                                         
		ОбластьШапка.Параметры.ОрганСоциальнойЗащитыНаселения = РезультатЗапроса.ОрганСоциальнойЗащитыНаселения;
		ОбластьШапка.Параметры.Период =	ПериодОтчета;
		ДокументРезультат.Вывести(ОбластьШапка);
		Для Каждого ДанныеСтроки Из ДанныеОтчета.Строки Цикл
			ОбластьСтроки.Параметры.Заполнить(ДанныеСтроки);
			ДокументРезультат.Вывести(ОбластьСтроки);
		КонецЦикла;
			
		ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(ДанныеОтчета.Организация, Период);
		ОбластьПодвал.Параметры.Руководитель = ОтветственныеЛица.Руководитель;
		ОбластьПодвал.Параметры.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтер;
		ДокументРезультат.Вывести(ОбластьПодвал);
		
		ДокументРезультат.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла
	КонецЦикла; 

КонецПроцедуры	

#КонецОбласти

#КонецЕсли