//////////////////////////////////////////////////////////////////////////////////
//// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура - обработчик события "ОбработкаЗаполнения".
//
Процедура ОбработкаЗаполнения(Основание)

	Если ТипЗнч(Основание) = Тип("СправочникСсылка.ОбъектыСтроительства") Тогда
		
		// Заполнение шапки
		Наименование       = Основание.Наименование;
		НаименованиеПолное = Основание.Наименование;
		
	ИначеЕсли ТипЗнч(Основание) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		// Заполнение шапки
		Наименование       = Основание.Наименование;
		НаименованиеПолное = Основание.НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты) // ИНАГРО
	
	Если НЕ ЭтоГруппа Тогда
		Если Автотранспорт И НЕ ЗначениеЗаполнено(Модель) Тогда
			СтрокаСообщения = НСтр("ru='Не заполнено значение реквизита Модель автотранспорта';uk='Не заповнене значення реквізиту Модель автотранспорту'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрокаСообщения, , "Объект.Модель", , Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;    

КонецПроцедуры
