#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    СтруктураВозврат =  Параметры.ЗначенияЗаполнения;
    ЗаполнитьЗначенияСвойств(ЭтаФорма,Параметры.ЗначенияЗаполнения);
    УстановитьВидимостьДоступность();

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКоманд
	 
&НаКлиенте
Процедура ЗакрытьИСформировать(Команда)
    
    ЗаполнитьЗначенияСвойств(СтруктураВозврат,ЭтаФорма);
    Оповестить("СменаОтборовОтчета",СтруктураВозврат);

    Закрыть();
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Процедура УстановитьВидимостьДоступность()
    
    Элементы.УсловноеСписание.Видимость         =  ВидФормы = "РеестрДвиженийЗернаПоВладельцам";
    Элементы.ПоказыватьДокументы.Доступность    =  НЕ ВидФормы = "Форма37Общая";

КонецПроцедуры
 
#КонецОбласти 
