
//-----------------------------------
//Дополняет передаваемую строку Стр символами Чем до строки длиной Длина
//справа или слева в зависимости от значения переменной Режим  (1-слева, 2-справа)
Функция ДополнитьСтрокуСимволами(Стр,Чем,Длина,Режим=1) //Экспорт
	Добавить=Длина-СтрДлина(Стр);
	Если Добавить>0  Тогда
		Добавок="";
		Для Сч = 1 По Добавить  Цикл
			Добавок=Добавок+Чем
		КонецЦикла;
		Возврат ?(Режим=1,Добавок+Стр,Стр+Добавок);
	Иначе
		Возврат	Стр;
	КонецЕсли;
КонецФункции

//-----------------------------------
// Функция ПреобразоватьТипXML из Модуля отчета Отчеты.РегламентированныйОтчетМастерВыгрузкиРегламентированнойОтчетности
// Необходимо:
// Найти
// Результат = СтрЗаменить(Значение, " ", "");
// Заменить на
// Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
Функция ПреобразоватьТипXMLОбщий(Значение,Тип,Результат,ОписаниеОшибки = "") 
	
	фОбработано = 1;
	                      
	Если    (ВРег(Тип) = ВРег("DGkzep0")) //!--Загальний тип "код послуги згідно з Класифікацією зовнішньоекономічних послуг" КЗЕП, або 0 -->
		ИЛИ (ВРег(Тип) = ВРег("DGkzep0Column"))Тогда
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СокрЛП(Значение);
		Иначе
			Результат = СокрЛП(Значение);
		КонецЕсли;			
		
		Попытка
			Если (Результат = "0") Тогда
				// это допустимо
			Иначе
				Симв1 = Сред(Результат, 1, 1);Симв1 = ?(Найти("0123456789",Симв1) > 0,"Ц", ?(Найти("abcd",Симв1) > 0,"Б", ?(Симв1 = "." ,"Т", ?(Симв1 = "" ,"", 1/0))));
				Симв2 = Сред(Результат, 2, 1);Симв2 = ?(Найти("0123456789",Симв2) > 0,"Ц", ?(Найти("abcd",Симв2) > 0,"Б", ?(Симв2 = "." ,"Т", ?(Симв2 = "" ,"", 1/0))));
				Симв3 = Сред(Результат, 3, 1);Симв3 = ?(Найти("0123456789",Симв3) > 0,"Ц", ?(Найти("abcd",Симв3) > 0,"Б", ?(Симв3 = "." ,"Т", ?(Симв3 = "" ,"", 1/0))));
				Симв4 = Сред(Результат, 4, 1);Симв4 = ?(Найти("0123456789",Симв4) > 0,"Ц", ?(Найти("abcd",Симв4) > 0,"Б", ?(Симв4 = "." ,"Т", ?(Симв4 = "" ,"", 1/0))));
				Симв5 = Сред(Результат, 5, 1);Симв5 = ?(Найти("0123456789",Симв5) > 0,"Ц", ?(Найти("abcd",Симв5) > 0,"Б", ?(Симв5 = "." ,"Т", ?(Симв5 = "" ,"", 1/0))));
				Симв6 = Сред(Результат, 6, 1);Симв6 = ?(Найти("0123456789",Симв6) > 0,"Ц", ?(Найти("abcd",Симв6) > 0,"Б", ?(Симв6 = "." ,"Т", ?(Симв6 = "" ,"", 1/0))));
				Симв7 = Сред(Результат, 7, 1);Симв7 = ?(Найти("0123456789",Симв7) > 0,"Ц", ?(Найти("abcd",Симв7) > 0,"Б", ?(Симв7 = "." ,"Т", ?(Симв7 = "" ,"", 1/0))));
				Симв8 = Сред(Результат, 8, 1);Симв8 = ?(Найти("0123456789",Симв8) > 0,"Ц", ?(Найти("abcd",Симв8) > 0,"Б", ?(Симв8 = "." ,"Т", ?(Симв8 = "" ,"", 1/0))));
				Симв9 = Сред(Результат, 9, 1);Симв9 = ?(Найти("0123456789",Симв9) > 0,"Ц", ?(Найти("abcd",Симв9) > 0,"Б", ?(Симв9 = "." ,"Т", ?(Симв9 = "" ,"", 1/0))));
				Симв10= Сред(Результат, 10,1);Симв10 = ?(Найти("0123456789",Симв10) > 0,"Ц", ?(Найти("abcd",Симв10) > 0,"Б", ?(Симв10 = "." ,"Т", ?(Симв10 = "" ,"", 1/0))));
				
				Если (Симв1 <> "Ц") ИЛИ (Симв2 <> "Ц") ИЛИ (Симв3 = "Т") ИЛИ (Симв4 <> "Ц") ИЛИ (Симв5 <> "Ц") Тогда
					ОписаниеОшибки = "Значение не является кодом услуг КЗЕП или нулем";					
				Иначе
					Если Симв6 = "Б" Тогда
					    Если Симв7 = "" Тогда
							//это допустимо
						Иначе
							Если (Симв7 <> "Т") ИЛИ (Симв8 <> "Ц") ИЛИ (Симв9 = "Ц") Тогда
								ОписаниеОшибки = "Значение не является кодом услуг КЗЕП или нулем";											
							ИначеЕсли (Симв10 <> "Б") ИЛИ (Симв10 <> "") Тогда
								ОписаниеОшибки = "Значение не является кодом услуг КЗЕП или нулем";
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли Симв6 = "" Тогда
						// это допустимо
					Иначе
						Если (Симв6 <> "Т") ИЛИ (Симв7 <> "Ц") ИЛИ (Симв8 = "Ц") Тогда
							ОписаниеОшибки = "Значение не является кодом услуг КЗЕП или нулем";											
						ИначеЕсли (Симв9 <> "Б") ИЛИ (Симв9 <> "") Тогда
							ОписаниеОшибки = "Значение не является кодом услуг КЗЕП или нулем";
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является кодом услуг КЗЕП или нулем";
		КонецПопытки;		
	ИначеЕсли   (ВРег(Тип) = ВРег("DGKod")) //!-- тип "Код контрольованої операції  3 знаки число з ведучими нулями -->
		ИЛИ (ВРег(Тип) = ВРег("KodColumn")) 
		ИЛИ (ВРег(Тип) = ВРег("Kod0Column")) 
		ИЛИ (ВРег(Тип) = ВРег("DGKod0")) 
		ИЛИ (ВРег(Тип) = ВРег("DKPP0Column")) Тогда
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СокрЛП(Значение);
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=3; ЧДЦ=0; ЧВН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Значение);
		КонецЕсли;			
		
		Попытка
			Контроль = Число(Результат);
			Если  (ВРег(Тип) = ВРег("DGKod0")) И (Результат = "0") Тогда
				// это допустимо
			ИначеЕсли  (ВРег(Тип) = ВРег("Kod0Column")) И (Результат = "0") Тогда
				// это допустимо
			ИначеЕсли СтрДлина(Результат) <> 3 Тогда
				Если (ВРег(Тип) = ВРег("DGKod0")) ИЛИ  (ВРег(Тип) = ВРег("DKPP0Column"))  Тогда
				    ОписаниеОшибки = "Значение не является числом от 000 до 999 с ведущими нулями или нулем";
				Иначе	
					ОписаниеОшибки = "Значение не является числом от 000 до 999 с ведущими нулями";
				КонецЕсли;
				
			КонецЕсли;
		Исключение
			Если (ВРег(Тип) = ВРег("DGKod0")) Тогда
			    ОписаниеОшибки = "Значение не является числом от 000 до 999 с ведущими нулями или нулем";
			Иначе	
				ОписаниеОшибки = "Значение не является числом от 000 до 999 с ведущими нулями";
			КонецЕсли;
		КонецПопытки;		
	ИначеЕсли   (ВРег(Тип) = ВРег("DGStatus")) //!--тип "статус особи - сторони контрольованої операції залежно від країни реєстрації: "резидент" - позначка "Р", "нерезидент" - позначка "Н""-->
		    ИЛИ (ВРег(Тип) = ВРег("StatusColumn")) Тогда
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = ВРЕГ(СокрЛП(Значение));
		Иначе
			Результат = ВРЕГ(СокрЛП(Значение));
		КонецЕсли;			
		
		Попытка
			Если (Результат = "Р") ИЛИ  (Результат = "Н") Тогда
				// это допустимо
			ИначеЕсли СтрДлина(Результат) <> 3 Тогда
				ОписаниеОшибки = "Значением может быть только символ ""Н"" или ""Р""";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значением может быть только символ ""Н"" или ""Р""";
		КонецПопытки;			
	ИначеЕсли  (ВРег(Тип) = ВРег("DGKontrOp"))
		   ИЛИ (ВРег(Тип) = ВРег("KodOpColumn")) Тогда //!--Загальний тип колонки таблиці контрольованої операції 1,2 ,3-->
		   
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = ВРЕГ(СокрЛП(Значение));
		Иначе
			Результат = ВРЕГ(СокрЛП(Значение));
		КонецЕсли;			
		
		Попытка
			Если (Результат = "0") ИЛИ  (Результат = "1") ИЛИ  (Результат = "3") Тогда
				// это допустимо
			ИначеЕсли СтрДлина(Результат) <> 3 Тогда
				ОписаниеОшибки = "Значением может быть только символ ""1"" или ""2"" или ""3""";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значением может быть только символ ""1"" или ""2"" или ""3""";
		КонецПопытки;		
	ИначеЕсли ВРег(Тип) = ВРег("DGMonth") 
	 ИЛИ ВРег(Тип) = ВРег("MonthColumn")
	 ИЛИ ВРег(Тип) = ВРег("DGMonth0") Тогда
	 
		 //<!--Загальний тип "Місяць"-->
		//<!--Загальний тип "Місяць в колонці"-->
		Если НЕ ЗначениеЗаполнено(Значение)
			ИЛИ Значение = "0" Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СокрЛП(Значение);
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=2; ЧДЦ=0; ЧГ=0");
		ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
			Результат = Месяц(Значение);
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;			
		
		Попытка
			Контроль = Число(Результат);
			Если ВРег(Тип) = ВРег("DGMonth0") Тогда
				МинЗнач = 0;
			Иначе
				МинЗнач = 1;
			КонецЕсли;
			
			Если    Найти(Результат, ".") > 0
				ИЛИ	Контроль < МинЗнач 
				ИЛИ Контроль > 12
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от "+МинЗнач+" до 12 (номер месяца)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от "+МинЗнач+" до 12 (номер месяца)";
		КонецПопытки;
	ИначеЕсли ВРег(Тип) = ВРег("DG0Month") Тогда
	 
		//<!-- Загальний тип "Місяц з нолем на початку"
		Если НЕ ЗначениеЗаполнено(Значение)
			ИЛИ Значение = "0" Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СокрЛП(Значение);
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=0");
		ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
			Результат = Формат(Месяц(Значение), "ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;			
		
		Попытка
			Контроль = Число(Результат);
			МинЗнач = 1;
			
			Если    Найти(Результат, ".") > 0
				ИЛИ	Контроль < МинЗнач 
				ИЛИ Контроль > 12
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от "+МинЗнач+" до 12 (номер месяца)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от "+МинЗнач+" до 12 (номер месяца)";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGPType") Тогда
		
		// тип периода, значение от 1 до 5
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		Результат = СокрЛП(Формат(Значение,"ЧЦ=1; ЧДЦ=0"));
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 5
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 5 (код периода)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 5 (код периода)";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGSTAN") 
		ИЛИ ВРег(Тип) = ВРег("TOColumn") Тогда
		
		//<!--Загальний тип "Код Стан документа (1, 2, 3) (1-звітний документ 2-новий звітний документ 3-уточнюючий документ)"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		Результат = СокрЛП(Формат(Значение,"ЧЦ=1; ЧДЦ=0"));
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 3
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 3 (1-звітний документ 2-новий звітний документ 3-уточнюючий документ)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 3 (1-звітний документ 2-новий звітний документ 3-уточнюючий документ)";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGsti") Тогда
		//<!--Загальний тип "Код ДПІ, використовується для обмеження коду області"-->
		// число, от 1 до 99
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Формат(Значение,"ЧЦ=2; ЧДЦ=0"));

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 99
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 99 (код ГНИ)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 99 (код ГНИ)";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGreg")
		  ИЛИ ВРег(Тип) = ВРег("RegColumn") Тогда
		//<!--Загальний тип "Код номера області"--> (1...29)
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Формат(Значение,"ЧЦ=2; ЧДЦ=0"));
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 29
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 29 (код номера области)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 29 (код номера области)";
		КонецПопытки;
		
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHKOPFG")  Тогда
		//<!--Загальний тип "Код ОПФГ"--> (100...995)
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Формат(Значение,"ЧЦ=3; ЧДЦ=0"));
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 100 
				ИЛИ Контроль > 995
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 100 до 995 (код ОПФГ)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 100 до 995 (код ОПФГ)";
		КонецПопытки;
		
		
	ИначеЕсли (ВРег(Тип) = ВРег("I8Column")) 
		  ИЛИ (ВРег(Тип) = ВРег("DGI8")) Тогда
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 10000000 
				ИЛИ Контроль > 99999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 10000000 до 99999999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 10000000 до 99999999";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGI7nomColumn")) 
		  ИЛИ (ВРег(Тип) = ВРег("DGI7nom")) Тогда
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 9999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 9999999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 9999999";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGInomColumn")) 
		  ИЛИ (ВРег(Тип) = ВРег("DGInom")) Тогда
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("IntColumn") Тогда
		//<!--Загальний тип "Цілі дані"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом";
		КонецПопытки;
		
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGLong12")) 
		  ИЛИ (ВРег(Тип) = ВРег("DGLong12Column")) 
		  ИЛИ (ВРег(Тип) = ВРег("DGHNPDV")) 
		  ИЛИ (ВРег(Тип) = ВРег("DGHIPN")) 
		  ИЛИ (ВРег(Тип) = ВРег("IndTaxNumColumn")) Тогда
		  
		//<!--Загальний тип "Індивідуальний податковий номер "-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1000 
				ИЛИ Контроль > 999999999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1000 до 999999999999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1000 до 999999999999";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGI2i")) Тогда
		
		//<!--Загальний тип "Число від 0 до 99"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 99
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 0 до 99";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 0 до 99";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGI3i")) Тогда
		
		//<!--Загальний тип "Число від 0 до 999"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 0 до 999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 0 до 999";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGI3nom")) 
		  ИЛИ (ВРег(Тип) = ВРег("DGI3nomColumn"))  Тогда
		
		//<!--Загальний тип "Число від 1 до 999"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 999";
		КонецПопытки;
		
	ИначеЕсли  (ВРег(Тип) = ВРег("DGI4nomColumn")) 
		   ИЛИ (ВРег(Тип) = ВРег("DGI4nom")) Тогда
		
		//<!--Загальний тип колонки таблиці "Число від 1 до ... 9999" [номер філії, кількість, №рядка]-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			//Результат = "&НеЗаписывать";
			Результат = "&ПустоеЗначение";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Если Результат = "&НеЗаписывать" Тогда
			Возврат 1;
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 9999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 9999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 9999";
		КонецПопытки;
		
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGI5i")) Тогда
		
		//<!--Загальний тип "Число від 1000 до 99999"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1000 
				ИЛИ Контроль > 99999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1000 до 99999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1000 до 99999";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGDate")	
		ИЛИ ВРег(Тип) = ВРег("DGHDDGVSD")
		ИЛИ ВРег(Тип) = ВРег("DGHDDGVUM")
		ИЛИ ВРег(Тип) = ВРег("DateColumn") Тогда
		//<!--Загальний тип "Дата у форматі ддммрррр"--> 
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
			Результат = Формат(Значение,"ДФ=ddMMyyyy");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Попытка
			Контроль = Дата("" + Сред(Результат,5,4) + Сред(Результат,3,2) + Сред(Результат,1,2));
			Если    СтрДлина(Результат) <> 8 
				ИЛИ Контроль < '19000101' Тогда
				ОписаниеОшибки = "Значение не является датой (после 1900 года)";	
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является датой";
		КонецПопытки;			
		
	ИначеЕсли ВРег(Тип) = ВРег("DGMonthYear")	
		ИЛИ ВРег(Тип) = ВРег("DGMonthYearColumn") Тогда
		//<!--Загальний тип "Місяц і рік"-->
		//<xs:length value="6"/>
		//<xs:pattern value="(((0[1-9])|(1[0-2]))(20)\d{2})"/>
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
			Результат = Формат(Значение,"ДФ=MMyyyy");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Попытка
			Контроль = Дата("" + Сред(Результат,3,4) + Сред(Результат,1,2) + "01");
			Если СтрДлина(Результат) <> 8 Тогда
				ОписаниеОшибки = "Значение не является месяцем и годом (в формате ММГГГГ)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является месяцем и годом (в формате ММГГГГ)";
		КонецПопытки;			
		
	ИначеЕсли ВРег(Тип) = ВРег("DGDateEndKv") Тогда
		//<!--Загальний тип Дата кінець квартала у форматі ддммрррр"
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Дата") Тогда
			Результат = Формат(Значение,"ДФ=ddMMyyyy");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Попытка
			Контроль = Дата("" + Сред(Результат,5,4) + Сред(Результат,3,2) + Сред(Результат,1,2));
			Если КонецДня(Контроль) <> КонецКвартала(Контроль) Тогда
				ОписаниеОшибки = "Дата не является концом квартала";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является датой";
		КонецПопытки;			
		
	ИначеЕсли ВРег(Тип) = ВРег("DGchk") 
		  ИЛИ ВРег(Тип) = ВРег("ChkColumn") Тогда
		//чекбокс
		//<!--Загальний тип "Ознака"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение) = Тип("Булево") Тогда
			Если Значение Тогда
				Результат = 1;
			Иначе
				Результат = "&НеЗаписывать";
				Возврат 1;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Если Значение = 1 Тогда
				Результат = 1;
			Иначе
				Результат = "&НеЗаписывать";
				Возврат 1;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = 1;
		Иначе
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGint2") Тогда
		//<!--Загальний тип "2 значне ціле додатне число"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",2,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 99
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым двузначным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым двузначным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGint3") Тогда
		//<!--Загальний тип "3 значне ціле додатне число"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",3,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым трехзначным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым трехзначным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGint5") Тогда
		//<!--Загальний тип "5 значне ціле додатне число"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",5,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 99999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым пятизначным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым пятизначным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKOATUU") 
		 ИЛИ ВРег(Тип) = ВРег("KOATUUColumn") 
		Тогда
		//<!--Загальний тип "Код КОАТУУ (9-10 знаків)"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=10; ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",10,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 9999999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является 9-и или 10-и значным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является 9-и или 10-и значным числом";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("xs:string"))
		  ИЛИ (ВРег(Тип) = ВРег("DGHNDGVUM"))
		  ИЛИ (ВРег(Тип) = ВРег("StrColumn"))
		  ИЛИ (ВРег(Тип) = ВРег("DGdkpp0"))Тогда
		  
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGstring")) Тогда
		  
		Результат = Строка(Значение);
	
	ИначеЕсли (ВРег(Тип) = ВРег("DGHNAME"))
		  ИЛИ (ВРег(Тип) = ВРег("DGHLOC"))
		  ИЛИ (ВРег(Тип) = ВРег("DGLOC"))
		  ИЛИ (ВРег(Тип) = ВРег("DGHSTI")) Тогда
		  
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе
			Результат = СокрП(Строка(Значение));
		КонецЕсли;
		
		Контроль = СтрДлина(Результат);
		Если Контроль = 0 Тогда
		
			ОписаниеОшибки = "Значение должно содержать хотя бы один символ";	
		
		КонецЕсли;
		
		
	ИначеЕсли (ВРег(Тип) = ВРег("xs:decimal"))  
		  ИЛИ (ВРег(Тип) = ВРег("DecimalColumn")) Тогда
		// десятичная дробь
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
		Исключение
			ОписаниеОшибки = "Значение не является числом";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("xs:int"))
		  ИЛИ (ВРег(Тип) = ВРег("xs:integer")) Тогда
		
		//это показатели, имеющие целый тип, и значение лежащее в определенном диапазоне,
		//но сам показатель может не заполняться. 
		//Проблема: невозможно опеределить показатель равен нулю или "не заполнялся" если он числового типа. 
		//Поэтому, делаем такое предположение:
		//если в обработку передан показатель типа "Число" - он будет записан в выходной файл.
		//если тип = "Строка", показатель будет преобразован к числу и записан только если он не пуст.
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Если ПустаяСтрока(Значение) Тогда
				Результат = "&НеЗаписывать";
				Возврат 1;
			КонецЕсли;
			Попытка
				Результат = Формат(Число(Значение),"ЧДЦ=0; ЧГ=0");
			Исключение
				ОписаниеОшибки = "Значение не является целым числом";
				Результат = "&НеЗаписывать";
				Возврат 1;
			КонецПопытки
		Иначе
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");	
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если  Найти(Результат, ".") > 0
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом";
		КонецПопытки;			
		
	ИначеЕсли ВРег(Тип) = ВРег("xs:nonNegativeInteger")
		  ИЛИ ВРег(Тип) = ВРег("IntNegativeColumn")Тогда
		// целое, больше равно(?) нулю
		
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Если ПустаяСтрока(Значение) Тогда
				Результат = "&НеЗаписывать";
				Возврат 1;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение, "ЧДЦ=0; ЧН=0; ЧГ=0");				
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым, неотрицательным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым, неотрицательным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("xs:unsignedInt") Тогда
		// целое, больше равно(?) нулю
		
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Если ПустаяСтрока(Значение) Тогда
				Результат = "&НеЗаписывать";
				Возврат 1;
			КонецЕсли;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение, "ЧДЦ=0; ЧН=0; ЧГ=0");				
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым, неотрицательным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым, неотрицательным числом";
		КонецПопытки;
		
		
		
	ИначеЕсли ВРег(Тип) = ВРег("DGOdoh")
		 ИЛИ  ВРег(Тип) = ВРег("OdohColumn")
		 ИЛИ  ВРег(Тип) = ВРег("DGOsp")
		 ИЛИ  ВРег(Тип) = ВРег("OspColumn")
		 ИЛИ  ВРег(Тип) = ВРег("DGOzn12")
		 ИЛИ  ВРег(Тип) = ВРег("Ozn2Column")
		 ИЛИ  ВРег(Тип) = ВРег("DGI2inom")
		 ИЛИ  ВРег(Тип) = ВРег("I2inomColumn")
		 
		 ИЛИ  ВРег(Тип) = ВРег("DGI1nomColumn")
		 ИЛИ  ВРег(Тип) = ВРег("DGI1nom")
		 ИЛИ  ВРег(Тип) = ВРег("DGI1inom")
		 
		 Тогда	
		//DGOdoh  Загальний тип "Ознака доходу від 1 до 66 для ДРФО"-->
		//DGOsp   Загальний тип "Код від 1 до 4 знаків ДРФО, ознака типу документа для Реєстра накладних"--> 
		//DGOzn12 Загальний тип "Код 1/2 для ДРФО"-->
		 
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если 	 ВРег(Тип) = ВРег("DGOdoh")
				 ИЛИ  ВРег(Тип) = ВРег("OdohColumn") Тогда
				МаксЗнач = 66;
			ИначеЕсли  ВРег(Тип) = ВРег("DGOsp")
				  ИЛИ  ВРег(Тип) = ВРег("OspColumn") Тогда
				МаксЗнач = 4;				 
			ИначеЕсли ВРег(Тип) = ВРег("DGOzn12")
				  ИЛИ  ВРег(Тип) = ВРег("Ozn2Column") Тогда
				МаксЗнач = 2;  
			ИначеЕсли ВРег(Тип) = ВРЕГ("I2inomColumn")
				ИЛИ  ВРег(Тип) = ВРег("DGI2inom") Тогда
				МаксЗнач = 99;  	
			ИначеЕсли ВРег(Тип) = ВРЕГ("DGI1nomColumn")
				ИЛИ  ВРег(Тип) = ВРег("DGI1nomColumn")
				ИЛИ  ВРег(Тип) = ВРег("DGI1inom")Тогда
				МаксЗнач = 9;  	
			КонецЕсли;
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > МаксЗнач
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до "+МаксЗнач;
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом!";
		КонецПопытки;

	ИначеЕсли ВРег(Тип) = ВРег("DGOzn")
		  ИЛИ ВРег(Тип) = ВРег("OznColumn") Тогда
		//<!--Загальний тип "Код 0/1 для ДРФО"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "0";
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Если Результат = "Ч" Тогда
			Результат = "1";	
		ИначеЕсли Результат = "Ж" Тогда
			Результат = "0";
		КонецЕсли;
		
		Если Результат = "&НеЗаписывать" Тогда
			Возврат 1;
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 1
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 0 до 1";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом!";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGCodPilg") 
		  ИЛИ ВРег(Тип) = ВРег("CodPilgColumn") Тогда
		//<!--Загальний тип "Код пільги (8 знаків)"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=8; ЧДЦ=0; ЧРД=.; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",8,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 99999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым восьмизначным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым восьмизначным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGmfo")
		ИЛИ  ВРег(Тип) = ВРег("MfoColumn") Тогда
		//<!--Загальний тип "Код МФО (6 знаків)"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=6; ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",6,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым шестизначным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым шестизначным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGTn-Zed")
		  ИЛИ ВРег(Тип) = ВРег("Tn-ZedColumn") Тогда
		//<!--Загальний тип "Код транспортного засобу (10 знаків)" с 11/12/2008-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=10; ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",10,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 9999999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым десятизначным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым десятизначным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGUKTZED")
		  ИЛИ ВРег(Тип) = ВРег("UKTZEDColumn") Тогда
		//<!--Загальний тип "Код зовнішньоекономічної діяльності"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение," ","");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СОКРЛП(Результат);
		
		Длина = СтрДлина(Результат);
		Если  Длина <> 4
			И Длина <> 6 
			И Длина <> 5 
			И Длина <> 8 
			И Длина <> 10 
			И Результат <> "0" Тогда
			
			ОписаниеОшибки = "Значение не является набором цифр (4, 5, 6, 8 или 10-и значным) или нулем";
			
		Иначе
			
			Для Сч = 1  По Длина Цикл
				Если Найти("0123456789", Сред(Результат, Сч, 1)) = 0 Тогда
					// есть не цифра
					ОписаниеОшибки = "Значение не является набором цифр (4, 5, 6, 8 или 10-и значным) или нулем";
				    Прервать;
				КонецЕсли;
			КонецЦикла;
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGDKPP")
		  ИЛИ ВРег(Тип) = ВРег("DKPPColumn") Тогда
		//<!--				Загальний тип "Код послуги згідно з Державним класифікатором продукції та послуг" 
        //          формат значення XX.XX.XX-XX.XX
        //         Приклади правильних кодів:
        //          11.22  11.22.3  11.22.33  11.22.33-4  11.22.33-44  11.22.33-44.5 11.22.33-44.55

		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение," ","");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=5; ЧДЦ=2; ЧРД=.; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СОКРЛП(Результат);
		
		Контроль = СтрЗаменить(Результат, "0", "_");
		Контроль = СтрЗаменить(Контроль,  "1", "_");
		Контроль = СтрЗаменить(Контроль,  "2", "_");
		Контроль = СтрЗаменить(Контроль,  "3", "_");
		Контроль = СтрЗаменить(Контроль,  "4", "_");
		Контроль = СтрЗаменить(Контроль,  "5", "_");
		Контроль = СтрЗаменить(Контроль,  "6", "_");
		Контроль = СтрЗаменить(Контроль,  "7", "_");
		Контроль = СтрЗаменить(Контроль,  "8", "_");
		Контроль = СтрЗаменить(Контроль,  "9", "_");
		Если  Контроль <> "__.__"
			И Контроль <> "__.__._"
			И Контроль <> "__.__.__"
			И Контроль <> "__.__.__-_"
			И Контроль <> "__.__.__-__"
			И Контроль <> "__.__.__-__._"
			И Контроль <> "__.__.__-__.__" Тогда
			
			ОписаниеОшибки = "Значение не является Кодом ДКПП в формате XX.XX.XX-XX.XX";
			
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGkved") 
		  ИЛИ ВРег(Тип) = ВРег("DGkvedColumn") Тогда
		  
		//<!--Загальний тип "КВЕД"-->   в формате xx.xx.x или xx.xx или xx.x
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = Значение;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=5; ЧДЦ=0; ЧГ=0");
			Результат = Сред(Результат,1,2) + "." + Сред(Результат, 3,2) + "." + Сред(Результат,5);
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;	
		
		Результат = СокрЛП(Результат);
		Если Прав(Результат ,1) = "." Тогда
			Результат = Сред(Результат, 1, СтрДлина(Результат) - 1);
		КонецЕсли;
		Результат = СокрЛП(Результат);		
		
		Цифры = "0123456789";
		Контроль = 1;
		Если СтрДлина(Результат) = 7 Тогда
			Если     Найти(Цифры, Сред(Результат, 1, 1)) = 0
				 ИЛИ Найти(Цифры, Сред(Результат, 2, 1)) = 0
				 ИЛИ "." <>       Сред(Результат, 3, 1)
				 ИЛИ Найти(Цифры, Сред(Результат, 4, 1)) = 0
				 ИЛИ Найти(Цифры, Сред(Результат, 5, 1)) = 0
				 ИЛИ "." <>       Сред(Результат, 6, 1)
				 ИЛИ Найти(Цифры, Сред(Результат, 7, 1)) = 0 Тогда
				Контроль = 0;
			КонецЕсли;	 
		ИначеЕсли СтрДлина(Результат) = 5 Тогда
			Если     Найти(Цифры, Сред(Результат, 1, 1)) = 0
				 ИЛИ Найти(Цифры, Сред(Результат, 2, 1)) = 0
				 ИЛИ "." <>       Сред(Результат, 3, 1)
				 ИЛИ Найти(Цифры, Сред(Результат, 4, 1)) = 0
				 ИЛИ Найти(Цифры, Сред(Результат, 5, 1)) = 0 Тогда
				Контроль = 0;
			КонецЕсли;	 
		ИначеЕсли СтрДлина(Результат) = 4 Тогда
			Если     Найти(Цифры, Сред(Результат, 1, 1)) = 0
				 ИЛИ Найти(Цифры, Сред(Результат, 2, 1)) = 0
				 ИЛИ "." <>       Сред(Результат, 3, 1)
				 ИЛИ Найти(Цифры, Сред(Результат, 4, 1)) = 0 Тогда
				Контроль = 0;
			КонецЕсли;	 
		Иначе	
			Контроль = 0;
		КонецЕсли;
		Если Контроль = 0 Тогда
			ОписаниеОшибки = "Значение не является кодом КВЕД (в формате: xx.xx.x или xx.xx или xx.x)"
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKv") Тогда
		//<!--Загальний тип "Квартал"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 4
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 4";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 4";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGNYear")
		   ИЛИ  ВРег(Тип) = ВРег("YearNColumn") Тогда
		//<!--Загальний тип "Рік народження"-->
		Если НЕ ЗначениеЗаполнено(Значение) 
			ИЛИ Значение = "0" Тогда 
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1900 
				ИЛИ Контроль > 2099
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1900 до 2099";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1900 до 2099";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGYear") 
		  ИЛИ ВРег(Тип) = ВРег("YearColumn") Тогда
		//<!--Загальний тип "Рік"-->
		Если НЕ ЗначениеЗаполнено(Значение) 
			ИЛИ Значение = "0" Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1991 
				ИЛИ Контроль > 2099
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1991 до 2099";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1991 до 2099";
		КонецПопытки;
		
	ИначеЕсли   ВРег(Тип) = ВРег("DGHZIP") 
	 		ИЛИ ВРег(Тип) = ВРег("ZipColumn") Тогда
		//<!--Загальний тип "Код міста"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение," ","");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		Результат = ДополнитьСтрокуСимволами(Результат,"0",5,1);
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 99999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым пятизначным числом";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым пятизначным числом";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHEMAIL") Тогда
		//<!--Загальний тип "Електронна пошта"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Контроль = 1;
		ПозицияСобачки = Найти(Результат, "@");
		Если ПозицияСобачки = 0 Тогда
			Контроль = 0;
		Иначе
			
			Если Найти(Сред(Результат, ПозицияСобачки + 1), "@") > 0 Тогда
				Контроль = 0;	
			КонецЕсли;
			
		КонецЕсли;
		
		Если Контроль = 0 Тогда
			ОписаниеОшибки = "Значение не адресом электронной почты (в формате <текст>@<текст>)";
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHTEL")
		  ИЛИ ВРег(Тип) = ВРег("DGHFAX") Тогда
		//<!--Загальний тип "Номер телефона"-->
		//<!--Загальний тип "Номер факса"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Контроль = 1;
		ДопустимыСимволы = "0 1 2 3 4 5 6 7 8 9 .,+-;()";
		Для Сч = 1 По СтрДлина(Результат) Цикл
			Если Найти(ДопустимыСимволы, Сред(Результат,Сч,1)) = 0 Тогда
				Контроль = 0;
				Прервать;
			КонецЕсли;	
		КонецЦикла;			
		
		Если Контроль = 0 Тогда
			ОписаниеОшибки = "Можно использовать только следующие символы: " + ДопустимыСимволы + "
							 |Длина должна быть более 4-х символов";
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimal0")
		  ИЛИ ВРег(Тип) = ВРег("Decimal0Column")Тогда
		//<!--Загальний тип "Числові дані 0 знаки після коми"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧН=; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		
		Попытка
			Контроль = Число(Результат);
			Если (Найти(Результат, ".") > 0 И (Найти(Результат, ".") < СтрДлина(Результат)-2))
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом до 9000000000";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом до 9000000000";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimal1")
		  ИЛИ ВРег(Тип) = ВРег("Decimal1Column")
		  ИЛИ ВРег(Тип) = ВРег("DGKODR") Тогда
		//<!--Загальний тип "Числові дані 1 знак після коми"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=1; ЧРД=.; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);

		Попытка
			Контроль = Число(Результат);
			Если   (Найти(Результат, ".") = 0 ИЛИ (Найти(Результат, ".") < СтрДлина(Результат)-2)) 
				//в схеме разрешено иметь два значащих знака после запятой...
				ИЛИ Цел(Контроль*10) <> Контроль*10 Тогда
				ОписаниеОшибки = "Значение не является числом c одним знаком после запятой";
			КонецЕсли;
			
			Если ВРег(Тип) = ВРег("DGKODR")
				И (Контроль > 99.9) Тогда
				ОписаниеОшибки = "Значение не является двузначным числом c одним знаком после запятой";	
			КонецЕсли;
			
		Исключение
			ОписаниеОшибки = "Значение не является числом c одним знаком после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimal2")
		  ИЛИ ВРег(Тип) = ВРег("Decimal2Column")
		  ИЛИ ВРег(Тип) = ВРег("DGdecimal2_P")
		  ИЛИ ВРег(Тип) = ВРег("Decimal2Column_P")
		  Тогда
		//<!--Загальний тип "Числові дані 2 знак після коми"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=2; ЧРД=.; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);

		Попытка
			Контроль = Число(Результат);
			Если    (Найти(Результат, ".") = 0 ИЛИ (Найти(Результат, ".") < СтрДлина(Результат)-2)) 
				ИЛИ Цел(Контроль*100) <> Контроль*100 Тогда
				ОписаниеОшибки = "Значение не является числом c двумя знаком после запятой";
			КонецЕсли;
			Если ВРег(Тип) = ВРег("DGdecimal2_P") ИЛИ ВРег(Тип) = ВРег("Decimal2Column_P") Тогда
				Если Контроль < 0 Тогда
					ОписаниеОшибки = "Значение не является неотрицательным числом c двумя знаком после запятой";
				КонецЕсли;
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c двумя знаком после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGpercentAlloc") Тогда
		
		//<!--Загальний тип "проценти розподілу, питома вага, числові дані, можливо з 2 знаками після коми, від 0 до 100 включно"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=2; ЧРД=.; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);

		Попытка
			Контроль = Число(Результат);
			Если   (Найти(Результат, ".") < СтрДлина(Результат)-2) 
				ИЛИ Цел(Контроль*100) <> Контроль*100 
				ИЛИ Контроль >100 Тогда
				ОписаниеОшибки = "Значение не является числом c двумя знаком после запятой меньшее 9000000000";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c двумя знаком после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimal3")
		  ИЛИ ВРег(Тип) = ВРег("Decimal3Column")Тогда
		//Загальний тип "Числові дані 3 знаки після коми
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=3; ЧРД=.; ЧГ=0");	
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		Попытка
			Контроль = Число(Результат);
			Если    (Найти(Результат, ".") = 0 ИЛИ (Найти(Результат, ".") < СтрДлина(Результат) - 3))  
				ИЛИ Цел(Контроль*1000) <> Контроль*1000 Тогда
				ОписаниеОшибки = "Значение не является числом c тремя знаками после запятой";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c тремя знаками после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimal4")
		  ИЛИ ВРег(Тип) = ВРег("Decimal4Column") Тогда
		//Загальний тип "Числові дані 4 знаки після коми
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=4; ЧРД=.; ЧГ=0");
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		Попытка
			Контроль = Число(Результат);
			Если   Найти(Результат, ".") <> СтрДлина(Результат) - 4  
				ИЛИ Цел(Контроль*10000) <> Контроль*10000 Тогда
				ОписаниеОшибки = "Значение не является числом c четырьмя знаками после запятой";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c четырьмя знаками после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimal5")
		  ИЛИ ВРег(Тип) = ВРег("Decimal5Column") Тогда
		//Загальний тип "Числові дані 5 знаки після коми
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=5; ЧРД=.; ЧГ=0");
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		Попытка
			Контроль = Число(Результат);
			Если   Найти(Результат, ".") <> СтрДлина(Результат) - 5  
				ИЛИ Цел(Контроль*100000) <> Контроль*100000 Тогда
				ОписаниеОшибки = "Значение не является числом c пятью знаками после запятой";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c пятью знаками после запятой";
		КонецПопытки;
			
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimal6")
		  ИЛИ ВРег(Тип) = ВРег("Decimal6Column")
		  ИЛИ ВРег(Тип) = ВРег("Decimal6Column_R")
		  ИЛИ ВРег(Тип) = ВРег("DGdecimal6_R")
		  Тогда
		//Загальний тип "Числові дані 6 знаки після коми
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=6; ЧРД=.; ЧГ=0");
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		Попытка
			Контроль = Число(Результат);
			Если   Найти(Результат, ".") <> СтрДлина(Результат) - 6  
				ИЛИ Цел(Контроль*1000000) <> Контроль*1000000 Тогда
				ОписаниеОшибки = "Значение не является числом c шестью знаками после запятой";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c шестью знаками после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("Decimal12Column_R")
		  ИЛИ ВРег(Тип) = ВРег("DGdecimal12_R")
		  Тогда
		//Загальний тип "Числові дані 12 знаки після коми
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=12; ЧРД=.; ЧГ=0");
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		Попытка
			Контроль = Число(Результат);
			Если   Найти(Результат, ".") <> СтрДлина(Результат) - 12  
				ИЛИ Цел(Контроль*1000000000000) <> Контроль*1000000000000 Тогда
				ОписаниеОшибки = "Значение не является числом c 12 знаками после запятой";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c 12 знаками после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGDrfo") //<!--Загальний тип "Код ДРФО фізичної особи допускається числовий код, або № паспорта"-->
		ИЛИ ВРег(Тип) = ВРег("DGLong")   //<!--Загальний тип "Код ЄДРПОУ (ДРФО підприємця: числа, або № паспорта)"-->
		ИЛИ ВРег(Тип) = ВРег("DGHTINF")  //<!--Загальний тип "Код HTINF (Ідентифікаційний номер платника згідно з ДРФО)"-->
		ИЛИ ВРег(Тип) = ВРег("DGHTINSD") //<!--Загальний тип "Код HTINSD (Реєстраційний (обліковий) номер платника )"--> 
		ИЛИ ВРег(Тип) = ВРег("TinColumn")//<!--Загальний тип "Код ЕДРПОУ(ДРФО) в колонці"-->
		ИЛИ ВРег(Тип) = ВРег("DGHKBOS")  //<!--Загальний тип "Код ДРФО директора"-->
		ИЛИ ВРег(Тип) = ВРег("DGHKBUH")  //<!--Загальний тип "Код ДРФО бухгалтера"-->
		ИЛИ ВРег(Тип) = ВРег("DGDrfo_pfu")
		ИЛИ ВРег(Тип) = ВРег("DGLong_pfu")
		ИЛИ ВРег(Тип) = ВРег("DGHTINF_pfu")
		ИЛИ ВРег(Тип) = ВРег("DGHKBOS_pfu") 
		ИЛИ ВРег(Тип) = ВРег("DGHKBUH_pfu")
		ИЛИ ВРег(Тип) = ВРег("DRFO_10Column")
		ИЛИ ВРег(Тип) = ВРег("DGDRFO_10")
		
		ИЛИ ВРег(Тип) = ВРег("DGNUMZO")
		ИЛИ ВРег(Тип) = ВРег("NumZOColumn")
		
		Тогда 
		//<xs:pattern value="([0-9]{5,10}|[АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ]{2}[0-9]{6})"/>
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = Значение;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		КонецЕсли;
		Результат = СокрЛП(Значение);
		
		Контроль = 1;
		Если Найти("0123456789", Лев(Результат,1)) > 0 Тогда
			// начинается с цифр - значит от 5 до 10
			Если    СтрДлина(Результат) < 5
				ИЛИ СтрДлина(Результат) > 10 Тогда
				Контроль = 0;	
			Иначе
				// Дополним нулями до 10 знаков только для явных кодов ДРФО: чтобы TIN (тип DGLONG) 
				// для юр.лиц не был десятизначным. С точки зрения XML это нормально, но есть некоторые внешние нестыковки
				Если (ВРег(Тип) <> ВРег("DGLong"))//<!--Загальний тип "Код ЄДРПОУ (ДРФО підприємця: числа, або № паспорта)"-->
		          И  (ВРег(Тип) <> ВРег("TinColumn"))
				  И  (ВРег(Тип) <> ВРег("DGHTINSD")) Тогда
					Результат = ДополнитьСтрокуСимволами(Результат,"0",10,1);
				КонецЕсли;				
				Для Сч = 1 По СтрДлина(Результат) Цикл
					Если Найти("0123456789", Сред(Результат,Сч,1)) = 0 Тогда
						Контроль = 0;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		Иначе
			Если    ВРег(Тип) = ВРег("DGDrfo_pfu") 
				ИЛИ ВРег(Тип) = ВРег("DGLong_pfu") 
				ИЛИ ВРег(Тип) = ВРег("DGHTINF_pfu") 
				ИЛИ ВРег(Тип) = ВРег("DGHKBOS_pfu")
				ИЛИ ВРег(Тип) = ВРег("DGHKBUH_pfu") Тогда
				// должен быть номер паспорта
				Если    СтрДлина(Результат) <> 10
					ИЛИ Сред(Результат,1,2) <> "БК"
					ИЛИ	Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,3,1)) = 0
					ИЛИ Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,4,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,5,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,6,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,7,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,8,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,9,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,10,1)) = 0 Тогда
					ОписаниеОшибки = "Неправильно указан ИНН (код по ДРФО) либо Серия и номер паспорта для физ. лица, у которого нет кода.
									 |Паспорт указывается в формате БКССНННННН (""БК"" - фиксированные символы (""без кода"") СС - серия, НННННН - номер паспорта)";
					Контроль = -1;

				КонецЕсли;
			ИначеЕсли    СтрДлина(Результат) = 8
				// должен быть номер паспорта
				И(
				        Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,1,1)) = 0
					ИЛИ Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,2,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,3,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,4,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,5,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,6,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,7,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,8,1)) = 0
				 ) Тогда
					Контроль = 0;				               
			ИначеЕсли ВРег(Тип) = ВРег("DGNUMZO")
   				  ИЛИ ВРег(Тип) = ВРег("NumZOColumn") Тогда
				  
				Если Лев(Результат, 1) = "F" Тогда
					//далее могут быть любые символы
				ИначеЕсли СтрДлина(Результат) = 9 
					И (  
					    Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",ВРЕГ(Сред(Результат,1,1))) = 0
					ИЛИ Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",ВРЕГ(Сред(Результат,2,1))) = 0 
					ИЛИ Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",ВРЕГ(Сред(Результат,3,1))) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,4,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,5,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,6,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,7,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,8,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,9,1)) = 0
					  ) Тогда
					Контроль = 0;
				ИначеЕсли СтрДлина(Результат) = 10
					И (
					    Сред(Результат,1,2) <> "БК"
					ИЛИ	Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,3,1)) = 0
					ИЛИ Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,4,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,5,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,6,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,7,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,8,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,9,1)) = 0 
					ИЛИ Найти("0123456789",Сред(Результат,10,1)) = 0
					  ) Тогда
					ОписаниеОшибки = "Неправильно указан ИНН (код по ДРФО) либо Серия и номер паспорта для физ. лица, у которого нет кода.
									 |Паспорт указывается в формате БКССНННННН (""БК"" - фиксированные символы (""без кода"") СС - серия, НННННН - номер паспорта)";
					Контроль = -1;	
				КонецЕсли;	  
			//Иначе
			//	Контроль = 0;
			КонецЕсли;
		КонецЕсли;
		
		Если Контроль = 0 Тогда
			ОписаниеОшибки = "Неправильно указан ИНН (код по ДРФО) либо Серия и номер паспорта для физ. лица, у которого нет кода.
							 |Паспорт указывается в формате ССНННННН (СС - серия, НННННН - номер паспорта)"
		КонецЕсли;
		
		Если Контроль = -1  Тогда
			Контроль = 0 	
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGPass") //<!--Загальний тип "№ паспорта" (HPASS)-->
		Тогда 
		//<xs:pattern value="[АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ]{2}[0-9]{6}"/>
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = Значение;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		КонецЕсли;
		Результат = СокрЛП(Значение);
		
		Контроль = 1;
		// должен быть номер паспорта
		Если    СтрДлина(Результат) <> 8
			ИЛИ	Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,1,1)) = 0
			ИЛИ Найти("АБВГДЕЄЖЗИІКЛМНОПРСТУФХЦЧШЩЮЯ",Сред(Результат,2,1)) = 0 
			ИЛИ Найти("0123456789",Сред(Результат,3,1)) = 0 
			ИЛИ Найти("0123456789",Сред(Результат,4,1)) = 0 
			ИЛИ Найти("0123456789",Сред(Результат,5,1)) = 0 
			ИЛИ Найти("0123456789",Сред(Результат,6,1)) = 0 
			ИЛИ Найти("0123456789",Сред(Результат,7,1)) = 0 
			ИЛИ Найти("0123456789",Сред(Результат,8,1)) = 0 Тогда
			Контроль = 0;				               
		КонецЕсли;
		
		Если Контроль = 0 Тогда
		
			ОписаниеОшибки = "Неправильно Серия и номер паспорта для физ. лица, у которого нет кода.
							 |Паспорт указывается в формате ССНННННН (СС - серия, НННННН - номер паспорта)"
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGNLong") //<!--Загальний тип "Код ЄДРПОУ (тiльки числа)"-->
		ИЛИ ВРег(Тип) = ВРег("EDRPOUColumn")//<!--Загальний тип "Код ЕДРПОУ в колонці"-->
		ИЛИ ВРег(Тип) = ВРег("DGHTINJ") //<!--Загальний тип " Код HTINJ (Ідентифікаційний код платника згідно з ЄДРПОУ)"-->
		ИЛИ ВРег(Тип) = ВРег("DGHTINNR")//<!--Загальний тип "Код HTINNR (Ідентифікаційний код представництвa нерезидента, що не має статусу юридичної особи)"--> 
		Тогда 
		//<xs:restriction base="xs:string">
		//<xs:pattern value="([0-9]{5,10})"/>
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = Значение;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		КонецЕсли;
		Результат = СокрЛП(Значение);
		// начинается с цифр - значить от 5 до 10
		Результат = ДополнитьСтрокуСимволами(Результат,"0",8,1);
		
		Контроль = 1;
		Если    СтрДлина(Результат) < 5
			ИЛИ СтрДлина(Результат) > 10 Тогда
			Контроль = 0;	
		Иначе
			Для Сч = 1 По СтрДлина(Результат) Цикл
				Если Найти("0123456789", Сред(Результат,Сч,1)) = 0 Тогда
					Контроль = 0;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	
		Если Контроль = 0 Тогда
		
			ОписаниеОшибки = "Неправильно указан код по ЕДРПОУ (допускаются только цифры от 5 до 10 символов)"
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHNDGVSD") Тогда
		//<!--Загальний тип "Код HNDGVSD (№ договору про спільну (сумісну) діяльність)"-->
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Строка(Значение));
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHNSPDV") Тогда
		//<!--Загальний тип "Код HNSPDV (номер свідоцтва про реєстрацію платника ПДВ)"-->
		//<!-- 30.12.2010 Внесено можливість вносити 0 відповідно до п.8 наказу ДПАУ від 21.12.2010 N969
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение," ","");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 9999999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 0 до 9999999999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 0 до 9999999999";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHTINUM") Тогда
		//<!--Загальний тип "Код HTINUM (податковий номер платника, що проводить управління майном)"-->
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение," ","");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Результат) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 9999999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 9999999999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 9999999999";
		КонецПопытки;
		
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHBOS")  //<!--Загальний тип "ПІБ директора"-->
		  ИЛИ ВРег(Тип) = ВРег("DGHBUH")  //<!--Загальний тип "ПІБ бухгалтера"-->
		  ИЛИ ВРег(Тип) = ВРег("DGHFO")   //<!--Загальний тип "ПІБ фізичної особи"-->
		  Тогда
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Строка(Значение));
		
		Если СтрДлина(Результат) = 0 Тогда
			ОписаниеОшибки = "Длина реквизита должна быть не менее одного символа";	
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("rowInt") Тогда
		//<!--Загальний тип атрибуту ROWNUM для вказання номеру строки в табличних даних-->
		Если ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
			ПозицияТочки = Найти(Результат, ".");
			Если ПозицияТочки > 0 Тогда
				Результат = Лев(Результат, СтрДлина(Результат) - ПозицияТочки - 1);
			КонецЕсли;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;	
		
		
	ИначеЕсли ВРег(Тип) = ВРег("DG5-10-15nmg") Тогда
		//<!--Загальний тип "5-10-15 неоподатковуваних мінімумів "-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе	
			Результат = СокрЛП(Строка(Результат));		
		КонецЕсли;
		
		Если  Результат <> "5"
			И Результат <> "10"
			И Результат <> "15" Тогда
		
			ОписаниеОшибки = "Значением может быть либо 5 либо 10 либо 15"	
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGHNUM_N") Тогда
		//<!--Загальний тип "Номер для накладної - число, слеш і літери зц"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = ВРЕГ(СокрЛП(Строка(Результат)));		
		КонецЕсли;
		
		ЕстьОшибка = Ложь;
		Контроль = Результат;
		Если Найти("0123456789", Лев(Контроль,1)) = 0 Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
		
		Если Найти(Контроль, "//") > 0 Тогда
			ЕстьОшибка = Истина;
		КонецЕсли;
		
		Если Не ЕстьОшибка Тогда
			Контроль = СтрЗаменить(Контроль, "/ЗЦ","");	
			Контроль = СтрЗаменить(Контроль, "/","");	
			Контроль = СтрЗаменить(Контроль, "0","");	
			Контроль = СтрЗаменить(Контроль, "1","");	
			Контроль = СтрЗаменить(Контроль, "2","");	
			Контроль = СтрЗаменить(Контроль, "3","");	
			Контроль = СтрЗаменить(Контроль, "4","");	
			Контроль = СтрЗаменить(Контроль, "5","");	
			Контроль = СтрЗаменить(Контроль, "6","");	
			Контроль = СтрЗаменить(Контроль, "7","");	
			Контроль = СтрЗаменить(Контроль, "8","");	
			Контроль = СтрЗаменить(Контроль, "9","");	
			Если СтрДлина(Контроль) > 0 Тогда
				ЕстьОшибка = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЕстьОшибка Тогда
		
			ОписаниеОшибки = "Номер накладной должен быть в виде числа, или в виде ""число/число"" или ""число/ЗЦ"" или ""число/число/ЗЦ"" и т. п.";			
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKodDocROVPD3_1") 
		  ИЛИ ВРег(Тип) = ВРег("KodDocROVPD3_1Column") Тогда
		  
		//<!--Загальний тип "вид(код) документа" Реєстру отриманих та виданих податкових накладних" версія 3 розділ 1
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = ВРЕГ(СокрЛП(Строка(Результат)));		
		КонецЕсли;
		
		Если  Результат <> "ПН"   И Результат <> "ПЗ"    И Результат <> "ЧКУ"
			И Результат <> "РК"   И Результат <> "ПО"    И Результат <> "ТКУ"
			И Результат <> "ВМД"  И Результат <> "ЗП"    И Результат <> "ГРУ" 
			И Результат <> "ЧК"   И Результат <> "ПНУ"   И Результат <> "ПЗУ"
			И Результат <> "ТК"   И Результат <> "РКУ"   И Результат <> "ПОУ" 
			И Результат <> "ГР"   И Результат <> "ВМДУ"  И Результат <> "ЗПУ" Тогда
		
			ОписаниеОшибки = "Значением может быть только одно из следующих: ПН, РК, ВМД, ЧК, ТК, ГР, ПЗ, ПО, ЗП, ПНУ, РКУ, ВМДУ, ЧКУ, ТКУ, ГРУ, ПЗУ, ПОУ, ЗПУ";	
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKodDocROVPD3_2") 
		  ИЛИ ВРег(Тип) = ВРег("KodDocROVPD3_2Column") Тогда
		  
		//<!--Загальний тип "вид(код) документа" Реєстру отриманих та виданих податкових накладних" версія 3 розділ 2
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = ВРЕГ(СокрЛП(Строка(Результат)));		
		КонецЕсли;
		
		Если  Результат <> "ПН"   И Результат <> "ПНУ" 
			И Результат <> "РК"   И Результат <> "РКУ" 
			И Результат <> "ВМД"  И Результат <> "ВМДУ"
			И Результат <> "ПП"   И Результат <> "ППУ"
			И Результат <> "ЗЦ"   И Результат <> "ЗЦУ" Тогда
		
			ОписаниеОшибки = "Значением может быть только одно из следующих: ПН, РК, ВМД, ПП, ЗЦ, ПНУ, РКУ, ВМДУ, ППУ, ЗЦУ";	
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKodDocROVPD5_2") 
		  ИЛИ ВРег(Тип) = ВРег("DGKodDocROVPD5_2Column") Тогда
		  
		//<!--Загальний тип "вид(код) документа" Реєстру отриманих та виданих податкових накладних" версія 5 розділ 1
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = ВРЕГ(СокрЛП(Строка(Результат)));		
		КонецЕсли;
		
		Если  Результат <> "ПН"   И Результат <> "ПЗ"    И Результат <> "ЧКУ"
			И Результат <> "РК"   И Результат <> "ПО"    И Результат <> "ТКУ"
			И Результат <> "ВМД"  И Результат <> "ЗП"    И Результат <> "ГРУ" 
			И Результат <> "ЧК"   И Результат <> "ПНУ"   И Результат <> "ПЗУ"
			И Результат <> "ТК"   И Результат <> "РКУ"   И Результат <> "ПОУ" 
			И Результат <> "ГР"   И Результат <> "ВМДУ"  И Результат <> "ЗПУ" 
			И Результат <> "НП"   И Результат <> "НПУ"
			И Результат <> "ПНР"   И Результат <> "ПЗР"    И Результат <> "ЧКРУ"
			И Результат <> "РКР"   И Результат <> "ПОР"    И Результат <> "ТКРУ"
			И Результат <> "ВМДР"  И Результат <> "ЗПР"    И Результат <> "ГРРУ" 
			И Результат <> "ЧКР"   И Результат <> "ПНРУ"   И Результат <> "ПЗРУ"
			И Результат <> "ТКР"   И Результат <> "РКРУ"   И Результат <> "ПОРУ" 
			И Результат <> "ГРР"   И Результат <> "ВМДРУ"  И Результат <> "ЗПРУ" 
			И Результат <> "НПР"   И Результат <> "НПРУ"			
			И Результат <> "БО"   И Результат <> "БОРУ"  И Результат <> "БОР" И Результат <> "БОУ"
			Тогда
		
			ОписаниеОшибки = "Значением может быть только одно из следующих: ПН, РК, ВМД, ЧК, ТК, ГР, ПЗ, ПО, ЗП, ПНУ, РКУ, ВМДУ, ЧКУ, ТКУ, ГРУ, ПЗУ, ПОУ, ЗПУ,
			|ПНР, РКР, ВМДР, ЧКР, ТКР, ГРР, ПЗР, ПОР, ЗПР, ПНРУ, РКРУ, ВМДРУ, ЧКРУ, ТКРУ, ГРРУ, ПЗРУ, ПОРУ, ЗПРУ, БОРУ,БО,БОР,БОУ";
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKodDocROVPD5_1") 
		  ИЛИ ВРег(Тип) = ВРег("DGKodDocROVPD5_1Column") Тогда
		  
		//<!--Загальний тип "вид(код) документа" Реєстру отриманих та виданих податкових накладних" версія  розділ 2
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = ВРЕГ(СокрЛП(Строка(Результат)));		
		КонецЕсли;
		
		Если  ЛЕВ(Результат,2) <> "ПН"
			И Результат <> "РК"   И Результат <> "РКУ" 
			И Результат <> "ВМД"  И Результат <> "ВМДУ"
			И Результат <> "БО"   И Результат <> "БОУ" Тогда
		
			ОписаниеОшибки = "Значением может быть только одно из следующих: ПН[01...14][У], РК, ВМД, ПП, ЗЦ, ПНУ, РКУ, ВМДУ, ППУ, ЗЦУ";	
			
		ИначеЕсли ЛЕВ(Результат,2) = "ПН" Тогда
			
			Серединка = Сред(Результат, 3);
			
			Если Прав(Серединка, 1) = "У" Тогда
				Серединка = Сред(Серединка, 1, СтрДлина(Серединка) - 1);
			КонецЕсли;
			
			Если Серединка = "" Тогда
			ИначеЕсли СтрДлина(Серединка) <> 2
				ИЛИ Найти("01", Лев(Серединка, 1)) 		   = 0
				ИЛИ Найти("0123456789", Прав(Серединка, 1)) = 0 
				ИЛИ (Лев(Серединка, 1) = "1" И Найти("01234", Прав(Серединка, 1)) = 0) Тогда
			
					ОписаниеОшибки = "Значением может быть только одно из следующих: ПН[01...14][У], РК, ВМД, ПП, ЗЦ, ПНУ, РКУ, ВМДУ, ППУ, ЗЦУ";		
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGDM")
		  ИЛИ ВРег(Тип) = ВРег("DMColumn")
		Тогда
		//<!--Загальний тип "День місяця"-->
		Если НЕ ЗначениеЗаполнено(Значение) 
			ИЛИ Значение = "0" Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 31
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 31";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 31";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKodTypeDoc6_1")
		  ИЛИ ВРег(Тип) = ВРег("DGKodTypeDoc6_1Column") Тогда
		  
		//<!--"Вид(код) документа "Розділ I. Видані податкові накладні" -->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = ВРЕГ(СокрЛП(Строка(Результат)));		
		КонецЕсли;
		
		Если  Результат <> "ПНП"  И Результат <> "ПНЕ" 
			И Результат <> "РКП"  И Результат <> "РКЕ" 
			И Результат <> "МДП"  И Результат <> "МДЕ"
			И Результат <> "БО"    Тогда
		
			ОписаниеОшибки = "Значением может быть только одно из следующих: ПНП, ПНЕ, РКП, РКЕ, МДП, МДЕ, БО";	
			
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKodDocROVPD6_2") 
		  ИЛИ ВРег(Тип) = ВРег("DGKodDocROVPD6_2Column")Тогда
		  
		//<!--Загальний тип "вид(код) документа "Розділ IІ. Отримані податкові накладні" версія документа 6--
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = ВРЕГ(СокрЛП(Строка(Результат)));		
		КонецЕсли;
		
		Если  Результат <> "ПНП"  И Результат <> "ПНЕ" 
			И Результат <> "РКП"  И Результат <> "РКЕ" 
			И Результат <> "МДП"  И Результат <> "МДЕ"
			И Результат <> "БО"  
			И Результат <> "ЧК"  И Результат <> "ТК"
			И Результат <> "ГР"  И Результат <> "ПЗ"
			И Результат <> "ПО"  И Результат <> "ЗП"
			И Результат <> "НП"
			И Результат <> "БОПНП"  И Результат <> "БОПНЕ" 
			И Результат <> "БОРКП"  И Результат <> "БОРКЕ" 
			И Результат <> "БОМДП"  И Результат <> "БОМДЕ"			
			И Результат <> "БОЧК"  И Результат <> "БОТК"
			И Результат <> "БОГР"  И Результат <> "БОПЗ"
			И Результат <> "БОПО" 
			
			Тогда
		
			ОписаниеОшибки = "Значением может быть только одно из следующих: ПНП, ПНЕ, РКП, РКЕ, МДП, МДЕ, БО, ЧК, ТК, ГР, ПЗ, ПО, ЗП, НП, БОПНП, БОПНЕ, БОРКП, БОРКЕ, БОМДП, БОМДЕ, БОЧК, БОТК, БОГР, БОПЗ, БОПО";	
			
		КонецЕсли;

	ИначеЕсли ВРег(Тип) = ВРег("DGKodСausesOperation6") 
		  ИЛИ ВРег(Тип) = ВРег("DGKodСausesOperation6Column") Тогда
		//<!--Причини, складання податкової накладної за окремими операціями версія реєстру 6-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=0");
		Иначе	
			Результат = Строка(Результат);		
		КонецЕсли;
		
		Результат = СокрЛП(Результат);
		
		Если    (СтрДлина(Результат) <> 2)
			ИЛИ (Найти("01",  Лев(Результат, 1)) = 0)
			ИЛИ (Найти("0123456789", Прав(Результат, 1)) = 0)
			ИЛИ (Число(Результат) > 15) Тогда
		
			ОписаниеОшибки = "Значением может быть число от 01 до 15 включительно, с лидирующим нулем"	
		
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGKodRectification6") 
		 ИЛИ  ВРег(Тип) = ВРег("DGKodRectification6Column") Тогда
		//<!--Признак, що дані документа включаються до уточнюючих розрахунків за звітний (податковий) період „У
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = Строка(Результат);		
		КонецЕсли;
		Результат = СокрЛП(ВРег(Результат));
		
		Если НЕ (Результат = "" ИЛИ Результат = "У")   Тогда
		
			ОписаниеОшибки = "Значением может быть только символ ""У"""	
		
		КонецЕсли;

	ИначеЕсли ВРег(Тип) = ВРег("DGKodAssignment6") 
		 ИЛИ  ВРег(Тип) = ВРег("DGKodAssignment6Column") Тогда		
		
		//<!--Признак, - проведено розподіл суми податкового кредиту додається літера „Р” -->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		Иначе	
			Результат = Строка(Результат);		
		КонецЕсли;
		Результат = СокрЛП(ВРег(Результат));
		
		Если НЕ (Результат = "" ИЛИ Результат = "Р")   Тогда
		
			ОписаниеОшибки = "Значением может быть только символ ""Р"""	
		
		КонецЕсли;

	ИначеЕсли ВРег(Тип) = ВРег("DGc_dpi") Тогда
		//<!--Загальний тип "Код ДПІ, використовується для обмеження коду області"-->
		// число, от 100 до 2799
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Формат(Значение,"ЧЦ=4; ЧДЦ=0; ЧГ="));

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 100 
				ИЛИ Контроль > 2899
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 100 до 2899 (код ГНИ)";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 100 до 2899 (код ГНИ)";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGspecNom") 
		  ИЛИ ВРег(Тип) = ВРег("DGspecNomColumn") Тогда
		//<!--Признак спеціальної податкової накладної"-->
		// строка, значение 2,3 или 4 + или 7
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Формат(Значение,"ЧЦ=1; ЧДЦ=0"));

		Если  Результат<> "2"
			И Результат<> "3" 
			И Результат<> "4"
			И Результат<> "5"
			И Результат<> "7"Тогда
			ОписаниеОшибки = "Значение не является одним из значений: 2,3,4,5 или 7";
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGJ13001TypeDocColumn") Тогда
		//<!--Можливі варіанти Виду документа в запиті:
		//	ПН - податкова накладна;
		//	РК - розрахунок коригування до податкової накладної (додаток 2 до податкової накладної));"-->
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = ВРЕГ(СОКРЛП(Результат));
		
		Если  Результат<> "ПН"
			И Результат<> "РК" Тогда
			ОписаниеОшибки = "Значение не является одним из значений:ПН или РК";
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGPNtypr") Тогда
		
		//<!--Можливі значення значення 01, 02, ..., 14-->
		// строка
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Формат(Значение,"ЧЦ=2; ЧДЦ=0; ЧВН="));

		Если Результат = "" Тогда
		ИначеЕсли СтрДлина(Результат) <> 2
			ИЛИ Найти("01", Лев(Результат, 1)) 		    = 0
			ИЛИ Найти("0123456789", Прав(Результат, 1)) = 0 
			ИЛИ (Лев(Результат, 1) = "1" И Найти("01234567", Прав(Результат, 1)) = 0) Тогда
		
				ОписаниеОшибки = "Значением может быть только одно из 01...17";		
			
		КонецЕсли;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGdecimalZero") Тогда
		//<!--Загальний тип "Числовий 0" 0, 0.0, або 0.00-->
		// строка
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СокрЛП(Формат(Значение,"ЧДЦ=2; ЧРД=.; ЧВН="));

		Если Результат = "" Тогда
		ИначеЕсли Результат <> "0"
			    И Результат <> "0.0"
			    И Результат <> "0.00" Тогда
				ОписаниеОшибки = "Значением может быть только ноль";		
		КонецЕсли;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGHIPN0"))
	      ИЛИ (ВРег(Тип) = ВРег("HIPNColumn0"))
		Тогда
		
		//<!--Загальний тип "ІІндивідуальний податковий номер платника з можливістю внесення 0(нуля) "-->
		
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 0 
				ИЛИ Контроль > 999999999999
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 0 до 999999999999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 0 до 999999999999";
		КонецПопытки;

	ИначеЕсли (ВРег(Тип) = ВРег("Odoh1DFColumn"))
	      ИЛИ (ВРег(Тип) = ВРег("DGOdoh1DF"))
		Тогда
		
		//<!--Загальний тип "Ознака доходу 1-ДФ з 01.01.2011"-->
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 101 
				ИЛИ Контроль > 185
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 101 до 185";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 101 до 185";
		КонецПопытки;
		
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGSEAZON"))
	      ИЛИ (ВРег(Тип) = ВРег("SeazonColumn"))
		Тогда
		
		//<!--Загальний тип "Ознака сезон (Пенсійний Фонд України)"-->
		
		Если Не ЗначениеЗаполнено(Значение) Тогда
			Результат = "&ПустоеЗначение";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=0; ЧН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Контроль = Число(Результат);
			Если    Найти(Результат, ".") > 0
				ИЛИ Контроль < 1 
				ИЛИ Контроль > 3
				ИЛИ Цел(Контроль) <> Контроль Тогда
				ОписаниеОшибки = "Значение не является целым числом от 1 до 3";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является целым числом от 1 до 3";
		КонецПопытки		
		
	ИначеЕсли (ВРег(Тип) = ВРег("Oplg1DFColumn"))
	      ИЛИ (ВРег(Тип) = ВРег("DGOplg1DF"))
		Тогда
		
		//<!--Загальний тип "Ознака пільги 1-ДФ з 01.01.2011"-->
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;

		Попытка
			Если  НЕ Результат =  ""
				И НЕ Результат =  "01"
				И НЕ Результат =  "02"
				И НЕ Результат =  "03"
				И НЕ Результат =  "04"  Тогда
				ОписаниеОшибки = "Значение не является кодом от 01 до 04";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является кодом от 01 до 04";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGKodControlledOperationTB08"))
	      ИЛИ (ВРег(Тип) = ВРег("DGKodControlledOperationTB08Column"))
		Тогда
		
		//<!--Загальний тип "Ознака -  вид документа, яким підтверджується здійснення контрольованої операції з постачання „КО” под.накл.8 -->
		Результат = СокрЛП(Строка(Значение));
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;

		Попытка
			Если  Результат <> "КО"  Тогда
				ОписаниеОшибки = "Значение не является код ""КО""";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является код ""КО"""
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGNPNColumn"))
	      ИЛИ (ВРег(Тип) = ВРег("DGNPN")) Тогда
		
		//////№ податкової накладної формат:
		////// nnnnnnN/nnnnn	де:
		////// - n необовязкове значення
		////// - N обовязкове значення
		////// (приклади значень: 125, 125/2, 125/012, 125/2012)
		Если ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧЦ=2; ЧДЦ=0; ЧВН=; ЧГ=0");
		Иначе
			Результат = СокрЛП(Строка(Значение));
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;

		Попытка
			
			ПозицияСлэш = Найти(Результат,"/");
			Если ПозицияСлэш = 0 Тогда
			
				НомерНН = Результат;
				НомерПодрСпецРеж = "";	
			Иначе
				
				НомерНН = Лев(Результат, ПозицияСлэш - 1);
				НомерПодрСпецРеж = Сред(Результат, ПозицияСлэш + 1);
				
			КонецЕсли;
			
			// длина номера до 7 символов, только цифры, без ведущих нулей
			Если СтрДлина(НомерНН) > 7 Тогда
				ВызватьИсключение("");
			КонецЕсли;
			Для Инд = 1 По СтрДлина(НомерНН) Цикл
				Если (Инд = 1) И Найти("123456789", Сред(НомерНН, Инд, 1)) = 0 Тогда 
					ВызватьИсключение("");
				ИначеЕсли Найти("0123456789", Сред(НомерНН, Инд, 1)) = 0 Тогда
					ВызватьИсключение("");
				КонецЕсли;
			КонецЦикла;
			
			Если СтрДлина(НомерПодрСпецРеж) = 1 Тогда
				
				// только код спец режима = 2 или 3 или 4
				Если НЕ НомерПодрСпецРеж = "2" И
					 НЕ НомерПодрСпецРеж = "3" И
					 НЕ НомерПодрСпецРеж = "4" Тогда
					ВызватьИсключение("");				
				КонецЕсли;
				
			ИначеЕсли СтрДлина(НомерПодрСпецРеж) = 3 Тогда
				
				// только цифровой код подразделения
				Для Инд = 1 По 3 Цикл
					Если Найти("0123456789", Сред(НомерПодрСпецРеж, Инд, 1)) = 0 Тогда
						ВызватьИсключение("");
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли СтрДлина(НомерПодрСпецРеж) = 4 Тогда
				// код спец режима = 2 или 3 или 4
				СпецРежим = Лев(НомерПодрСпецРеж,1);
				Если НЕ СпецРежим = "2" И
					 НЕ СпецРежим = "3" И
					 НЕ СпецРежим = "4" Тогда
					ВызватьИсключение("");				
				КонецЕсли;
				
				// цифровой код подразделения
				Для Инд = 2 По 4 Цикл
					Если Найти("0123456789", Сред(СпецРежим, Инд, 1)) = 0 Тогда
						ВызватьИсключение("");
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
			
		Исключение
			ОписаниеОшибки = "Значение не корректным номером налогового документа: nnnnnnN/nnnnn, где n-необяз. значение, N - Обязательное; n и N - цифры.";
		КонецПопытки;

	ИначеЕсли (ВРег(Тип) = ВРег("DGI4lz"))
	      ИЛИ (ВРег(Тип) = ВРег("DGI4lzColumn"))
		Тогда
		
		//<!--Число 4 знаки з початковими нулями від 0000 до 9999 використовується для: * код умовного позначення одиниць виміру ПН
		Результат = СокрЛП(Строка(Значение));
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Результат = СтрЗаменить(Результат, " ","");

		Попытка
			Если    СтрДлина(Результат) <> 4
				ИЛИ Найти("0123456789", Сред(Результат, 1,1)) = 0
				ИЛИ Найти("0123456789", Сред(Результат, 2,1)) = 0
				ИЛИ Найти("0123456789", Сред(Результат, 3,1)) = 0
				ИЛИ Найти("0123456789", Сред(Результат, 4,1)) = 0 Тогда
				ОписаниеОшибки = "Значение не является числом с ведущими нулями от 0000 до 9999";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом с ведущими нулями от 0000 до 9999";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGJ02095Ind3"))
		Тогда
		
		//<!--розділ Декларації (А,Б,В,Г,Ґ,Д)
		Результат = СокрЛП(Строка(Значение));
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Попытка
			Если    СтрДлина(Результат) <> 1
				ИЛИ Найти("АБВГҐД", Сред(Результат, 1,1)) = 0 Тогда
				ОписаниеОшибки = "Значение не является одной из букв А,Б,В,Г,Ґ,Д";
			КонецЕсли;
		Исключение
			ОписаниеОшибки =  "Значение не является одной из букв А,Б,В,Г,Ґ,Д";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGJ02095Ind4"))
		Тогда
		
		//<!--код операції розділу в Декларації акцизного податку  для розширення попереднього типу DGJ02095Ind2 для наступної версії документа
		Результат = СокрЛП(Строка(Значение));
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		Попытка
			Если    Результат <> "Ґ1" Тогда
				ОписаниеОшибки = "Возможно, указан не верный код операции Декларации по Акцизному налогу";
			КонецЕсли;
		Исключение
			ОписаниеОшибки =  "Возможно, указан не верный код операции Декларации по Акцизному налогу";
		КонецПопытки;
		
	ИначеЕсли (ВРег(Тип) = ВРег("DGJ02095Ind6"))
		  ИЛИ (ВРег(Тип) = ВРег("DGJ02095Ind5"))
		Тогда
		
		//<!--код операції розділу в Декларації акцизного податку  для розширення попереднього типу DGJ02095Ind2 для наступної версії документа
		Результат = СокрЛП(Строка(Значение));
		
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		КонецЕсли;
		
		//Попытка
		//	Если   Тогда
		//		ОписаниеОшибки = "";
		//	КонецЕсли;
		//Исключение
		//	ОписаниеОшибки =  "";
		//КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("DGData")  или  ВРег(Тип) = ВРег("DDBODY") Тогда
	ИначеЕсли (ВРег(Тип) = ВРег("SimpleString")) Тогда
		Результат = Значение;
	ИначеЕсли ВРег(Тип) = ВРег("DGVYDZbora") Тогда
		//считаем, что пользователь должен заполнять правильно
	ИначеЕсли ВРег(Тип) = ВРег("DGSummaVKopejkah") Тогда
		// сумма в копейках
		Если ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение*100,"ЧДЦ=0; ЧН=0; ЧГ=0");
		КонецЕсли;
	ИначеЕсли ВРег(Тип) = ВРег("DGLCTRL") Тогда
		Если ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=2; ЧРД=,; ЧГ=0")
		КонецЕсли;	
	ИначеЕсли (ВРег(Тип) = ВРег("DGLongCSTRAX")) Тогда
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&НеЗаписывать";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Попытка
				Результат = Формат(Число(Значение),"ЧЦ=12; ЧВН=; ЧГ=0");
			Исключение
				Результат = "&НеЗаписывать";
				Возврат 1;
			КонецПопытки
		КонецЕсли;
		
	ИначеЕсли (ВРег(Тип) = ВРег("LINKED_DOCS")) Тогда	
		Результат = Значение;
		Возврат 1;
	
	Иначе
		Сообщить(НСтр("ru='Не поддерживаемый XML-тип ';uk='Не підтримуваний XML-Тип '")+Тип);
		
		ОписаниеОшибки = "Тип значения (" + Тип + ") не может быть преобразован!";
		фОбработано = 0;
		
	КонецЕсли;
	
	Возврат фОбработано;
	
КонецФункции

//-----------------------------------
Функция ПреобразоватьТипXMLJ0100107(Значение,Тип,Результат,ОписаниеОшибки)
	
	фОбработано = 0;
	//Если ВРег(Тип) = ВРег("DGint5") Тогда
	//	Если ТипЗначенияСтр(Значение)="Число" Тогда
	//		Результат = Строка(Значение);
	//	КонецЕсли;
	//	Результат = ДополнитьСтроку(Результат,"0",5,1);
	//    фОбработано = 1;
	//КонецЕсли;
	
	Возврат фОбработано;
КонецФункции

Функция ПреобразоватьТипXMLx1201002(Значение,Тип,Результат,ОписаниеОшибки)
	// колонки 3S 4S 5 5S 6 - ДОЛЖНЫ БЫТЬ В ТЕКСТЕ ВЫГРУЗКИ ВСЕГДА (ДАЖЕ ЕСЛИ ОНИ НЕ ЗАПОЛНЕНЫ)
	
	фОбработано = 0;
	Если ВРег(Тип) = ВРег("Decimal3Column")Тогда
		//Загальний тип "Числові дані 3 знаки після коми
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			//Результат = "&НеЗаписывать";
			Результат = "0.000";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=3; ЧРД=.; ЧГ=0");	
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		Попытка
			Контроль = Число(Результат);
			Если    (Найти(Результат, ".") = 0 ИЛИ (Найти(Результат, ".") < СтрДлина(Результат) - 3))  
				ИЛИ Цел(Контроль*1000) <> Контроль*1000 Тогда
				ОписаниеОшибки = "Значение не является числом c тремя знаками после запятой";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c тремя знаками после запятой";
		КонецПопытки;
		
	ИначеЕсли ВРег(Тип) = ВРег("Decimal4Column")Тогда
		//Загальний тип "Числові дані 3 знаки після коми
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			//Результат = "&НеЗаписывать";
			Результат = "0.0000";
			Возврат 1;
		ИначеЕсли ТипЗнч(Значение)=Тип("Число") Тогда
			Результат = Формат(Значение,"ЧДЦ=4; ЧРД=.; ЧГ=0");	
		ИначеЕсли ТипЗнч(Значение)=Тип("Строка") Тогда
			Результат = СтрЗаменить(Значение, " ", ""); Результат = СтрЗаменить(Результат, Символ(160), "");
			Результат = СтрЗаменить(Результат, ",", ".");
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		Результат = СокрЛП(Результат);
		
		Попытка
			Контроль = Число(Результат);
			Если    (Найти(Результат, ".") = 0 ИЛИ (Найти(Результат, ".") < СтрДлина(Результат) - 4))  
				ИЛИ Цел(Контроль*10000) <> Контроль*10000 Тогда
				ОписаниеОшибки = "Значение не является числом c четырьмя знаками после запятой";
			КонецЕсли;
		Исключение
			ОписаниеОшибки = "Значение не является числом c четырьмя знаками после запятой";
		КонецПопытки;	
		
	ИначеЕсли (ВРег(Тип) = ВРег("StrColumn")) Тогда
		  
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			//Результат = "&НеЗаписывать";
			Результат = "&ПустоеЗначение";
			Возврат 1;
		Иначе
			Результат = Строка(Значение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат фОбработано;
	
КонецФункции

Функция ПреобразоватьТипXMLx12012(Значение,Тип,Результат,ОписаниеОшибки)
	
	// колонки  RXXXXG001 RXXXXG2S RXXXXG3S ДОЛЖНЫ БЫТЬ В ТЕКСТЕ ВЫГРУЗКИ ВСЕГДА (ДАЖЕ ЕСЛИ ОНИ НЕ ЗАПОЛНЕНЫ)
	фОбработано = 0;
	Если      (ВРег(Тип) = ВРег("DGI4nomColumn"))
		  ИЛИ (ВРег(Тип) = ВРег("StrColumn")) Тогда
		  
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Результат = "&ПустоеЗначение";
			фОбработано = 1;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат фОбработано;
	
КонецФункции

//-----------------------------------                 
Функция ПреобразоватьТипXML(Значение,Тип,ИмяСхемы,ОписаниеОшибки = "") Экспорт
	СтрокаОбщегоФормата = "ЧРД=.; ЧН=0.00; ЧГ=0; ЧО=1; ДФ=ddMMyyyy; ДП=; БЛ=0; БИ=1";
	
	// Если в списке переданных параметров отсутствует данный показатель, выгружать его не будем.
	Если Значение = Неопределено Тогда
		Возврат "&НеЗаписывать";
	КонецЕсли;
	
	Результат = Значение;
	
	фОбработано = 0;
	//Если необходима обработка какого либо из типов 
	// для отдельной схемы по другому, нужно добавить процедуру и обработчик
	Если ВРег(ИмяСхемы) = "J0100107" Тогда
		// пример, обработки "индивидуального" типа
		Если ПреобразоватьТипXMLJ0100107(Значение, Тип, Результат, ОписаниеОшибки) = 1 Тогда
			// обработано
			фОбработано = 1;
		КонецЕсли;
	КонецЕсли;
	
	// выгрузка налоговых документов
	Если    Сред(ИмяСхемы,2) = "1201002"
		ИЛИ Сред(ИмяСхемы,2) = "1201003" Тогда
		Если ПреобразоватьТипXMLx1201002(Значение, Тип, Результат, ОписаниеОшибки) = 1 Тогда
			// обработано
			фОбработано = 1;
		КонецЕсли;
	КонецЕсли; 
	
	// для П2 с пустой ТЧ необходимо выгружать первые три поля в любом случае
	Если  Сред(ИмяСхемы,2,5) = "12012"
		И Число(Прав(ИмяСхемы,2)) >= 9 Тогда
		Если ПреобразоватьТипXMLx12012(Значение, Тип, Результат, ОписаниеОшибки) = 1 Тогда
			// обработано
			фОбработано = 1;
		КонецЕсли;
	КонецЕсли; 
	
	Если фОбработано = 0 Тогда
		ПреобразоватьТипXMLОбщий(Значение, Тип, Результат, ОписаниеОшибки);
	КонецЕсли;
	
	Если ТипЗнч(Результат)<>Тип("Строка") Тогда
		
		Если Тип = "LINKED_DOCS" Тогда
			Возврат Результат;
		КонецЕсли;
		
		Если    ТипЗнч(Результат)<>Тип("Число")
			ИЛИ ТипЗнч(Результат)<>Тип("Дата")
			ИЛИ ТипЗнч(Результат)<>Тип("Булево")Тогда
			
			Результат = Строка(Результат);
			
		Иначе	
			
			Результат = Формат(Результат,СтрокаОбщегоФормата);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = СокрП(Результат);
	Если Результат = "" Тогда
		Результат = "&НеЗаписывать";
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции


Функция ПолучитьАктуальныйКодНалоговогоДокумента(ТипДокументаMEDoc, ЮрФизЛицо, ИмяШаблона, XSDСхема, СообщениеОбОшибке) Экспорт
	СообщениеОбОшибке = "";
	Параметы = Новый Структура;
	////////////Временное решение
	Если ТипДокументаMEDoc = Перечисления.скEDI_ТипыДокументовMEDoc.Т10202_ Тогда
		Если ЮрФизЛицо = Перечисления.скEDI_ЮрФизЛицо.ЮрЛицо Тогда
			ИмяШаблона = "J1302301";
		ИначеЕсли ЮрФизЛицо = Перечисления.скEDI_ЮрФизЛицо.ФизЛицо Тогда
			ИмяШаблона = "F1302301";
		Иначе
			СообщениеОбОшибке = НСтр("ru = 'Не задан реквизит ""Юридическое/Физическое лицо""'; uk = 'Не задано реквізит ""Юридична/Фізична особа""'");
			Возврат Ложь;
		КонецЕсли;
		XSDСхема = Неопределено;
		Возврат Истина;
	ИначеЕсли ТипДокументаMEDoc = Перечисления.скEDI_ТипыДокументовMEDoc.Т10203_ Тогда
		Если ЮрФизЛицо = Перечисления.скEDI_ЮрФизЛицо.ЮрЛицо Тогда
			ИмяШаблона = "J1305201";
		ИначеЕсли ЮрФизЛицо = Перечисления.скEDI_ЮрФизЛицо.ФизЛицо Тогда
			ИмяШаблона = "F1305201";
		Иначе
			СообщениеОбОшибке = НСтр("ru = 'Не задан реквизит ""Юридическое/Физическое лицо""'; uk = 'Не задано реквізит ""Юридична/Фізична особа""'");
			Возврат Ложь;
		КонецЕсли;
		XSDСхема = Неопределено;
		Возврат Истина;
	КонецЕсли;
	////////////Временное решение...
	КодДокумента = скEDI_ОбщегоНазначения.ПолучитьКодДокументаПоТипуДокументаMEDoc(ТипДокументаMEDoc);
	Параметы.Вставить("SDocType", КодДокумента);
	Если ЮрФизЛицо = Перечисления.скEDI_ЮрФизЛицо.ЮрЛицо Тогда
		Параметы.Вставить("OrgType", "0");
	ИначеЕсли ЮрФизЛицо = Перечисления.скEDI_ЮрФизЛицо.ФизЛицо Тогда
		Параметы.Вставить("OrgType", "1");
	Иначе
		СообщениеОбОшибке = НСтр("ru = 'Не задан реквизит ""Юридическое/Физическое лицо""'; uk = 'Не задано реквізит ""Юридична/Фізична особа""'");
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеПоXSDСхеме = скEDI_КомандыEDIПровайдеру.ПолучитьРезультатКомандыEDIПровайдеру("svc/getxsd", Параметы);
	Если ДанныеПоXSDСхеме.Code = 0 Тогда
		ИмяШаблона = ДанныеПоXSDСхеме.Charcode;
		XSDСхема = ДанныеПоXSDСхеме.Body;
		Возврат Истина;
	Иначе
		СообщениеОбОшибке = ДанныеПоXSDСхеме.Message;
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Функция ПолучитьПоказателиXSDСхемы(ИмяШаблона, XSDСхема, ПоказателиШапка, ПоказателиТело, ПоказателиТЧ1)
	ПоказателиШапка = Новый Соответствие;
	ПоказателиТело = Новый Соответствие;
	ПоказателиТЧ1 = Новый Соответствие;
	
	XSDСхемаТекст = скEDI_ОбщегоНазначения.Base64ЗначениеСтрока(XSDСхема);
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(XSDСхемаТекст);
	ЧтениеXML.Прочитать();
	мДОМ = Новый ПостроительDOM;
	мДокументДОМ 	  = мДОМ.Прочитать(ЧтениеXML);
	Для Каждого ДочернийУзел1 Из мДокументДОМ.ДочерниеУзлы Цикл
		Если ВРег(ДочернийУзел1.ИмяУзла) = ВРег("xs:schema") Тогда
			Для Каждого ДочернийУзел2 Из ДочернийУзел1.ДочерниеУзлы Цикл
				Если ВРег(ДочернийУзел2.ИмяУзла) = ВРег("xs:complexType") Тогда
					ЗначениеАтрибутаName = "";
					Для Каждого АтрибутУзла Из ДочернийУзел2.Атрибуты Цикл
						Если ВРег(АтрибутУзла.Имя) = ВРег("name") Тогда
							ЗначениеАтрибутаName = АтрибутУзла.Значение;
							Прервать;
						КонецЕсли;
					КонецЦикла;
					
					Если ВРег(ЗначениеАтрибутаName) = ВРег("DHead") Тогда
						ЗаполняемПоказателиШапка = Истина;
					ИначеЕсли ВРег(ЗначениеАтрибутаName) = ВРег("DBody") Тогда
						ЗаполняемПоказателиШапка = Ложь;
					Иначе
						Продолжить;
					КонецЕсли;
					
					Для Каждого ДочернийУзел3 Из ДочернийУзел2.ДочерниеУзлы Цикл
						Если ВРег(ДочернийУзел3.ИмяУзла) = ВРег("xs:sequence") Тогда
							Для Каждого ДочернийУзел4 Из ДочернийУзел3.ДочерниеУзлы Цикл
								Если ВРег(ДочернийУзел4.ИмяУзла) = ВРег("xs:element") Тогда
									Узел4ЗначениеАтрибутаName = "";
									Узел4ЗначениеАтрибутаType = "";
									Для Каждого АтрибутУзла Из ДочернийУзел4.Атрибуты Цикл
										Если ВРег(АтрибутУзла.Имя) = ВРег("name") Тогда
											Узел4ЗначениеАтрибутаName = АтрибутУзла.Значение;
										ИначеЕсли ВРег(АтрибутУзла.Имя) = ВРег("type") Тогда
											Узел4ЗначениеАтрибутаType = АтрибутУзла.Значение;
										КонецЕсли;
									КонецЦикла;
									
									Если Узел4ЗначениеАтрибутаName = "" Тогда
										Продолжить;
									КонецЕсли;
									Если Узел4ЗначениеАтрибутаType = "" Тогда
										Продолжить;
									КонецЕсли;
									
									Если ЗаполняемПоказателиШапка Тогда
										ПоказателиШапка.Вставить(Узел4ЗначениеАтрибутаName, Узел4ЗначениеАтрибутаType);
									Иначе
										ПозицияXXXX = Найти(Узел4ЗначениеАтрибутаName,"XXXX");
										Если ПозицияXXXX > 0 Тогда
											//Первый элемент Таблицы
											//имя таблицы, это символы до XXXX
											ИмяТаблицы = Лев(Узел4ЗначениеАтрибутаName, ПозицияXXXX-1);
											ИмяПоказателя = Сред(Узел4ЗначениеАтрибутаName, ПозицияXXXX+4);
											Если ВРег(ИмяТаблицы) = ВРег("R") Тогда
												//ПоказателиТЧ1.Вставить(ИмяПоказателя, Узел4ЗначениеАтрибутаType);
												ПоказателиТЧ1.Вставить(Узел4ЗначениеАтрибутаName, Узел4ЗначениеАтрибутаType);
											Иначе
												// неизвестный показатель
											КонецЕсли;
										Иначе
											ПоказателиТело.Вставить(Узел4ЗначениеАтрибутаName, Узел4ЗначениеАтрибутаType);
										КонецЕсли;
									КонецЕсли;
								ИначеЕсли ВРег(ДочернийУзел4.ИмяУзла) = ВРег("xs:choice") Тогда
									Для Каждого ДочернийУзел5 Из ДочернийУзел4.ДочерниеУзлы Цикл
										Если ВРег(ДочернийУзел5.ИмяУзла) = ВРег("xs:element") Тогда
											Узел5ЗначениеАтрибутаName = "";
											Узел5ЗначениеАтрибутаType = "";
											Для Каждого АтрибутУзла Из ДочернийУзел5.Атрибуты Цикл
												Если ВРег(АтрибутУзла.Имя) = ВРег("name") Тогда
													Узел5ЗначениеАтрибутаName = АтрибутУзла.Значение;
												ИначеЕсли ВРег(АтрибутУзла.Имя) = ВРег("type") Тогда
													Узел5ЗначениеАтрибутаType = АтрибутУзла.Значение;
												КонецЕсли;
											КонецЦикла;
											
											Если Узел5ЗначениеАтрибутаName = "" Тогда
												Продолжить;
											КонецЕсли;
											Если Узел5ЗначениеАтрибутаType = "" Тогда
												Продолжить;
											КонецЕсли;
											
											Если ЗаполняемПоказателиШапка Тогда
												ПоказателиШапка.Вставить(Узел5ЗначениеАтрибутаName, Узел5ЗначениеАтрибутаType);
											Иначе
												ПозицияXXXX = Найти(Узел5ЗначениеАтрибутаName,"XXXX");
												Если ПозицияXXXX > 0 Тогда
													//Первый элемент Таблицы
													//имя таблицы, это символы до XXXX
													ИмяТаблицы = Лев(Узел5ЗначениеАтрибутаName, ПозицияXXXX-1);
													ИмяПоказателя = Сред(Узел5ЗначениеАтрибутаName, ПозицияXXXX+4);
													Если ВРег(ИмяТаблицы) = ВРег("R") Тогда
														//ПоказателиТЧ1.Вставить(ИмяПоказателя, Узел5ЗначениеАтрибутаType);
														ПоказателиТЧ1.Вставить(Узел5ЗначениеАтрибутаName, Узел5ЗначениеАтрибутаType);
													Иначе
														// неизвестный показатель
													КонецЕсли;
												Иначе
													ПоказателиТело.Вставить(Узел5ЗначениеАтрибутаName, Узел5ЗначениеАтрибутаType);
												КонецЕсли;
											КонецЕсли;
										КонецЕсли;
									КонецЦикла;
								КонецЕсли;
							КонецЦикла;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции

Функция ПолучитьПоказателиXSDСхемыИПоказателиXSDСхемы(КешСхем, ТипДокументаMEDoc, ЮрФизЛицо, ИмяШаблона, ПоказателиШапка, ПоказателиТело, ПоказателиТЧ1)
	Если КешСхем = Неопределено Тогда
		КешСхем = Новый Массив;
	Иначе
		Для Каждого СтрокаКешСхем Из КешСхем Цикл
			Если СтрокаКешСхем.ТипДокументаMEDoc = ТипДокументаMEDoc Тогда
				Если СтрокаКешСхем.ЮрФизЛицо = ЮрФизЛицо Тогда
					ИмяШаблона = СтрокаКешСхем.ИмяШаблона;
					ПоказателиШапка = СтрокаКешСхем.ПоказателиШапка;
					ПоказателиТело = СтрокаКешСхем.ПоказателиТело;
					ПоказателиТЧ1 = СтрокаКешСхем.ПоказателиТЧ1;
					Возврат СтрокаКешСхем.Результат;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	XSDСхема = Неопределено;
	СтруктураДляМассиваКешСхем = Новый Структура("ТипДокументаMEDoc, ЮрФизЛицо, Результат, ИмяШаблона, ПоказателиШапка, ПоказателиТело, ПоказателиТЧ1, СообщениеОбОшибке");
	СтруктураДляМассиваКешСхем.ТипДокументаMEDoc = ТипДокументаMEDoc;
	СтруктураДляМассиваКешСхем.ЮрФизЛицо = ЮрФизЛицо;
	СообщениеОбОшибке = "";
	Если ПолучитьАктуальныйКодНалоговогоДокумента(ТипДокументаMEDoc, ЮрФизЛицо, ИмяШаблона, XSDСхема, СообщениеОбОшибке) Тогда
		СтруктураДляМассиваКешСхем.ИмяШаблона = ИмяШаблона;
		ПоказателиШапка = Неопределено;
		ПоказателиТело = Неопределено;
		ПоказателиТЧ1 = Неопределено;
		Если ПолучитьПоказателиXSDСхемы(ИмяШаблона, XSDСхема, ПоказателиШапка, ПоказателиТело, ПоказателиТЧ1) Тогда
			СтруктураДляМассиваКешСхем.ПоказателиШапка = ПоказателиШапка;
			СтруктураДляМассиваКешСхем.ПоказателиТело = ПоказателиТело;
			СтруктураДляМассиваКешСхем.ПоказателиТЧ1 = ПоказателиТЧ1;
			СтруктураДляМассиваКешСхем.Результат = Истина;
		Иначе
			СтруктураДляМассиваКешСхем.СообщениеОбОшибке = "Не обработаны показатели XSD схемы";
			СтруктураДляМассиваКешСхем.Результат = Ложь;
		КонецЕсли;
	Иначе
		СтруктураДляМассиваКешСхем.СообщениеОбОшибке = СообщениеОбОшибке;
		СтруктураДляМассиваКешСхем.Результат = Ложь;
	КонецЕсли;
	Если СтруктураДляМассиваКешСхем.Результат Тогда
		КешСхем.Добавить(СтруктураДляМассиваКешСхем);
	КонецЕсли;
	Возврат СтруктураДляМассиваКешСхем.Результат;
КонецФункции

Функция УдалитьЛидирующиеНули(Знач ВхСтрока)
	ВхСтрока = СокрЛП(ВхСтрока);
	Пока Лев(ВхСтрока, 1) = "0" и СтрДлина(ВхСтрока) > 1 Цикл
		ВхСтрока = Сред(ВхСтрока, 2);
	КонецЦикла;
	Возврат ВхСтрока;
КонецФункции

Функция УдалитьНезначующиеНули(Знач ВхСтрока)
	ЕстьРазделитель = Ложь;
	УдалятьС = -1;
	Для н = 1 по СтрДлина(ВхСтрока) Цикл
		ТекСимвол = Сред(ВхСтрока, н, 1);
		Если ЕстьРазделитель Тогда
			Если ТекСимвол = "0" Тогда
				Продолжить;
			ИначеЕсли Найти("123456789", ТекСимвол) > 0 Тогда
				УдалятьС = н+1;
			Иначе
				ЕстьРазделитель = Ложь;
				УдалятьС = -1;
				Прервать;
			КонецЕсли;
		Иначе
			Если ТекСимвол = "." Тогда
				ЕстьРазделитель = Истина;
				УдалятьС = н;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ЕстьРазделитель Тогда
		Если УдалятьС > 1 Тогда
			Возврат Лев(ВхСтрока, УдалятьС-1);
		Иначе
			Возврат ВхСтрока;
		КонецЕсли;
	Иначе
		Возврат ВхСтрока;
	КонецЕсли;
КонецФункции

Процедура УточнитьПоказатель(ЗначениеА, ЗначениеА_ИмяПоля, ЗначениеАТип, ПодборТочности, Окр1, Окр2, ЗначениеБ, Произведение, ПроизведениеПредставление, ПроизведениеТип, ИмяШаблона, ДанныеСтрокиСоответствие)
	Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ЗначениеА * ЗначениеБ, ПроизведениеТип, ИмяШаблона) <> ПроизведениеПредставление Тогда
		Если ЗначениеБ <> 0 Тогда
			Если ПодборТочности Тогда
				Для ТекРазряд = Окр1 по Окр2 Цикл
					ТекЗначениеА = Окр(Произведение / ЗначениеБ, ТекРазряд);
					Если (скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЗначениеА * ЗначениеБ, ПроизведениеТип, ИмяШаблона) = ПроизведениеПредставление) или (ТекРазряд = Окр2) Тогда
						ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЗначениеА, ЗначениеАТип, ИмяШаблона);
						Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
							ДанныеСтрокиСоответствие.Вставить(ЗначениеА_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
						КонецЕсли;
						Прервать;
					КонецЕсли;
				КонецЦикла;
			Иначе
				ТекЗначениеА = Окр(Произведение / ЗначениеБ, Окр2);
				ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЗначениеА, ЗначениеАТип, ИмяШаблона);
				Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
					ДанныеСтрокиСоответствие.Вставить(ЗначениеА_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ВыгрузитьНалоговыйДокумент1СВСоответствиеЗначений(КешСхем, ИмяШаблона, СоответствиеЗначений, ТипДокументаMEDoc, ВидЭлектронногоДокумента, ОрганизацияEDI, Документ1С, ДанныеДокумента, ДополнительныеПараметры = Неопределено) Экспорт
	ОрганизацияEDI = ВидЭлектронногоДокумента.Владелец;
	ЮрФизЛицо = ОрганизацияEDI.ЮрФизЛицо;
	ПоказателиШапка = Неопределено;
	ПоказателиТело = Неопределено;
	ПоказателиТЧ1 = Неопределено;
	
	Если ПолучитьПоказателиXSDСхемыИПоказателиXSDСхемы(КешСхем, ТипДокументаMEDoc, ЮрФизЛицо, ИмяШаблона, ПоказателиШапка, ПоказателиТело, ПоказателиТЧ1) Тогда
		МассивЗначений = Новый Массив;
		СоответствиеТаблица0 = Новый Соответствие;
		
		СоответствиеТаблица0.Вставить("C_DOC", Сред(ИмяШаблона, 1, 3));
		СоответствиеТаблица0.Вставить("C_DOC_SUB", Сред(ИмяШаблона, 4, 3));
		СоответствиеТаблица0.Вставить("C_DOC_VER", Число(Сред(ИмяШаблона, 7, 2)));
		
		СоответствиеТаблица0.Вставить("PERIOD_TYPE", "1");
		СоответствиеТаблица0.Вставить("C_DOC_TYPE", "0");
		СоответствиеТаблица0.Вставить("C_DOC_STAN", "1");
		
		Документ1ССтруктура = скEDI_НастройкиПодКонфигурацию.ПолучитьИнформациюДляРегистрацииДокумента(Документ1С);
		
		СоответствиеТаблица0.Вставить("PERIOD_MONTH", МЕСЯЦ(Документ1ССтруктура.Дата));
		СоответствиеТаблица0.Вставить("PERIOD_YEAR", ГОД(Документ1ССтруктура.Дата));
		СоответствиеТаблица0.Вставить("C_DOC_CNT", скEDI_ОбщегоНазначения.ПолучитьНомерДокументаВПериоде(ВидЭлектронногоДокумента, Документ1ССтруктура.Дата));
		СоответствиеТаблица0.Вставить("TIN", ОрганизацияEDI.Код);
		//СоответствиеТаблица0.Вставить("LINKED_DOCS", Null);
		СоответствиеТаблица0.Вставить("D_FILL", Формат(ТекущаяДата(), "ДФ='ddMMyyyy'"));
		ДанныеПоОрганизаци = скEDI_НастройкиПодКонфигурацию.ПолучитьДанныеПоОгранизации(Документ1ССтруктура.Организация);
		СоответствиеТаблица0.Вставить("C_STI_ORIG", УдалитьЛидирующиеНули(ДанныеПоОрганизаци.НалоговаяИнспекцияКод));
		СоответствиеТаблица0.Вставить("C_REG", УдалитьЛидирующиеНули(ДанныеПоОрганизаци.НалоговаяИнспекцияРегион));
		СоответствиеТаблица0.Вставить("C_RAJ", УдалитьЛидирующиеНули(ДанныеПоОрганизаци.НалоговаяИнспекцияРайон));
		
		ДанныеФункцииПечатьДокумента = Неопределено;
		Если ДополнительныеПараметры <> Неопределено Тогда
			РезультатыФункцииПечатьДокумента = Неопределено;
			Если ДополнительныеПараметры.Свойство("РезультатыФункцииПечатьДокумента", РезультатыФункцииПечатьДокумента) Тогда
				ХЗДанныеФункцииПечатьДокумента = РезультатыФункцииПечатьДокумента.Получить(Документ1С);
				Если ХЗДанныеФункцииПечатьДокумента <> Неопределено Тогда
					ДанныеФункцииПечатьДокумента = ХЗДанныеФункцииПечатьДокумента.Получить();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если ДанныеФункцииПечатьДокумента = Неопределено Тогда
			ДанныеФункцииПечатьДокумента = скEDI_НастройкиПодКонфигурацию.ПолучитьРезультатФункцииПечатьДокумента(Перечисления.скEDI_ВхИсхЭлектронныйДокумент.Исходящий, ВидЭлектронногоДокумента, Документ1С)
		КонецЕсли;
		
		Если ДанныеФункцииПечатьДокумента = Неопределено Тогда
			
		Иначе
			ДанныеПоТЧ = Неопределено;
			Для Каждого КлючИЗначение из ДанныеФункцииПечатьДокумента Цикл
				Если ВРег(КлючИЗначение.Ключ) = "R" Тогда
					ДанныеПоТЧ = КлючИЗначение.Значение;
				Иначе
					ЗначениеРеквизита = КлючИЗначение.Значение;
					ПоказательТип = ПоказателиТело.Получить(КлючИЗначение.Ключ);
					Если ПоказательТип = Неопределено Тогда
						СоответствиеТаблица0.Вставить(КлючИЗначение.Ключ, ЗначениеРеквизита);
					Иначе
						ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ЗначениеРеквизита, ПоказательТип, ИмяШаблона);
						//Если ЗначениеРеквизита = "&НеЗаписывать" тогда
						//ИначеЕсли ЗначениеРеквизита = "&ПустоеЗначение" Тогда
						//	СоответствиеТаблица0.Вставить(КлючИЗначение.Ключ + " xsi:nil=""true""", "");
						//Иначе
						//	СоответствиеТаблица0.Вставить(КлючИЗначение.Ключ, ЗначениеРеквизита);
						//КонецЕсли;
						Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
							СоответствиеТаблица0.Вставить(КлючИЗначение.Ключ, ЗначениеРеквизита);
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		    МассивЗначений.Добавить(СоответствиеТаблица0);
			СоответствиеЗначений.Вставить("0", МассивЗначений);
	
			МассивЗначений = Новый Массив;
			Если ДанныеПоТЧ <> Неопределено Тогда
				//МассивЗначений = Новый Массив;
				
				Для Каждого СтрокаДанныхПоТЧ Из ДанныеПоТЧ Цикл
					СоответствиеТаблица1 = Новый Соответствие;
					
					Если ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.НалоговаяНакладная") Тогда
						Количество_Прочитано = Ложь;
						Количество_ИмяПоля = "";
						Количество_Значение = Неопределено;
						Количество_ЗначениеПреобразовано = Неопределено;
						Количество_Тип = Неопределено;
						
						Цена_Прочитано = Ложь;
						Цена_ИмяПоля = "";
						Цена_Значение = Неопределено;
						Цена_ЗначениеПреобразовано = Неопределено;
						Цена_Тип = Неопределено;
						
						Сумма_Прочитано = Ложь;
						Сумма_Значение = Неопределено;
						Сумма_ЗначениеПреобразовано = Неопределено;
						Сумма_Тип = Неопределено;
						
						Для Каждого КолонкаТЗ Из ДанныеПоТЧ.Колонки Цикл
							ИмяПоля = "RXXXX" + КолонкаТЗ.Имя;
							ЗначениеРеквизита = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
							ПоказательТип = ПоказателиТЧ1.Получить(ИмяПоля);
							
							Если ПоказательТип = Неопределено Тогда
								СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
							Иначе
								ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ЗначениеРеквизита, ПоказательТип, ИмяШаблона);
								Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
									СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
									
									Если ВРег(ИмяПоля) = "RXXXXG5" Тогда
										Количество_Прочитано = Истина;
										Количество_ИмяПоля = ИмяПоля;
										Количество_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Количество_ЗначениеПреобразовано = ЗначениеРеквизита;
										Количество_Тип = ПоказательТип;
										
										СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
									ИначеЕсли ВРег(ИмяПоля) = "RXXXXG6" Тогда
										Цена_Прочитано = Истина;
										Цена_ИмяПоля = ИмяПоля;
										Цена_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Цена_ЗначениеПреобразовано = ЗначениеРеквизита;
										Цена_Тип = ПоказательТип;
										
										СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
									ИначеЕсли ВРег(ИмяПоля) = "RXXXXG010" Тогда
										Сумма_Прочитано = Истина;
										Сумма_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Сумма_ЗначениеПреобразовано = ЗначениеРеквизита;
										Сумма_Тип = ПоказательТип;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
						Если ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьКоличество") Тогда
							Если Количество_Прочитано и Цена_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Количество_Значение, Количество_ИмяПоля, Количество_Тип, Ложь, -1, 9, Цена_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество_Значение * Цена_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Цена_Значение <> 0 Тогда
								//		ТекКоличество = Окр(Сумма_Значение / Цена_Значение, 9);
								//		ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество, Количество_Тип, ИмяШаблона);
								//		Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//			СоответствиеТаблица1.Вставить(Количество_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//		КонецЕсли;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						ИначеЕсли ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьКоличествоОкрПоНеобходимости") Тогда
							Если Количество_Прочитано и Цена_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Количество_Значение, Количество_ИмяПоля, Количество_Тип, Истина, 3, 12, Цена_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество_Значение * Цена_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Цена_Значение <> 0 Тогда
								//		Для ТекРазряд = 3 по 12 Цикл
								//			ТекКоличество = Окр(Сумма_Значение / Цена_Значение, ТекРазряд);
								//			Если (скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество * Цена_Значение, Сумма_Тип, ИмяШаблона) = Сумма_ЗначениеПреобразовано) или (ТекРазряд = 12) Тогда
								//				ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество, Количество_Тип, ИмяШаблона);
								//				Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//					СоответствиеТаблица1.Вставить(Количество_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//				КонецЕсли;
								//				Прервать;
								//			КонецЕсли;
								//		КонецЦикла;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						ИначеЕсли ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьЦену") Тогда
							Если Количество_Прочитано и Цена_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Цена_Значение, Цена_ИмяПоля, Цена_Тип, Ложь, -1, 9, Количество_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество_Значение * Цена_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Количество_Значение <> 0 Тогда
								//		ТекЦена = Окр(Сумма_Значение / Количество_Значение, 9);
								//		ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЦена, Цена_Тип, ИмяШаблона);
								//		Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//			СоответствиеТаблица1.Вставить(Цена_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//		КонецЕсли;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						ИначеЕсли ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьЦенуОкрПоНеобходимости") Тогда
							Если Количество_Прочитано и Цена_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Цена_Значение, Цена_ИмяПоля, Цена_Тип, Истина, 2, 12, Количество_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество_Значение * Цена_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Количество_Значение <> 0 Тогда
								//		Для ТекРазряд = 3 по 12 Цикл
								//			ТекЦена = Окр(Сумма_Значение / Количество_Значение, ТекРазряд);
								//			Если (скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество_Значение * ТекЦена, Сумма_Тип, ИмяШаблона) = Сумма_ЗначениеПреобразовано) или (ТекРазряд = 12) Тогда
								//				ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЦена, Цена_Тип, ИмяШаблона);
								//				Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//					СоответствиеТаблица1.Вставить(Цена_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//				КонецЕсли;
								//				Прервать;
								//			КонецЕсли;
								//		КонецЦикла;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной") Тогда
						Количество5_Прочитано = Ложь;
						Количество5_ИмяПоля = "";
						Количество5_Значение = Неопределено;
						Количество5_ЗначениеПреобразовано = Неопределено;
						Количество5_Тип = Неопределено;
						
						Цена6_Прочитано = Ложь;
						Цена6_ИмяПоля = "";
						Цена6_Значение = Неопределено;
						Цена6_ЗначениеПреобразовано = Неопределено;
						Цена6_Тип = Неопределено;
						
						Цена7_Прочитано = Ложь;
						Цена7_ИмяПоля = "";
						Цена7_Значение = Неопределено;
						Цена7_ЗначениеПреобразовано = Неопределено;
						Цена7_Тип = Неопределено;
						
						Количество8_Прочитано = Ложь;
						Количество8_ИмяПоля = "";
						Количество8_Значение = Неопределено;
						Количество8_ЗначениеПреобразовано = Неопределено;
						Количество8_Тип = Неопределено;
						
						Сумма_Прочитано = Ложь;
						Сумма_Значение = Неопределено;
						Сумма_ЗначениеПреобразовано = Неопределено;
						Сумма_Тип = Неопределено;
						
						Для Каждого КолонкаТЗ Из ДанныеПоТЧ.Колонки Цикл
							ИмяПоля = "RXXXX" + КолонкаТЗ.Имя;
							ЗначениеРеквизита = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
							ПоказательТип = ПоказателиТЧ1.Получить(ИмяПоля);
							
							//Если ВРег(ИмяПоля) = "RXXXXG6" Тогда
							//	Если ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной") Тогда
							//		Если не ВидЭлектронногоДокумента.НалоговыйДокументРасчетЦеныТочный Тогда
							//			ЗначениеРеквизита = Окр(Число(ЗначениеРеквизита), 2);
							//		КонецЕсли;
							//	КонецЕсли;
							//КонецЕсли;
							
							Если ПоказательТип = Неопределено Тогда
								СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
							Иначе
								ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ЗначениеРеквизита, ПоказательТип, ИмяШаблона);
								Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
									СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
									
									Если ВРег(ИмяПоля) = "RXXXXG5" Тогда
										Количество5_Прочитано = Истина;
										Количество5_ИмяПоля = ИмяПоля;
										Количество5_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Количество5_ЗначениеПреобразовано = ЗначениеРеквизита;
										Количество5_Тип = ПоказательТип;
										
										СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
									ИначеЕсли ВРег(ИмяПоля) = "RXXXXG6" Тогда
										Цена6_Прочитано = Истина;
										Цена6_ИмяПоля = ИмяПоля;
										Цена6_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Цена6_ЗначениеПреобразовано = ЗначениеРеквизита;
										Цена6_Тип = ПоказательТип;
										
										СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
									ИначеЕсли ВРег(ИмяПоля) = "RXXXXG7" Тогда
										Цена7_Прочитано = Истина;
										Цена7_ИмяПоля = ИмяПоля;
										Цена7_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Цена7_ЗначениеПреобразовано = ЗначениеРеквизита;
										Цена7_Тип = ПоказательТип;
										
										СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
									ИначеЕсли ВРег(ИмяПоля) = "RXXXXG8" Тогда
										Количество8_Прочитано = Истина;
										Количество8_ИмяПоля = ИмяПоля;
										Количество8_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Количество8_ЗначениеПреобразовано = ЗначениеРеквизита;
										Количество8_Тип = ПоказательТип;
										
										СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
									ИначеЕсли ВРег(ИмяПоля) = "RXXXXG010" Тогда
										Сумма_Прочитано = Истина;
										Сумма_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
										Сумма_ЗначениеПреобразовано = ЗначениеРеквизита;
										Сумма_Тип = ПоказательТип;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЦикла;
						
						Если ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьЦену") Тогда
						ИначеЕсли ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьЦенуОкрПоНеобходимости") Тогда
						Иначе
							Если Цена6_Прочитано Тогда
								Цена6_Значение = ?(Цена6_Значение < 0, -Окр(-Цена6_Значение,2), Окр(Цена6_Значение,2));
								Цена6_ЗначениеПреобразовано = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Цена6_Значение, Цена6_Тип, ИмяШаблона);
								Если Цена6_ЗначениеПреобразовано <> "&НеЗаписывать" и Цена6_ЗначениеПреобразовано <> "&ПустоеЗначение" Тогда
									СоответствиеТаблица1.Вставить(Цена6_ИмяПоля, УдалитьНезначующиеНули(Цена6_ЗначениеПреобразовано));
								КонецЕсли;
							КонецЕсли;
							Если Цена7_Прочитано Тогда
								Цена7_Значение = ?(Цена7_Значение < 0, -Окр(-Цена7_Значение,2), Окр(Цена7_Значение,2));
								Цена7_ЗначениеПреобразовано = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Цена7_Значение, Цена7_Тип, ИмяШаблона);
								Если Цена7_ЗначениеПреобразовано <> "&НеЗаписывать" и Цена7_ЗначениеПреобразовано <> "&ПустоеЗначение" Тогда
									СоответствиеТаблица1.Вставить(Цена7_ИмяПоля, УдалитьНезначующиеНули(Цена7_ЗначениеПреобразовано));
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
						
						Если ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьКоличество") Тогда
							Если Количество5_Прочитано и Цена6_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Количество5_Значение, Количество5_ИмяПоля, Количество5_Тип, Ложь, -1, 9, Цена6_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество5_Значение * Цена6_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Цена6_Значение <> 0 Тогда
								//		ТекКоличество = Окр(Сумма_Значение / Цена6_Значение, 9);
								//		ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество, Количество5_Тип, ИмяШаблона);
								//		Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//			СоответствиеТаблица1.Вставить(Количество5_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//		КонецЕсли;
								//	КонецЕсли;
								//КонецЕсли;
							ИначеЕсли Количество8_Прочитано и Цена7_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Количество8_Значение, Количество8_ИмяПоля, Количество8_Тип, Ложь, -1, 9, Цена7_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество8_Значение * Цена7_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Цена7_Значение <> 0 Тогда
								//		ТекКоличество = Окр(Сумма_Значение / Цена7_Значение, 9);
								//		ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество, Количество8_Тип, ИмяШаблона);
								//		Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//			СоответствиеТаблица1.Вставить(Количество8_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//		КонецЕсли;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						ИначеЕсли ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьКоличествоОкрПоНеобходимости") Тогда
							Если Количество5_Прочитано и Цена6_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Количество5_Значение, Количество5_ИмяПоля, Количество5_Тип, Истина, 3, 12, Цена6_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество5_Значение * Цена6_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Цена6_Значение <> 0 Тогда
								//		Для ТекРазряд = 3 по 12 Цикл
								//			ТекКоличество = Окр(Сумма_Значение / Цена6_Значение, ТекРазряд);
								//			Если (скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество * Цена6_Значение, Сумма_Тип, ИмяШаблона) = Сумма_ЗначениеПреобразовано) или (ТекРазряд = 12) Тогда
								//				ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество, Количество5_Тип, ИмяШаблона);
								//				Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//					СоответствиеТаблица1.Вставить(Количество5_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//				КонецЕсли;
								//				Прервать;
								//			КонецЕсли;
								//		КонецЦикла;
								//	КонецЕсли;
								//КонецЕсли;
							ИначеЕсли Количество8_Прочитано и Цена7_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Количество8_Значение, Количество8_ИмяПоля, Количество8_Тип, Истина, 3, 12, Цена7_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество8_Значение * Цена7_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Цена7_Значение <> 0 Тогда
								//		Для ТекРазряд = 3 по 12 Цикл
								//			ТекКоличество = Окр(Сумма_Значение / Цена7_Значение, ТекРазряд);
								//			Если (скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество * Цена7_Значение, Сумма_Тип, ИмяШаблона) = Сумма_ЗначениеПреобразовано) или (ТекРазряд = 12) Тогда
								//				ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество, Количество8_Тип, ИмяШаблона);
								//				Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//					СоответствиеТаблица1.Вставить(Количество8_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//				КонецЕсли;
								//				Прервать;
								//			КонецЕсли;
								//		КонецЦикла;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						ИначеЕсли ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьЦену") Тогда
							Если Количество5_Прочитано и Цена6_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Цена6_Значение, Цена6_ИмяПоля, Цена6_Тип, Ложь, -1, 9, Количество5_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество5_Значение * Цена6_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Количество5_Значение <> 0 Тогда
								//		ТекЦена = Окр(Сумма_Значение / Количество5_Значение, 9);
								//		ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЦена, Цена6_Тип, ИмяШаблона);
								//		Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//			СоответствиеТаблица1.Вставить(Цена6_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//		КонецЕсли;
								//	КонецЕсли;
								//КонецЕсли;
							ИначеЕсли Количество8_Прочитано и Цена7_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Цена7_Значение, Цена7_ИмяПоля, Цена7_Тип, Ложь, -1, 9, Количество8_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество8_Значение * Цена7_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Количество8_Значение <> 0 Тогда
								//		ТекЦена = Окр(Сумма_Значение / Количество8_Значение, 9);
								//		ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЦена, Цена7_Тип, ИмяШаблона);
								//		Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//			СоответствиеТаблица1.Вставить(Цена7_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//		КонецЕсли;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						ИначеЕсли ВидЭлектронногоДокумента.НалоговыйДокументРежимУточненияПоказателей = ПредопределенноеЗначение("Перечисление.скEDI_РежимУточненияПоказателей.ПересчитыватьЦенуОкрПоНеобходимости") Тогда
							Если Количество5_Прочитано и Цена6_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Цена6_Значение, Цена6_ИмяПоля, Цена6_Тип, Истина, 2, 12, Количество5_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество5_Значение * Цена6_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Количество5_Значение <> 0 Тогда
								//		Для ТекРазряд = 3 по 12 Цикл
								//			ТекЦена = Окр(Сумма_Значение / Количество5_Значение, ТекРазряд);
								//			Если (скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество5_Значение * ТекЦена, Сумма_Тип, ИмяШаблона) = Сумма_ЗначениеПреобразовано) или (ТекРазряд = 12) Тогда
								//				ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЦена, Цена6_Тип, ИмяШаблона);
								//				Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//					СоответствиеТаблица1.Вставить(Цена6_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//				КонецЕсли;
								//				Прервать;
								//			КонецЕсли;
								//		КонецЦикла;
								//	КонецЕсли;
								//КонецЕсли;
							ИначеЕсли Количество8_Прочитано и Цена7_Прочитано и Сумма_Прочитано Тогда
								УточнитьПоказатель(Цена7_Значение, Цена7_ИмяПоля, Цена7_Тип, Истина, 2, 12, Количество8_Значение, Сумма_Значение, Сумма_ЗначениеПреобразовано, Сумма_Тип, ИмяШаблона, СоответствиеТаблица1);
								//Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество8_Значение * Цена7_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
								//	Если Количество8_Значение <> 0 Тогда
								//		Для ТекРазряд = 3 по 12 Цикл
								//			ТекЦена = Окр(Сумма_Значение / Количество8_Значение, ТекРазряд);
								//			Если (скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество8_Значение * ТекЦена, Сумма_Тип, ИмяШаблона) = Сумма_ЗначениеПреобразовано) или (ТекРазряд = 12) Тогда
								//				ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекЦена, Цена7_Тип, ИмяШаблона);
								//				Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
								//					СоответствиеТаблица1.Вставить(Цена7_ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
								//				КонецЕсли;
								//				Прервать;
								//			КонецЕсли;
								//		КонецЦикла;
								//	КонецЕсли;
								//КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					
					//Количество_Прочитано = Ложь;
					//Количество_ИмяПоля = "";
					//Количество_Значение = Неопределено;
					//Количество_ЗначениеПреобразовано = Неопределено;
					//Количество_Тип = Неопределено;
					//
					//Цена_Прочитано = Ложь;
					//Цена_Значение = Неопределено;
					//Цена_ЗначениеПреобразовано = Неопределено;
					//Сумма_Прочитано = Ложь;
					//Сумма_Значение = Неопределено;
					//Сумма_ЗначениеПреобразовано = Неопределено;
					//Сумма_Тип = Неопределено;
					//
					//Для Каждого КолонкаТЗ Из ДанныеПоТЧ.Колонки Цикл
					//	ИмяПоля = "RXXXX" + КолонкаТЗ.Имя;
					//	ЗначениеРеквизита = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					//	ПоказательТип = ПоказателиТЧ1.Получить(ИмяПоля);
					//	
					//	Если ВРег(ИмяПоля) = "RXXXXG6" Тогда
					//		Если ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной") Тогда
					//			Если не ВидЭлектронногоДокумента.НалоговыйДокументРасчетЦеныТочный Тогда
					//				ЗначениеРеквизита = Окр(Число(ЗначениеРеквизита), 2);
					//			КонецЕсли;
					//		КонецЕсли;
					//	КонецЕсли;
					//	
					//	Если ПоказательТип = Неопределено Тогда
					//		СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
					//	Иначе
					//		ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ЗначениеРеквизита, ПоказательТип, ИмяШаблона);
					//		Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
					//			СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
					//			
					//			Если ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.НалоговаяНакладная") Тогда
					//				Если ВРег(ИмяПоля) = "RXXXXG5" Тогда
					//					Количество_Прочитано = Истина;
					//					Количество_ИмяПоля = ИмяПоля;
					//					Количество_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					//					Количество_ЗначениеПреобразовано = ЗначениеРеквизита;
					//					Количество_Тип = ПоказательТип;
					//					
					//					СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
					//				ИначеЕсли ВРег(ИмяПоля) = "RXXXXG6" Тогда
					//					Цена_Прочитано = Истина;
					//					Цена_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					//					Цена_ЗначениеПреобразовано = ЗначениеРеквизита;
					//					
					//					СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
					//				ИначеЕсли ВРег(ИмяПоля) = "RXXXXG010" Тогда
					//					Сумма_Прочитано = Истина;
					//					Сумма_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					//					Сумма_ЗначениеПреобразовано = ЗначениеРеквизита;
					//					Сумма_Тип = ПоказательТип;
					//				КонецЕсли;
					//			ИначеЕсли ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.Приложение2КНалоговойНакладной") Тогда
					//				Если ВРег(ИмяПоля) = "RXXXXG5" Тогда
					//					СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
					//				ИначеЕсли ВРег(ИмяПоля) = "RXXXXG6" Тогда
					//					СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
					//				ИначеЕсли ВРег(ИмяПоля) = "RXXXXG7" Тогда
					//					СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
					//				ИначеЕсли ВРег(ИмяПоля) = "RXXXXG8" Тогда
					//					СоответствиеТаблица1.Вставить(ИмяПоля, УдалитьНезначующиеНули(ЗначениеРеквизита));
					//				КонецЕсли;
					//			КонецЕсли;
					//			//Если ВидЭлектронногоДокумента.ТипДокумента = ПредопределенноеЗначение("Перечисление.скEDI_ТипыЭлектронныхДокументов.НалоговаяНакладная") Тогда
					//			//	Если ВРег(ИмяПоля) = "RXXXXG5" Тогда
					//			//		Количество_Прочитано = Истина;
					//			//		Количество_ИмяПоля = ИмяПоля;
					//			//		Количество_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					//			//		Количество_ЗначениеПреобразовано = ЗначениеРеквизита;
					//			//		Количество_Тип = ПоказательТип;
					//			//	ИначеЕсли ВРег(ИмяПоля) = "RXXXXG6" Тогда
					//			//		Цена_Прочитано = Истина;
					//			//		Цена_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					//			//		Цена_ЗначениеПреобразовано = ЗначениеРеквизита;
					//			//	ИначеЕсли ВРег(ИмяПоля) = "RXXXXG010" Тогда
					//			//		Сумма_Прочитано = Истина;
					//			//		Сумма_Значение = СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					//			//		Сумма_ЗначениеПреобразовано = ЗначениеРеквизита;
					//			//		Сумма_Тип = ПоказательТип;
					//			//	КонецЕсли;
					//			//КонецЕсли;
					//			
					//		КонецЕсли;
					//	КонецЕсли;
					//КонецЦикла;
					//
					////Если Количество_Прочитано и Цена_Прочитано и Сумма_Прочитано Тогда
					////	
					////	Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(Количество_Значение * Цена_Значение, Сумма_Тип, ИмяШаблона) <> Сумма_ЗначениеПреобразовано Тогда
					////		Если Цена_Значение <> 0 Тогда
					////			Для ТекРазряд = 3 по 12 Цикл
					////				ТекКоличество = Окр(Сумма_Значение / Цена_Значение, ТекРазряд);
					////				Если скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество * Цена_Значение, Сумма_Тип, ИмяШаблона) = Сумма_ЗначениеПреобразовано Тогда
					////					ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ТекКоличество, Количество_Тип, ИмяШаблона);
					////					Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
					////						СоответствиеТаблица1.Вставить(Количество_ИмяПоля, ЗначениеРеквизита);
					////					КонецЕсли;
					////					Прервать;
					////				КонецЕсли;
					////			КонецЦикла;
					////		КонецЕсли;
					////	КонецЕсли;
					////КонецЕсли;
					
					МассивЗначений.Добавить(СоответствиеТаблица1);
				КонецЦикла;
			КонецЕсли;
			
			Если МассивЗначений.Количество() = 0 Тогда
				СоответствиеТаблица1 = Новый Соответствие;
				Для Каждого ПоказательТЧ1 Из ПоказателиТЧ1 Цикл
					ИмяПоля = ПоказательТЧ1.Ключ;// "RXXXX" + КолонкаТЗ.Имя;
					ЗначениеРеквизита = "";//Неопределено;//СтрокаДанныхПоТЧ[КолонкаТЗ.Имя];
					ПоказательТип = ПоказательТЧ1.Значение;//ПоказателиТЧ1.Получить(ИмяПоля);
					ЗначениеРеквизита = скEDI_НалоговыеДокументы.ПреобразоватьТипXML(ЗначениеРеквизита, ПоказательТип, ИмяШаблона);
					Если ЗначениеРеквизита <> "&НеЗаписывать" и ЗначениеРеквизита <> "&ПустоеЗначение" Тогда
						СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
					//Иначе
					//	СоответствиеТаблица1.Вставить(ИмяПоля, "");
					КонецЕсли;
					//СоответствиеТаблица1.Вставить(ИмяПоля, ЗначениеРеквизита);
				КонецЦикла;
				МассивЗначений.Добавить(СоответствиеТаблица1);
			КонецЕсли;
			СоответствиеЗначений.Вставить("1", МассивЗначений);
		КонецЕсли;
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции
