
Процедура Старт(пФорма) Экспорт
	пФорма.Пактум_УИД_ФоновогоЗадания=Строка(Новый УникальныйИдентификатор);
КонецПроцедуры

Процедура НачатьАутентификацию1С(ОповещениеОЗавершенииАутентификации) Экспорт
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершенииАутентификации, "");
КонецПроцедуры

Процедура СообщитьОНевозможностиАутентификацииЗавершение(ОповещениеОЗавершенииАутентификации) Экспорт
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершенииАутентификации, Неопределено);
	
КонецПроцедуры

Функция ПроверкаЗавершенияФоновогоЗадания(пКодПоЕДРПОУ, пКод, пУИД, пКоличествоПроверок_ФоновогоЗадания, пФорма, Конфигурация="БП") Экспорт
	СтруПодтверждение=Пактум_Сервер.ПолучитьПодтверждение_ЗавершенияФоновогоЗадания(пУИД);
	фЗавершить=Ложь;
	Если СтруПодтверждение.Выполнено Тогда
		РазблокироватьФорму(пФорма, Конфигурация);
		Стру = Пактум_Сервер.ПолучитьКонтрагента(СокрЛП(пКодПоЕДРПОУ), пКод);
		
		пФорма.Модифицированность = Ложь;
		пФорма.Закрыть();
		Оповестить("Пактум.НовыйКонтрагент", Стру.Контрагент);
		ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта", Новый Структура("Ключ", Стру.Контрагент));
		Если СтруПодтверждение.Ошибки Тогда
			Сообщить(СтруПодтверждение.ТекстОшибки);
		КонецЕсли;
		Пактум_Сервер.УдалитьИзРегистра_ФоновыеЗадания(пУИД);
		фЗавершить=Истина;
	Иначе
		Если пКоличествоПроверок_ФоновогоЗадания >=21 Тогда 	//3 мин + 30 сек
			Сообщить("Заполнить карточку контрагента с ЕДРПОУ "+СокрЛП(пКодПоЕДРПОУ)+" не удалось.");
			фЗавершить=Истина;
			РазблокироватьФорму(пФорма, Конфигурация);
		КонецЕсли;
	КонецЕсли;
	
	Возврат фЗавершить; 
КонецФункции

Процедура ЗаблокироватьФорму(пФорма, Конфигурация) Экспорт
	пФизЛицо=Ложь;
	Если Лев(Конфигурация, 2)="БП" Тогда
		Если пФорма.Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
			пФизЛицо=Истина;
		КонецЕсли;
	ИначеЕсли Конфигурация="УНФ" Тогда
		Если пФорма.Объект.ВидКонтрагента=ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель") Тогда
			пФизЛицо=Истина;
		КонецЕсли;
	КонецЕсли;
	Если пФизЛицо Тогда
		пФорма.Элементы.ЗаполнитьПоЕГРПОУ1.Видимость=Ложь;
		пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ1.Видимость=Истина;
	Иначе
		пФорма.Элементы.ЗаполнитьПоЕГРПОУ.Видимость=Ложь;
		пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ.Видимость=Истина;
	КонецЕсли;
	пФорма.ТолькоПросмотр=Истина;
КонецПроцедуры

Процедура РазблокироватьФорму(пФорма, Конфигурация) Экспорт
	пФизЛицо=Ложь;
	Если Лев(Конфигурация, 2)="БП" Тогда
		Если пФорма.Объект.ЮридическоеФизическоеЛицо=ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
			пФизЛицо=Истина;
		КонецЕсли;
	ИначеЕсли Конфигурация="УНФ" Тогда
		Если пФорма.Объект.ВидКонтрагента=ПредопределенноеЗначение("Перечисление.ВидыКонтрагентов.ИндивидуальныйПредприниматель") Тогда
			пФизЛицо=Истина;
		КонецЕсли;
	КонецЕсли;
	Если пФизЛицо Тогда
		пФорма.Элементы.ЗаполнитьПоЕГРПОУ1.Видимость=Истина;
		пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ1.Видимость=Ложь;
	Иначе
		пФорма.Элементы.ЗаполнитьПоЕГРПОУ.Видимость=Истина;
		пФорма.Элементы.ДекорацияЗаполнитьПоЕГРПОУ.Видимость=Ложь;
	КонецЕсли;
	пФорма.ТолькоПросмотр=Ложь;
КонецПроцедуры

Процедура Лого_Нажатие() Экспорт
	ЗапуститьПриложение("http://pactumsys.com");
КонецПроцедуры