#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ТаблицаФормОтчета() Экспорт
		
			
	мСтруктураВариантыЗаполнения = Новый Структура;

	ОписаниеТиповСтрока = ОбщегоНазначенияБПКлиентСервер.ПолучитьОписаниеТиповСтроки(254);
	
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока15  = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная));
	
	МассивТипов = Новый Массив; 
	МассивТипов.Добавить(Тип("Строка"));
	ОписаниеТиповСтрока254 = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));
	
	МассивБулево = Новый Массив;
	МассивБулево.Добавить(Тип("Булево"));
	ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);
	
	// Таблица значений хранит состав показателей отчета.
	// В колонках таблицы хранятся следующие данные:
	//    - имя поля табличного документа;
	//    - код показатели по составу показателей;
	//    - код показателя по форме (имя области табличного документа);
	//    - признак многострочности;
	//    - тип данных показателя.
	ТаблицаСоставПоказателей = Новый ТаблицаЗначений;
	ТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока254);
	ТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока254);
	ТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока254);
	ТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока254);
	ТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока254);
	
    НоваяФорма = ТаблицаФормОтчета.Добавить();
    НоваяФорма.ФормаОтчета        = "ФормаОтчета2015УФ";
    НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Отчет о поступлении зерновых и масляничных культур (Форма 2015)'; uk = 'Звіт про надходження зернових та олійних культур (Форма 2015)'");
    НоваяФорма.ДатаНачалоДействия = '20130614';
    НоваяФорма.ДатаКонецДействия  = '20181231';
    //	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2019УФ";	
	НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Отчет о поступлении зерновых и масляничных культур (Форма 2019)'; uk = 'Звіт про надходження зернових та олійних культур (Форма 2019)'");	
	НоваяФорма.ДатаНачалоДействия = '20190111';
	НоваяФорма.ДатаКонецДействия  = '20201231';

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2021УФ";	
	НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Отчет о поступлении зерновых и масляничных культур (Форма 2021)'; uk = 'Звіт про надходження зернових та олійних культур (Форма 2021)'");	
	НоваяФорма.ДатаНачалоДействия = '20200101';
	НоваяФорма.ДатаКонецДействия  = '20211231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2022УФ";	
	НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Отчет о поступлении зерновых и масляничных культур (Форма 2022)'; uk = 'Звіт про надходження зернових та олійних культур (Форма 2022)'");	
	НоваяФорма.ДатаНачалоДействия = '20220101';
	НоваяФорма.ДатаКонецДействия  = '20221231';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2023УФ";	
	НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Отчет о поступлении зерновых и масляничных культур (Форма 2023)'; uk = 'Звіт про надходження зернових та олійних культур (Форма 2023)'");	
	НоваяФорма.ДатаНачалоДействия = '20230101';
	НоваяФорма.ДатаКонецДействия  = ОбщегоНазначенияБПКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Процедура ЗаполнитьТаблицуПоказателейНаСервере(ТаблицаПоказателей, Макет) Экспорт

	ТабличныйДокумент = ПолучитьМакет(Макет);
	СтруктураРеквизитов	= Новый Структура();
    Номер = 1;	
    Для ИндСтроки = 4 По ТабличныйДокумент.ВысотаТаблицы Цикл
		ТекущаяОбласть = ТабличныйДокумент.ПолучитьОбласть("R" + Строка(ИндСтроки));
		Для Каждого ТекОбласть Из ТабличныйДокумент.Области Цикл
			
			ЗначениеРеквизита = ТабличныйДокумент.Область(ИндСтроки, ТекОбласть.Лево, ИндСтроки, ТекОбласть.Право).Текст;
			СтруктураРеквизитов.Вставить(ТекОбласть.Имя, ЗначениеРеквизита);
		КонецЦикла;
			
			
		НовыйЭлемент = ТаблицаПоказателей.Добавить(); 
		Для Каждого ТекРеквизит Из СтруктураРеквизитов Цикл
            НовыйЭлемент[ТекРеквизит.Ключ] = ТекРеквизит.Значение;
        КонецЦикла;
        НовыйЭлемент.КлючСвязи = Номер;
        НовыйЭлемент.Код = Формат(Номер,"ЧЦ=9; ЧВН=; ЧГ=");
        Номер = Номер +1;
    КонецЦикла;


КонецПроцедуры
 
#КонецОбласти

#КонецЕсли
