#Область ПрограммныйИнтерфейс

// Данная процедура написана компанией ИН-АГРО.
//
Функция ИНАГРО_ВызовЗащищеннойОбработки(ИмяОбработки) Экспорт
	
	текОбработка = ИНАГРО_СЛК.ВызовЗащищеннойОбработки(ИмяОбработки);
	
	Если текОбработка = Неопределено Тогда
		#Если Клиент Тогда						
			ТекстСообщения = НСтр("ru='Ключ не поддерживает эту подсистему.';uk='Ключ не підтримує цю підсистему.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
		#КонецЕсли
	КонецЕсли;
	
	Возврат текОбработка;
	
КонецФункции

#КонецОбласти
