#Область ПрограммныйИнтерфейс

// Возвращает массив видов расчета из коллекции.
//
Функция ВидыРасчетаКоллекции(КоллекцияСтрок, ИмяКолонки = "ВидРасчета") Экспорт 
	
	МассивВидовРасчета = Новый Массив;
	Для каждого СтрокаКоллекции Из КоллекцияСтрок Цикл
		Значение = СтрокаКоллекции[ИмяКолонки];
		МассивВидовРасчета.Добавить(Значение);
	КонецЦикла; 
	
	Возврат МассивВидовРасчета;
	
КонецФункции

// Функция позволяет заполнить признак ИспользуетФормулу (вторичные данные) вида расчета.
//
// Параметры:
//	- СпособРасчета - ПеречислениеСсылка.СпособыРасчетаНачислений, ПеречислениеСсылка.СпособыРасчетаУдержаний
//
// Возвращаемое значение - булево, Истина - если способ расчета - произвольная формула.
//
Функция СпособРасчетаИспользуетФормулу(СпособРасчета) Экспорт
	
	Возврат СпособРасчета = ПредопределенноеЗначение("Перечисление.СпособыРасчетаНачислений.ПроизвольнаяФормула");
	
КонецФункции

#КонецОбласти